{"tweets": ["Whatever it takes. Watch the brand new trailer for Marvel Studios’ #AvengersEndgame, in theaters April 26.", "Dive into Carol Danvers' story and explore her secrets in the latest History of Captain Marvel installment, as we look back at \"The Life of Captain Marvel\":", "Get ready for \"Symbiote Spider-Man\" #1 with a look at the best of Spidey versus Mysterio:", "Didja know the Masters of Evil inspired spin-offs? Learn more about this Super Villain team on http://Marvel.com : http://bit.ly/2FbYyGM  #Marvel80", "ICYMI: See the new trailer and poster for Marvel Studios' #AvengersEndgame on http://Marvel.com :", "Read about what the MCU had to say about the new trailer for Marvel Studios' #AvengersEndgame:", "In celebration of the \"Marvel Team-Up\" relaunch next month, take a look back at 10 of the best stories from the original series! Which one's your favorite?", ".@BrieLarson, @SamuelLJackson, and more from Marvel Studios' @CaptainMarvel join this week's episode of #WomenOfMarvel! Listen now: https://apple.co/2HxR8PC ", "As you read about her adventures in \"West Coast Avengers,\" look back at Kate Bishop's debut in the pages of \"Young Avengers\":", "Celebrate Women's History Month with your very own #PowersAOfGirl science squad party! Learn how:", "From Clint's mohawk to Carol Danvers' arrival, look through the 11 most surprising moments from this morning's new trailer for Marvel Studios' #AvengersEndgame:", "She should have been up there all this time. Check out the official Marvel Studios' #AvengersEndgame poster. @DanaiGurira #WakandaForever", "Be the luckiest Marvel fan on the block with these #StPatricksDay tees! Get them in time to celebrate here:", "Can you spell Svartalfheim? On a new episode of #EarthsMightiestShow presented by @Marvel_FFightUS, we visit @MidtownComics for a #WarOfTheRealms\" spelling bee, then chat with writer @GregPak about the New Agents of Atlas: http://bit.ly/2Fbjf5E  #ad", "Take a look at the most stylish outfits from this week's new comics on http://Marvel.com :", "As the powerful goddess of death, Hela believes that her dominion knows no bounds. In a new #Marvel101, witness the clash of the Asgardians and test how far the rule of Death can reach: http://bit.ly/2F97rAU  #ad", "The creators behind Bêlit’s modern origin story come together to discuss the making of a pirate queen! Pick up \"Age of Conan: Bêlit, Queen of the Black Coast\" #1, out now:", "\"Magnificent Ms. Marvel\" writer @SaladinAhmed tells all about the new series on http://Marvel.com ! Pick up the first issue now:", "Here's your first look at the new poster for Marvel Studios’ #AvengersEndgame. See it in theaters April 26.", "So, THAT’S a Flerken! Check out Captain Marvel’s cat in action with this #MarvelUnlimited panel of the week. Read the entire \"Release the Flerken\" arc today: http://bit.ly/2Hg82CO ", "ICYMI: See the new faces joining Season 2 of \"Marvel's @CloakAndDagger\"! Learn more: http://bit.ly/2Hx6hR3  #CloakAndDagger", "\"Marvel's Avengers: #BlackPanthersQuest\" is nominated for Outstanding Children's Program at the NAACP Image Awards! Today is the LAST DAY cast your vote, so act quick: http://bit.ly/2Hm3ZFg  #ImageAwards50", "America Chavez and #CaptainAmerica join forces to defend the city and bring down an evil sea monster in a new \"@Marvel_Rising Ultimate Comic\"! #MarvelRising", "We partnered with @Marvel and @BrieLarson for @CaptainMarvel to celebrate Women of Power in front of the camera, behind the camera and all women! #FunkoWomenOfPower #CaptainMarvel", "Evolution demands adaptation or dominance… #MarvelComics", "Discover what makes her a hero. Marvel Studios’ @CaptainMarvel is now playing in theaters. Get tickets: http://www.Fandango.com/CaptainMarvel ", "See the new faces joining Season 2 of \"Marvel's @CloakAndDagger\"! Learn more: http://bit.ly/2Hhf2iX  #CloakAndDagger", "Ready for @CloakAndDagger\nSeason 2?? Check out the first look at three brand new characters:\nhttps://comicbook.com/marvel/2019/03/13/cloak-and-dagger-season-2-new-characters-photos/ …", "What in the world is a Flerken? After seeing Goose in Marvel Studios' @CaptainMarvel, learn more about Carol Danvers' feline companion on http://Marvel.com :", "Madame Tussauds New York (@nycwax) welcomes Carol Danvers, AKA #CaptainMarvel! Read more about her arrival:", "Get ready to shapeshift and infiltrate your way past enemies as Talos enters #MarvelPuzzleQuest! Read more: http://bit.ly/2HgqUSo  @MarvelPuzzle", "HUNTED BEGINS! Kraven needs one more trophy to complete his collection – the Spider. Find out Kraven's plan when you purchase \"Amazing Spider-Man\" #17 in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2H2PqX0  to get started.", "Embiggen this #NCBD! Head to the Digital Comics Shop and snag our 100+ pages, behind-the-scenes Director’s Cut edition of \"Magnificent Ms. Marvel\" #1! On sale now by Eisner winner @saladinahmed and @minkyujungart: http://bit.ly/2HtDT2i ", "Didja know Squirrel Girl has her own helicopter? Learn all about this squirrelly heroine on http://Marvel.com :", "\"Amazing Spider-Man\" editor @nick_lowe_ provides some insight on who's lurking behind Peter Parker in the shadows on the cover of issue #24! Have a look:", "Explore the science behind the #XMen with scientists from Stanford and Princeton as they weigh in on Havok's power set:", "From \"Tony Stark: Iron Man\" #9 to \"Ms. Marvel\" #1, this week's comics focus on all sorts of family issues! Listen to an all-new #MarvelsPullList podcast now: http://bit.ly/2CgK72j ", "There’s a thin line between justice and revenge. \n\"Marvel’s @CloakAndDagger\" Season 2 premieres Thursday, April 4 on @FreeformTV. #CloakAndDagger", "In this episode of #EatTheUniverse, chef @EatFellowHumans welcomes #EarthsMightiestShow's @lorrainecink and #MarvelsVoices @AngeliqueRoche to create a Skrull-inspired dish! Get the recipe: http://spr.ly/SkrullSalad \n\nSee the Skrulls in action in Marvel Studios' #CaptainMarvel now!", "\"#StarWars: Age Of Republic - General Grievous\" #1 writer @Jody_Houser give us an inside look at the Separatist leader ahead of tomorrow's comic release:", "To celebrate one of the Marvel Universe's most beloved alien species, look through the Skrulls' wildest, most brazen attempts to hide in plain sight:", "Explore the origins of Bêlit before she arrives in \"Age of Conan: Bêlit, Queen of the Black Coast\" #1:", "Felicia Hardy's not your average manipulator. Read about the top five sneaky schemes from Black Cat:", "Marvel’s mightiest Super Heroes assemble in the @LEGOMarvelGame Collection, available today! Relive all three #LEGOMarvel games in this colossal, action-packed adventure: http://bit.ly/2F7XNyu ", "Captain Marvel has arrived. Marvel Studios’ @CaptainMarvel is the #1 movie in the world. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Flippin' out for #NationalPancakeDay.  (@drdancake)", "On the latest #WomenOfMarvel podcast, Trina Robbins talks to hosts @OMG_Dj_Judy and @MiniB622 about the comics women read AND created in the '40s and '50s! Listen:", "New this week in #MarvelUnlimited! Asgardians defend the galaxy, Captain Marvel’s 60s series, Wade Wilson: Secret Agent! Plus, and Thanos returns to the present. See all new titles here: http://bit.ly/2HzTCNB ", "New member of the Carol Corps? Get up to 67% off recommended starter stories featuring Captain Marvel! Visit the Digital Comics Shop today and try one these amazing entry points for one of Earth’s mightiest heroes: http://bit.ly/2H9YgCd ", "There's a lot more to Sam Wilson than meets the eye! Read about some of the greatest stories featuring Falcon:", "Look back on some of Carol Danvers' biggest battles as a result of misunderstandings, mind control, and more:", "Who is Ronan the Accuser? Get to know the Kree warrior on http://Marvel.com :", "Is anyone luckier than Domino? Relive some of Neena Thurman's most death-defying tales alongside the brand-new \"Domino: Hotshots\" #1:", "What happened this week in Marvel's 80-year history? Read more to find out: http://bit.ly/2HftQ1p  #Marvel80", "As the God of Thunder and son of Odin, Thor wields the mystical mallet Mjolnir as he protects innocents on his own and as a member of the Avengers! This week on #Marvel101, we journey across the realms with an Asgardian prince: http://bit.ly/2F62AjR ", "Are you excited for \"War of the Realms\"? Check out the cover for the fifth issue now:", "See all six #MarvelMeow variant covers by artist @_nao_fuj on http://Marvel.com  now! Which one's your favorite?", "Read all about Carol Danvers' humble beginnings and her cosmic journey through the galaxy:", "See the exclusive Marvel Studios' #AntManAndTheWasp figures from @CollectDST! Find out where you can get them on http://Marvel.com :", "Analyze a breakdown of Carol Danvers' super power skill set compared to the rest of Earth's Mightiest Heroes! See the stats for all your favorite Avengers on http://Marvel.com :", "Learn about Marvel Comics' greatest team-ups of the 1960s in a new #MarvelTopTen! Watch: http://bit.ly/2F4C36w  #Marvel80", "The Secret Warriors must put aside their differences and work together to save Lockjaw from the evil Exile in a story by Laila from Young Storytellers, featuring @KathreenKhavari, @RogerCraigSmith, and more! @youngstory #MarvelRising", "Women of Marvel, Assemble! Throw on your greatest @Marvel gear and come to @MidtownComics Grand Central this Friday. I'll be signing my book #PowersOfAGirl for an epic #WomenofMarvel meet-up along with host @omg_dj_judy! More detail here: https://www.facebook.com/events/424362048107606/ …", "X-Men artist @MarcusTo joins the latest #MarvelsVoices podcast to chat with host @AngeliqueRoche about \"Age of X-Man: Next Gen\" and his journey as a comic book artist:", "Marvel Studios' @CaptainMarvel soars to great heights with record-breaking numbers at the box office! Read more:", "The world needs a hero. Marvel Studios’ @CaptainMarvel is in theaters now. Get tickets: http://www.Fandango.com/CaptainMarvel ", "On a new episode of #MakeMeAHero, fan @AngeliqueMiles brings her Super Hero to life with the ability of magical weapons to help and inspire those around her! Watch: http://bit.ly/2EZaRGm ", "Higher. Further. Faster. Marvel Studios’ @CaptainMarvel is now playing in theaters. Get tickets: https://fandan.co/2Hcbaji ", "Ms. Marvel returns in a new #1! Talos shapeshifts into Marvel Puzzle Quest! @LEGOMarvelGame Collection announced! It's time for your #MarvelMinute with @LorraineCink. #ad", "Want to learn all about the Kree’s shape-shifting foes? Check out these pivotal Skrull moments in this #MarvelUnlimited reading list: http://bit.ly/2HtiCpl ", "Host @AgentM will be joined by EIC @CBCebulski in an upcoming #ThisWeekInMarvel podcast to talk about “Fantastic Four” #48-51! Read the Galactus Trilogy in #MarvelUnlimited and tweet us your questions and comments with hashtag #TWIMURC: http://bit.ly/2Hcq3Cj ", "Did you see Marvel Studios' #CaptainMarvel in theaters over the weekend? Tell us your favorite part of the film using the hashtag #EarthsMightiestShow and your response may appear in an upcoming episode!", "Fly higher, further, faster into the Marvel Universe with one year of #MarvelUnlimited for only $60! Use code FLERKEN at checkout: https://www.marvel.com/comics/unlimited/ …", "A hero takes flight in this new #CaptainMarvel novel! Read Carol Danvers' barrier-breaking adventures from her first year in the U.S. Air Force: http://bit.ly/2H9LsM9 ", "Take a look at the Marvel Studios' @CaptainMarvel-inspired poster by artist @nickybarkla! See the film in theaters now: https://fandan.co/2HqTShO ", "“I’ve never seen anything like her.” Marvel Studios’ @CaptainMarvel is now playing in theaters. Get tickets: https://fandan.co/2HvsgrV ", "Marvel Studios’ @CaptainMarvel is the #1 movie in the world. Get tickets to see it in theaters now: http://www.Fandango.com/CaptainMarvel ", "The ultimate @CaptainMarvel experience! @BrieLarson helped fans get their popcorn and soda on opening weekend. #CaptainMarvel #HigherFurtherFaster (2/2)", "The ultimate @CaptainMarvel experience! @BrieLarson helped fans get their popcorn and soda on opening weekend. #CaptainMarvel #HigherFurtherFaster (1/2)", ".@CaptainMarvel herself, @BrieLarson, popped into theaters on Saturday night to surprise fans on opening weekend! #CaptainMarvel #HigherFurtherFaster", "Hear what the stars and directors behind Marvel Studios' #CaptainMarvel have to say about about the film in this special #EarthsMightiestShow clip: http://bit.ly/2NREBYq ", "Higher. Further. Faster. Check out this Marvel Studios' @CaptainMarvel-inspired poster by artist @tommypocket. See the film in theaters now: https://fandan.co/2H6WXEd ", "Hope begins with a hero. Marvel Studios’ @CaptainMarvel is now playing in theaters. Get tickets: https://fandan.co/2HtMdiq ", "Silence your . No spoilers.  \n\nEnjoy Marvel Studios’ @CaptainMarvel, now playing in theaters: http://www.fandango.com/CaptainMarvel ", "Captain Marvel has arrived. Get tickets to see Marvel Studios’ @CaptainMarvel in theaters now: http://www.Fandango.com/CaptainMarvel ", "Party like it's 1999 with every 90s song from Marvel Studios' #CaptainMarvel:", "Listen to the Marvel Studios' @CaptainMarvel orchestral score by composer @PinarToprak, and see the original motion picture soundtrack album cover on http://Marvel.com :", "Marvel Studios' #CaptainMarvel stars @BrieLarson and @LashanaLynch talk about the special bond between Carol Danvers and Maria Rambeau on http://Marvel.com :", "Get ready to Marvel. See Marvel Studios’ @CaptainMarvel in theaters now: http://www.Fandango.com/CaptainMarvel ", "Marvel Studios’ @CaptainMarvel is NOW PLAYING. Get tickets: http://www.Fandango.com/CaptainMarvel ", "Read our spoiler-free roundup of the reviews for Marvel Studios' #CaptainMarvel:", "Witness the rise of a hero. Marvel Studios’ @CaptainMarvel is in theaters now. Get tickets: https://fandan.co/2H9V2i4 ", "Happy #InternationalWomensDay from the cast of Marvel Studios' @CaptainMarvel!", "“I’ve never seen anything like her.” Marvel Studios’ @CaptainMarvel is NOW PLAYING in theaters. Get tickets: http://www.Fandango.com/CaptainMarvel ", "To the women guiding our future. http://bit.ly/2J2Y4GL  #InternationalWomensDay", "“I’ve been waiting for this moment.” Marvel Studios’ @CaptainMarvel is NOW PLAYING in theaters. Get tickets: http://www.Fandango.com/CaptainMarvel ", "The cast and crew of Marvel Studios' #CaptainMarvel reminisce on five 90s relics they wish were still around:", "Before you see this furry feline on the big screen in Marvel Studios' #CaptainMarvel, learn all about #GooseTheCat on http://Marvel.com  right meow:", "Take a look at the Marvel Studios' @CaptainMarvel-inspired poster by artist Aracely Muñoz!", "#MarvelInsiders, experience Marvel Studios’ @CaptainMarvel in REALD 3D! Redeem your points for 25% off RealD tickets on Atom Tickets. Visit http://bit.ly/2H7aYlw  for more details. Terms apply.", "Marvel Studios' @CaptainMarvel is in theaters TONIGHT. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Get ready to marvel. See Marvel Studios’ @CaptainMarvel in theaters TONIGHT: https://fandan.co/2H4HFzJ ", ".@captainmarvel's @brielarson and @SamuelLJackson driving around singing @ArianaGrande and taking lie detector tests? We're here for it.\n\nThis must-see @CarpoolKaraoke drops this Friday! Watch it for free on the @AppleTV app: http://apple.co/Carpool_Karaoke ", "Witness her story in the making. Be the first to see Marvel Studios’ @CaptainMarvel TONIGHT. Get tickets: http://www.Fandango.com/CaptainMarvel ", "Higher. Further. Faster. Get ready for Marvel Studios’ #CaptainMarvel with a very special #EarthsMightiestShow, featuring interviews with the cast and creators of the film, plus behind-the-scenes footage and much more! Watch the full episode: http://bit.ly/2EUzJ1K ", "Author @LizaPalmer spoke with http://Marvel.com  about how she captures the essence of Carol Danvers' tenacity in \"#CaptainMarvel: Higher, Further, Faster\"! Read the interview:", "See the new official tees for Marvel Studios' \"Captain Marvel\", and find out how you can get your own:", "It's Captain Marvel versus Iron Man! Examine Carol Danvers' role against Tony Stark in \"Civil War II\":", "Explore the Dark Lord's greatest moments from the original \"#StarWars\" comic series ahead of \"Star Wars: Vader – Dark Visions\":", "From cast and crew interviews to set stories, get a behind-the-scenes look at \"@CaptainMarvel: The Official Movie Special\" from @TitanBooks on http://Marvel.com ! Preorder now:", "Before the Cosmic Ghost Rider tries to mess with the time-space continuum in \"Cosmic Ghost Rider Destroys Marvel History,\" learn all about how time travel and Marvel Comics go hand-in-hand on http://Marvel.com :", ".@BrieLarson, who plays Carol Danvers in Marvel Studios’ @CaptainMarvel, sits down with #WomenOfMarvel host @OMG_Dj_Judy to talk about how this role is the most “dynamic” one she’s ever done! Learn more: http://bit.ly/2Uo1khj ", "Tune in to @JimmyKimmelLive tonight to see @Gemma_Chan of Marvel Studios' @CaptainMarvel!", "Meet the leading ladies of Domino's new team, the Hotshots, ahead of today's new release of \"Domino: Hotshots\" #1:", "Watch @SamuelLJackson’s appearance on @JimmyKimmelLive from last night, and watch tonight for @Gemma_Chan from Marvel Studios' @CaptainMarvel:", "Look back on Bruce Banner and Betty Ross' love story and its crucial moments before you read the new \"Immortal Hulk\" #14:", "\"Ziggy Pig - Silly Seal Comics\" writers @JohnCerilli and @FrankTieri talk all about the animal comedy comics and its history in a new #ThisWeekInMarvel bonus! Watch and listen to the full podcast episode: http://bit.ly/2Uow7KE  #Marvel80", "Discover your power. Marvel Studios’ @CaptainMarvel is in theaters tomorrow night. Get tickets: http://www.Fandango.com/CaptainMarvel ", "#BlackPanthersQuest's @LaDaisy04 and @JamesMathisIII answer your questions about voice acting and working on the animated show in a new episode of #AskMarvel!", "Captain Marvel's feline companion may appear adorable, but looks can be deceiving! Learn more about Chewie's comic origins:", "\"He says he's not intimidating but he is.\" @brielarson on meeting @SamuelLJackson for the first time ever and winning him over. http://gma.abc/2Kv1ezJ \n@captainmarvel\n#CaptainMarvel\n@MarvelStudios", "\"I did enjoy it and I do want to do it again...I only pulled 6.5Gs!\"\n\n@brielarson on flying in a fighter jet for @captainmarvel. http://gma.abc/2Kv1ezJ \n#CaptainMarvel", "Squirrel Girl and Tippy-Toe fight off a vicious monster with the Master of the Mystic Arts in this week's \"@Marvel_Rising Ultimate Comic\"! #MarvelRising", "Higher. Further. Faster. Celebrate Marvel Studios' Captain Marvel arriving this weekend with a new poster and enamel pins from @MondoNews and artist Matt Taylor! On sale now: http://mondotees.com ", "Did you catch @BrieLarson of Marvel Studios' @CaptainMarvel on @JimmyKimmelLive? Watch now, and don’t miss @Gemma_Chan on Kimmel tonight:", "“I’m ready.” Be the first to see Marvel Studios’ @CaptainMarvel in theaters tomorrow night. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Discover what makes her a hero. Marvel Studios’ @CaptainMarvel is in theaters tomorrow night. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "The third set of the Marvel Studios' 10th Anniversary emoji pin series by @100soft is here! Head to @Disney_DMR to redeem your points NOW: http://bit.ly/2NMpdwy ", "These stylish looks are perfect for winter! See the best costumes from this week's new comic releases:", "Who is Darth Vader? See him in a different light when you get \"Star Wars: Vader – Dark Visions\" #1 from the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2NKDXMs  to get started.", "Get a FREE #CaptainMarvel collectible lithograph when you purchase any Captain Marvel product on http://shopDisney.com  with code CAPTAIN or at your local Disney store by saying CAPTAIN MARVEL to any Cast Member! @shopdisney", "The #Marvel80 celebration continues with #MarvelUnlimited! Read the comics that laid the groundwork for modern Marvel with these Silver Age hits: http://bit.ly/2NHpwbP ", "Some of the best Marvel characters made their debut in the 1990s! See the 10 heroes who made our list:", "See all the photos and best moments from the red carpet world premiere of Marvel Studios' @CaptainMarvel:", "These evil organizations of the Marvel Universe will stop at nothing to get what they want. What's your favorite team of Super Villains?", "Relive the 90s with a Tower Records party and live Twitter Q&A with the cast of Marvel Studios' @CaptainMarvel! See the photos:", "When did Carol Danvers become #CaptainMarvel? Learn about the aliases that led up to the hero we know her as today:", "On this week's new #MarvelsPullList podcast, @AgentM and @RickeyPurdin get into painful reunions and break down four new Marvel comics! Listen to the full episode: http://bit.ly/2ERIZUB ", "Our hosts highlight the #CaptainMarvel inspired updates coming to @MarvelChampions at last night's red carpet world premiere! #ad", "Comedian and @TheDailyShow Correspondent @DulceSloan stops by on a new episode of #EatTheUniverse to cook up a Tournedos of Beef dish, inspired by the X-Men's Storm! Watch, and get the recipe: http://bit.ly/2EPZEb6 ", "Don't miss @SamuelLJackson on @JimmyKimmelLive tonight! #CaptainMarvel", "We caught up with Ben Mendelsohn at the #CaptainMarvel premiere to find out the definition of Skrullin' and what draws him to sinister roles, presented by @MarvelChampions! #ad", "Take a closer look at Carol Danvers' time with Alpha Flight and the Ultimates in this History of #CaptainMarvel installment:", " @CitizenWatchUS ambassador @ItsJoshPeck searches for the biggest #CaptainMarvel fan in this clip from the red carpet world premiere! #ad", "As one of the mightiest Marvel Super Heroes, #CaptainMarvel played a critical role in assembling the Secret Warriors! Watch \"@Marvel_Rising: Secret Warriors\" on the Marvel HQ YouTube channel now: http://youtu.be/iNaTd-Jxr3k  #MarvelRising", "#CaptainMarvel stars @brielarson and @LashanaLynch hit the red carpet to talk about the importance of their characters, presented by @MarvelChampions! #ad", "The stars of Marvel Studios’ @CaptainMarvel shined bright on the red carpet at last night’s world premiere. (3/3)", "The stars of Marvel Studios’ @CaptainMarvel shined bright on the red carpet at last night’s world premiere. (2/3)", "The stars of Marvel Studios’ @CaptainMarvel shined bright on the red carpet at last night’s world premiere. (1/3)", "This is your moment. Marvel Studios’ @CaptainMarvel is in theaters Friday. Get tickets: http://www.Fandango.com/CaptainMarvel ", "Who are the Kravinoffs? As Spider-Man becomes the Hunted, meet the family behind Kraven the Hunter:", "Three days until Marvel Studios' @CaptainMarvel. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "In honor of Marvel's 80th anniversary, take a look back at #ThisWeekInMarvel History with @AgentM: http://bit.ly/2H27sZt  #Marvel80", "“She might just be the beginning.” Marvel Studios’ @CaptainMarvel is in theaters Friday. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "On now, Buy 2 Get the 3rd Free on all adult graphic novels and manga, including titles from @Marvel. In-store and online. Offer ends March 31. http://www.indig.ca/01n5TB ", "Before seeing Marvel Studios' @CaptainMarvel in theaters, brush up on Carol Danver’s comic history with #MarvelUnlimited! Go higher, further, faster with these 101 reads: http://bit.ly/2NHo7lz ", "That’s a wrap on the Marvel Studios’ @CaptainMarvel red carpet world premiere - see #CaptainMarvel in theaters this Friday, March 8! Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Roll call, Agents! @MingNa @chloebennet @Lil_Henstridge @YOSOYCORDOVA #CaptainMarvel", "Meeting the fans, #CaptainMarvel-style! @brielarson", ".@BrieLarson soars onto the #CaptainMarvel red carpet. ", ".@temterune and Algenis Perez Soto, ready for action. #CaptainMarvel", ".@LashanaLynch makes a perfect landing on the #CaptainMarvel red carpet.", ".@ClarkGregg, reporting for duty! #CaptainMarvel", "We spy with our little eye... @SamuelLJackson #CaptainMarvel", "Keeping up with @leepace on the red carpet. #CaptainMarvel", "A stellar arrival, @gemma_chan. #CaptainMarvel", "It’s @Marvel_Rising’s own Squirrel Girl and Ms. Marvel, @mintmilana and @KathreenKhavari! #CaptainMarvel", "Ben Mendelsohn, just Skrullin’ around. #CaptainMarvel", "Marvel Studios’ @CaptainMarvel co-writers/directors Anna Boden and @fleckryan1 hit the red carpet. #CaptainMarvel", "The @AFThunderbirds of @usairforce kick off the Marvel Studios’ #CaptainMarvel red carpet! #AFFlyover", "Higher. Further. Faster. We're LIVE from the Marvel Studios' #CaptainMarvel red carpet world premiere from Hollywood! Watch for our interviews with the cast and much more, presented by @MarvelChampions.  ", "Say hello the hosts of the @captainmarvel livestream! @JDHeyman @lorrainecink @AngeliqueRoche @tamarakrinsky #CaptainMarvel #HigherFurtherFaster", "We’re here at the Marvel Studios’ #CaptainMarvel World Premiere red carpet in Hollywood - stay tuned here and visit our Instagram Stories for all the action! Watch our livestream at 5:30pm PT: http://Marvel.com/CaptainMarvelLive …", "Tune in to @JimmyKimmelLive  tonight to see @CaptainMarvel herself, @BrieLarson!", "Did you know Spider-Man once went cosmic? Learn about Peter Parker’s struggles with the infinite power of Captain Universe:", "Four days until Marvel Studios' @CaptainMarvel. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Celebrate the cosmic hero with a new look at the History of Captain Marvel:", "“We need heroes. We need you.” See Marvel Studios’ @CaptainMarvel in theaters Friday. Get tickets: http://www.Fandango.com/CaptainMarvel ", "This week's @Marvel_Rising tale from Jordyn of Young Storytellers features Lockjaw and Tippy-Toe, as they learn the importance of kindness and making new friends! #MarvelRising @youngstory", "“My entire lifetime of experience is coming together to play this character right now.” #MondayMotivation #CaptainMarvel", "TONIGHT! Join us LIVE from the #CaptainMarvel red carpet premiere at 5:30pm PT/8:30pm ET. Tune in for live interviews with the cast and more: https://twitter.com/marvel ", "She's not the person she once was. She's Mayhem. \"Marvel's @CloakAndDagger\" Season 2 premieres Thursday, April 4 on @FreeformTV. #CloakAndDagger", "New comics heading your way! Learn about your favorite Marvel stars with #AskMarvel! It's time for your #MarvelMinute with host @LorraineCink.", "It’s the ultimate 90s party LIVE from @TowerRecordsUSA in Hollywood featuring a Q&A with the cast of #CaptainMarvel and performances from @BushOfficial and @L7officialHQ! ", "We're co-hosting the #CaptainMarvel red carpet world premiere in Hollywood on Monday! Have questions for the cast? Reply to this tweet and they could be answered.", "You haven't seen anything yet. One month until \"Marvel's @CloakAndDagger\" Season 2 premieres Thursday, April 4 on @FreeformTV. #CloakAndDagger", "The Skrull was no match for #CaptainMarvel in February's #MarvelPixelBattle! Tune in later this month for another big match-up. ", "Who are the kings and queens of the notorious Hellfire Club? Read through our list of the worst members on http://Marvel.com :", "You can't keep a good Deathlok down. Learn about five of his biggest battles, from Captain America to Wolverine:", "Hit rewind and go back to where it all began with #NickFury⁠ ⁠in Marvel Studios’ @CaptainMarvel. See the film in theaters Friday: http://Fandango.com/CaptainMarvel ", "Five days until Marvel Studios' @CaptainMarvel. See the film in theaters Friday: http://www.Fandango.com/CaptainMarvel ", "Tune-in tomorrow to the #CaptainMarvel live cast Q&A on Twitter at 9AM PT. With performances by @BushOfficial and L7. ", "“This is your moment.” Marvel Studios’ @CaptainMarvel is in theaters in five days. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "ICYMI: Fan Jamari Young wants to harness the power of time travel to help those who can't defend themselves! Watch the latest episode of #MakeMeAHero now: http://bit.ly/2EFPLMN ", "Never underestimate the power of these hard-fighting Asgardian women! Who's your favorite?", "The X-Men have seen their share of switching sides. Read about four times when the good mutants turned bad:", "ICYMI: Host, interviewer, and creator of stuff @JoshuaHorowitz joins chef @EatFellowHumans on the latest #EatTheUniverse to create a Heathrow Vance-inspired X-Ray Tuna Noodle Casserole in honor of Marvel’s 80th anniversary! Get the recipe: http://bit.ly/2U6JKhu  #Marvel80", "See the new Marvel Studios' @CaptainMarvel-inspired poster from artist @Kazoomori!", "Get ready to marvel. See Marvel Studios’ @CaptainMarvel in theaters March 8: http://www.Fandango.com/CaptainMarvel ", "From comics to the real world! In this #EarthsMightiestShow bonus presented by @Visible, we examine Marvel Universe tech that ultimately became real-life inventions! Watch: http://bit.ly/2Vu8m4b  #ad", "Whose side are you on? Relive the defining event that divided the Marvel Universe with these 13 big \"Civil War\" moments:", "\"Marvel's Avengers: #BlackPanthersQuest\" is nominated for Outstanding Children's Program at the NAACP Image Awards! Register now, and cast your vote daily from now until March 13: http://bit.ly/2NE7iYD  @naacpimageaward #ImageAwards50", "From comics to games, get up to speed on all the Marvel news from the week with our round-up of top highlights:", "Catch all the latest episodes of our digital series on http://Marvel.com ! Go: http://www.marvel.com/watch ", "Take a trip back to the future with the #EarthsMightiestShow bonus reading guide! Read these time travel comics on #MarvelUnlimited now:", "Go anthropomorphic for animal comics with a new #ThisWeekInMarvel podcast with \"Ziggy Pig - Silly Seal Comic\" writers @FrankTieri and @JohnCerilli! Listen to the full episode: http://bit.ly/2GUXkl1  #Marvel80", "Explore how Carol Danvers became Captain Marvel by reexamining @KellySue DeConnick's 2012 landmark comic run:", "On a new episode of #MarvelLetsPlay, @NoreDavis shows Jon Glaser, host of #JonGlaserLovesGear, all the tips and tricks to play #SpiderManPS4! Watch: http://bit.ly/2Vv2ffW ", "With Kraven making a mess out of our favorite webslinger's life, look back on 1987's \"Kraven's Last Hunt\":", "Apply for a Marvel Mastercard® for a chance to win a trip to the premiere of Marvel Studios’ #AvengersEndgame! http://bit.ly/2EGmaCX \n\nNo purch or app necessary. Open to 50 U.S./U.S Terr./D.C./PR, 18+. Ends 3/31/2019. Rules: http://marvelcardapplysweeps.dja.com ", "\"Captain Marvel: Braver & Mightier\" writer @Jody_Houser and artist Simone Buonfantino tell all about what's ahead for the cosmic-powered Super Hero in the new one-shot:", "Do you have questions for the cast of #CaptainMarvel? Drop them here and they might be answered during the live red carpet world premiere on 3/4!", "Fan Jamari Young wants to harness the power of time travel to help those who can't defend themselves! Watch a new episode of #MakeMeAHero now: http://bit.ly/2EFPLMN ", "Rack up points and redeem for cool rewards like these, just by being a #MarvelInsider! Terms apply: http://bit.ly/2NxK7PV ", "Get into all the new comics coming to #MarvelUnlimited this month:", "\"Marvel's @CloakAndDagger\" is coming to @WonderCon in Anaheim! On March 29, see the cast at the panel, meet them at an exclusive signing, and grab THIS poster. See you then! http://bit.ly/2Nz4pbu  #CloakAndDagger #MarvelWonderCon", "Watch a behind-the-scenes look at the cast of Marvel Studios’ @CaptainMarvel, in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Get ready for Riri Williams, AKA Ironheart! Be the first to see \"@Marvel_Rising: Heart of Iron\" at the world premiere event at WonderCon, and stick around for an exclusive autograph signing: http://bit.ly/2EFjOnY  #MarvelRising #MarvelWonderCon", "\"Marvel's @AgentsofSHIELD\" returns to @WonderCon! Here's your look at the teaser poster for the upcoming season, and we’ll see you on March 30 for the panel and exclusive autograph signing: http://bit.ly/2EFjOnY  #AgentsofSHIELD #MarvelWonderCon", "Marvel Television is coming to @WonderCon! Get all the details on http://Marvel.com : http://bit.ly/2EFjOnY  #MarvelWonderCon", "One week until Marvel Studios’ @CaptainMarvel. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "The cast of #CaptainMarvel will be answering your questions live on Twitter this Monday at 9:00AM PT. \nReply with your questions for @BrieLarson, @SamuelLJackson, @ClarkGregg, @LashanaLynch, & Ben Mendelsohn.  ", "Discover your power and take flight with all-new #CaptainMarvel products from @Walmart! Explore the guide on http://Marvel.com : http://bit.ly/2Vr2vwo  #ad", "Relive five of the most memorable moments featuring these powerful Asgardian brothers! What's your favorite Thor and Loki moment?", "You don't want to underestimate these three Marvel heroes! Who do you consider an underdog in the Marvel Universe?", "Look through our list of the seven most powerful Inhumans of the Marvel Universe:", "Learn more about Ken Hale, AKA Gorilla Man, and his debut as you read this week's old school-inspired \"Marvel Comics Presents\" #2:", "In honor of Kraven's return in \"Amazing Spider-Man\" #16, explore four of the best tales featuring the world's greatest hunter:", "See the photos of the cast and crew at the European Gala screening for Marvel Studios' @CaptainMarvel in London:", "Celebrate #MarvelUnlimited's milestone 25,000 digital comics with some staff favorites! What Marvel comic are you currently reading?", "Step back into the 90s with @BrieLarson and @SamuelLJackson as they play \"This or That?\" in a special Marvel Studios' @CaptainMarvel featurette:", "Didja know Johnny Storm once married a Skrull? Learn more about these shapeshifters on http://Marvel.com : http://bit.ly/2VnbPBi  #Marvel80", "The Kree control one of the oldest and most expansive empires in the entire universe. This week on #Marvel101, the Kree are at war, and they are sending their super soldiers across the universe: http://bit.ly/2EDkryq ", "With \"Superior Spider-Man\" going cosmic, look back on eight other characters who've had a taste of such power:", "Dive into Marvel's Golden Age with writer and historian Trina Robbins as she chats about the 1940s and 1950s on a new #WomenOfMarvel podcast! Listen to the full episode: http://bit.ly/2VsDVeC  #Marvel80", "Who remembers these? #TBT #CaptainMarvel(5/5)", "Who remembers these? #TBT #CaptainMarvel(4/5)", "Who remembers these? #TBT #CaptainMarvel(3/5)", "Who remembers these? #TBT #CaptainMarvel(2/5)", "Who remembers these? #TBT #CaptainMarvel(1/5)", "Witness the rise of a hero. Here’s your look at the Marvel Studios' @CaptainMarvel-inspired poster from artist @CryssyCheung!", "You've heard of the X-Men and the X-Tremists, but did you know there are other X-groups in the Marvel Universe? Read about five other teams with a “X” in their name:", "\"Age of X-Man: X-Tremists\" writer Leah Williams (@mymonsterischic) and artist Georges Jeanty (@KabaLounge) chats with http://Marvel.com  about the team-up and what to expect from the series:", "Take a look through the exclusive @EW photos from Marvel Studios' @CaptainMarvel! Read more: http://bit.ly/2Vspzuy  (2/2)", "Take a look through the exclusive @EW photos from Marvel Studios' @CaptainMarvel! Read more: http://bit.ly/2Vspzuy  (1/2)", "I  90’s #TBT #CaptainMarvel", "On a new #EarthsMightiestShow presented by @Visible, our hosts take a look at the future with classic time-travel comics, comic tech that became real, and they play a game of Candid Captions with comedian @RoyWoodJr! Watch: http://bit.ly/2EEEdcN ", "Here's the brand new @EW cover for Marvel Studios' #CaptainMarvel! Read more: http://bit.ly/2GQQSvG ", "#MarvelUnlimited hits 25K comics! To celebrate, we’re sampling MU’s most-read single issue for our panel of the week. Read the entire Infinity Trilogy today: http://bit.ly/2NtAQIv ", "Are you a fan of \"Infinity Gauntlet\" #1 from the 90s? Rediscover seven details you might not know about the classic comic:", "Sometimes, fights are just unfair. Read through some of the most off-kilter face-offs in Marvel history:", "Run down the most noteworthy moments in the Avengers’ comic history on http://Marvel.com :", "#CaptainMarvel arrives in select Disney parks next month! Learn more:", "Higher. Further. Faster. Download the brand new Marvel Studios' @CaptainMarvel iOS Stickers by @100Soft today: http://itunes.apple.com/app/id1452366831?mt=8 …", "Take a look at the cast and filmmakers of Marvel Studios' @CaptainMarvel at the European Gala Screening!  (3/3)", "Take a look at the cast and filmmakers of Marvel Studios' @CaptainMarvel at the European Gala Screening!  (2/3)", "Take a look at the cast and filmmakers of Marvel Studios' @CaptainMarvel at the European Gala Screening!  (1/3)", "Wakanda forever! Take a deep dive into the lore of the world’s most technologically-advanced nation:", "In this #MarvelsPullList bonus, colorist Matt Wilson (@COLORnMATT) chats with @AgentM about four of his favorite colored Marvel comics, including \"Loki\" #1, \"Thor\" #1 and \"Uncanny X-Force\" #1! Watch: http://bit.ly/2VsaJVb ", "Get ready for next week's return of Ziggy Pig and Silly Seal with a look at these five anthropomorphic creatures of the Marvel Universe! Who's your favorite?", "Marvel Comics Editor-in-Chief @CBCebulski joins a new #ThisWeekInMarvel podcast once again to continue Marvel's 80th anniversary celebration with a discussion of \"Tales of Suspense\" and \"Tales to Astonish\" from the 1950s! Listen: http://bit.ly/2VqAJQO  #Marvel80", "Check out these casually cool styles from this week's new comics! What's your favorite hero look?", "Today’s \"@Marvel_Rising Ultimate Comic\" features the noble Patriot, as he teams up with Hawkeye and learns some important lessons! #MarvelRising", "In August 2019, everyone is a target. #MarvelComics", "True Believers! Experience the Marvel Universe in a brand new way when you sign up for @MarvelHeroTales, an upcoming mobile adventure: http://spr.ly/MarvelHeroTales  #ad", "A perfect world doesn’t just happen, it needs to be cultivated. That’s where the X-Tremists come in! Purchase \"Age of X-Man: X-Tremists\" #1 issue in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2IbriD5  to get started.", "#MarvelUnlimited hits 25K comics! Celebrate by checking out our Top 10 countdown of MU’s most-read events and storylines picked by our readers: http://bit.ly/2NrdpiU ", "Captain Marvel enters #MarvelPuzzleQuest! Learn more about her arrival, and watch the @MarvelGames teaser: http://bit.ly/2GNAbBe  @MarvelPuzzle", "Carol Danvers takes flight in \"Captain Marvel: Liberation Run,\" the new novel by critically acclaimed author Tess Sharpe (@sharpegirl)! Read an excerpt:", "See some of the best Marvel cosplay from this year's Katsucon on http://Marvel.com :", "Hey #MarvelInsiders! Have you ever wanted to share your favorite comics with fellow Marvel fans? Now's your chance with the new \"Create a Marvel Reading List\" reward. Only one available, so head over to http://marvel.com/insider/rewards  to redeem. Terms apply.", "From \"Daredevil\" #2 and \"Invaders\" #2, get into this week's comics ad more with hosts @AgentM and @TuckerMarkus on a new #MarvelsPullList podcast! Listen to the full episode: http://bit.ly/2BToipl ", "Marvel Studios' \"@CaptainAmerica: The First Avenger\" is now available on 4K Ultra HD! Here's your guide on how to watch it:", "Before all the terrifying Super Villains came around, the Marvel Universe was filled with beastly creatures! Learn all about the top Silver Age monsters in this #MarvelTopTen: http://bit.ly/2U4KMut  #Marvel80", "Featuring art by Daniel Acuña (@LagartoMurciano), @LeinilYu, and more, get a preview of 20 variant covers for the 25th anniversary of \"Marvels\" on http://Marvel.com :", "“Something in my past is the key to all of this.” Check out this Marvel Studios' @CaptainMarvel-inspired by poster from artist @RolaRafal!", "Host, interviewer, and creator of stuff @JoshuaHorowitz joins chef @EatFellowHumans on a new #EatTheUniverse to create a Heathrow Vance-inspired X-Ray Tuna Noodle Casserole in honor of Marvel’s 80th anniversary! Get the recipe: http://bit.ly/2U6JKhu  #Marvel80", "See Marvel Studios' @CaptainMarvel in theaters in 10 days.  Get tickets now:  http://www.Fandango.com/CaptainMarvel ", "Join People and @EW as we co-host Marvel Studios' #CaptainMarvel red carpet world premiere LIVE from Hollywood on March 4th at 5:30pm PT/8:30pm ET! Watch interviews with the cast and more here: http://marvel.com/captainmarvellive …", "Go through the comic book history of the Purifiers, who have made it their mission to hunt down mutants:", "Join @People and Entertainment Weekly as we co-host Marvel Studios' #CaptainMarvel red carpet world premiere LIVE from Hollywood on March 4th at 5:30pm PT/8:30pm ET! Watch interviews with the cast and more here: http://marvel.com/captainmarvellive …", "Two months until Marvel Studios' #AvengersEndgame. See the film in theaters April 26.", "Higher. Further. Faster. Join us for the Marvel Studios' #CaptainMarvel red carpet world premiere LIVE from Hollywood on March 4th at 5:30pm PT/8:30pm ET! Watch all our interviews with the cast and more, presented by @marvelchampions: http://marvel.com/captainmarvellive … #ad", "In 10 days, witness the rise of a hero. Marvel Studios’ @CaptainMarvel is in theaters March 8. Get tickets: http://www.Fandango.com/CaptainMarvel ", "#MarvelUnlimited hits 25K comics! In honor of this milestone, check out the Top 25 most-read issues that our readers deem worthy: http://bit.ly/2GJhzCf ", "Relive the #Oscars with a look back at 12 Marvel moments! What was your favorite highlight?", "Get your Miles Morales fix with \"Miles Morales: Spider-Man\" by writer @SaladinAhmed with art by @JavierGarron, available in our digital comics shop: http://bit.ly/2NtWAUC ", "Marvel Studios' #BlackPanther makes history with three Academy Awards! Read more:", "In this @Marvel_Rising story by Young Storyteller Brianna, Squirrel Girl and Tippy-Toe have a surprise encounter with Quake on their way to Lockjaw's pool party! Watch @mintmilana, @chloebennet, and more: http://bit.ly/2Ew0kC5  @youngstory", "All eyes on the #BlackPanther. Read \"Black Panther: A Nation Under Our Feet\" #1 by Ta-Nehisi Coates from our digital comics shop now: http://bit.ly/2GJv5pr ", "New this week in #MarvelUnlimited! The Punisher goes global in his current ongoing, the West Coast Avengers reassemble, and Nova’s complete 70s series. See all new titles here: http://bit.ly/2NuJFSj ", "On March 8, discover your power. Get tickets to Marvel Studios’ @CaptainMarvel now: http://www.Fandango.com/CaptainMarvel ", "Season 2 of #WolverinePodcast sets a premiere date! See the Season 2 trailer of \"Marvel's @CloakAndDagger\"! It's time for your #MarvelMinute with host @LorraineCink.", "Watch @BrieLarson take flight in this behind-the-scenes look at Marvel Studios' @CaptainMarvel. #MondayMotivation", "Dive into Marvel Studios' #CaptainMarvel with this deluxe Titan Books collector's edition, featuring exclusive cast and crew interviews, images from the set, behind-the-scenes specials, and more! Pre-order here: https://amzn.to/2TTbSoe ", "Congratulations to Marvel Studios' #BlackPanther on their Academy Award win for Best Original Score! #Oscars", "Congratulations to Marvel Studios' #BlackPanther on their Academy Award win for Best Production Design! #Oscars", "Congratulations to Marvel Studios' #BlackPanther on their Academy Award win for Best Costume Design! #Oscars", "ICYMI: In the latest episode of #MarvelLetsPlay, host @NoreDavis teaches comedian and button smasher @BrianReganComic how to swing like a pro in #SpiderManPS4!  Watch: http://bit.ly/2Nj6yb9  \n\nCheck out Brian’s Netflix show, “Stand Up and Away,\" out now.", "Tune in TONIGHT for the season finale of \"Marvel's Avengers: #BlackPanthersQuest\" at 6pm PT/9pm ET on @DisneyXD! Join the cast as they livetweet the episode, and be sure to use the hashtag.", "Witness the rise of a hero. Check out this Marvel Studios' @CaptainMarvel-inspired poster by @SG_Posters!", "ICYMI: We talk Thanos, the Phoenix Force, and more mighty cosmic characters on the latest #EarthsMightiestShow, plus @LorraineCink and @LangstonBelton feed planets to Galactus with comedian Matt @Braunger! Watch: http://bit.ly/2GD4xWO ", "Get a glimpse into the bitter feud between the Kree and Skrulls in Marvel Studios' @CaptainMarvel in the latest featurette:", "ICYMI: Fan Jon-Marc Ferguson shares his early memories of comic books and his family as he transforms into a Super Hero who elevates and helps the people in his community on the latest episode of #MakeMeAHero! Watch: http://bit.ly/2ValEmg ", "As you read \"Avengers: No Road Home,\" explore the classic \"Avengers Forever\" saga and the parallels between the two comics:", "In our latest history of #CaptainMarvel installment, Carol Danvers faces her past and joins the New Avengers! Read more:", "Here's your look at the Marvel Studios' @CaptainMarvel-inspired poster from artist @SamGilbey! ", "ICYMI: In the latest episode of #EatTheUniverse, chef @EatFellowHumans welcomes @JamesMathisIII, the voice of T’Challa from \"Marvel’s Avengers: #BlackPanthersQuest,\" to create a Black Panther-inspired Spicy Goat Brochette with Isombe! Get the recipe: http://bit.ly/2TWcRnB ", "Don't miss the season finale of \"Marvel's Avengers: #BlackPanthersQuest! Join the cast as they livetweet the episode, and watch a clip on http://Marvel.com :", "Catch up on the latest episodes for our digital series on http://Marvel.com ! Watch: http://www.marvel.com/watch ", "Need a definitive reading list for \"War of the Realms\"? Look no further! Prepare for the epic event by catching up on all the news and books you'll need to read:", "Novelist @JesseJHolland joins a new #MarvelsVoices podcast to talk about his new book, \"Black Panther: Who is the Black Panther?\" with host @AngeliqueRoche:", "Take a peek at the new comics hitting shelves next week!", "Relive the livestream of #GooseTheCat from Marvel's Studios' @CaptainMarvel, who receives a visit from a special guest:", "Mark \"Wolverine: The Infinity Watch\" #1 with a look back at the original \"Infinity Watch\" series:", "The Skrulls are imperialists through and through, and they will stop at nothing to take over the universe. This week on #Marvel101, learn about these shapeshifters and why our heroes better watch out: http://bit.ly/2U4mxwj ", "See the first three #MarvelMeow variant covers from artist Nao Fuji! Learn more about how you can pre-order these comic issues:", "On an all-new #ThisWeekInMarvel podcast, we're talking all about #ToyFair2019! Plus, @AgentM chats with @WylieSofia, who voices Riri Williams on \"@Marvel_Rising: Heart of Iron.\" Listen to the full episode:", "Before you read about their team-up in \"Miles Morales: Spider-Man\" #3, take a look back at Captain America and Spider-Man's rocky past:", "Take a look at some of the eye-catching items that were on display at #ToyFair2019 from Bandai, Kotobukiya, Quantum Mechanix, and more:", "In honor of \"Hulkverines\" #1, available in comic shops now, read about the six times Wolverine and Hulk butt heads before teaming up:", "\"This war is just the beginning.” Get a behind-the-scenes look at Marvel Studios’ @CaptainMarvel.", "Two weeks until Marvel Studios' @CaptainMarvel. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Here's your look at the @EW special issue cover featuring Marvel Studios' @CaptainMarvel! Read more: https://bit.ly/2T1buXN ", "Higher. Further. Faster. In two weeks, see Marvel Studios’ @CaptainMarvel. Get tickets: http://www.Fandango.com/CaptainMarvel ", "Young Storyteller Isabella tells a story about America Chavez and how she learns the importance of friendship and helping others in need when she and Patriot rescue a lone wolf from Exile! #MarvelRising @youngstory", "Get a preview of the 'Hunted' storyline in \"Amazing Spider-Man\" with writer Nick Spencer on http://Marvel.com :", "This May, Lunella Lafayette meets Thor for the first time in \"Moon Girl and Devil Dinosaur\" #43 as she enters the \"War of the Realms\"! Learn more:", "Writer @KellySue and Marvel's VP of Creative and Content Development Stephen Wacker join a new #WomenOfMarvel podcast to talk about reimagining Carol Danvers as #CaptainMarvel and DeConnick's landmark series that launched in 2012! Listen: http://bit.ly/2U2wOsT ", "Celebrate Free Comic Book Day 2019 on May 4 with \"Amazing Spider-Man,\" \"Avengers,\" and more:", "What is a Hulkverine? Learn about Clayton Cortez's journey from soldier of fortune to Weapon H:", "We all know the classic Marvel love stories, but take a look at six more couples in the Marvel Universe you may not be familiar with: http://bit.ly/2NlLYqA  #Marvel80", "In this episode of #MarvelLetsPlay, host @NoreDavis teaches comedian and button smasher @BrianReganComic how to swing like a pro in #SpiderManPS4!  Watch: http://bit.ly/2Nj6yb9 \n\nCheck out Brian’s Netflix show, “Stand Up and Away,\" out now.", "Didja know the Controller once got involved with Thanos? Learn more about the baddie who always gets in Tony Stark's way before you read \"Tony Stark: Iron Man\" #9: http://bit.ly/2GDY2D4  #Marvel80", "Can the shapeshifting Skrull stand up to the might of Captain Marvel? Cast your vote now, and find out who will come out on top in a week!  #MarvelPixelBattle", "SNIKT! Listen bub, these Wolverine prints by Mark Chilcott and @GreyMatterArt are one of a kind. Get yours now at http://greymatterart.com ", "On March 8, get ready to marvel. Get tickets to Marvel Studios’ @CaptainMarvel now: http://www.Fandango.com/CaptainMarvel ", "We talk Thanos, the Phoenix Force, and more mighty cosmic characters on an all-new #EarthsMightiestShow, plus @LorraineCink and @LangstonBelton feed planets to Galactus with comedian Matt @Braunger! Watch: http://bit.ly/2GD4xWO ", "Take a deep dive into \"Marvel's Avengers: Endgame Prelude\" #3 before the big-screen event this April:", ".@BrieLarson and @SamuelLJackson describe the purrfect partnership before the release of Marvel Studios' @CaptainMarvel:", "Where was Carol Danvers during \"Civil War\"? Continue our look into the history of Captain Marvel on http://Marvel.com :", "He may usually operate on his own, but Venom's teamed up with other Super Villains in the past. Read about the six times he joined forces with the bad guys:", "The creative team behind \"Age of X-Man: The Amazing Nightcrawler\" discuss putting Kurt Wagner in the spotlight! Read:", ".@LorraineCink and @AgentM pop into #ToyFair2019 to check out all the toys and collectibles coming soon for Marvel Studios' @CaptainMarvel! Watch: http://bit.ly/2EjwikQ  #EarthsMightiestShow", "See the new Marvel releases coming later this year from @CollectDST, as seen from #ToyFair2019:", "It's a world record, bub! Hugh Jackman earns the Guinness World Record title for his Marvel career as Wolverine:", "Fan Jon-Marc Ferguson shares his early memories of comic books and his family as he transforms into a Super Hero who elevates and helps the people in his community in this all-new episode of #MakeMeAHero! Watch: http://bit.ly/2ValEmg ", ".@MarvelGames goes #HigherFurtherFaster with #CaptainMarvel. Carol Danvers takes the fight to five Marvel games starting today! Learn more:", "These stylish looks are worthy of an award! Check out the best costumes from this week's comic releases:", "Watch the first \"Marvel Rising Ultimate Comic,\" starring Ms. Marvel, as her class trip gets derailed by a mischievous Asgardian! Tune in each week to watch a new episode featuring your favorite @Marvel_Rising heroes.", "In today's \"Unstoppable Wasp\" #5, writer Jeremy Whitley (@jrome58) expands on the story of the brilliant Nadia Van Dyne. Read how in his http://Marvel.com  interview:", "Here’s an inside look at how I bring Jessica Jones to life from my current JJ series with @79SemiFinalist! You can read the second chapter to Jessica Jones: Purple Daughter now – it’s on sale in Marvel’s Digital Comics Shop & on ComiXology too!\n\nhttps://comicstore.marvel.com/Jessica-Jones-Marvel-Digital-Original-2018/comics-series/121277 …", "Marvel Games fly higher, further, faster! Play as #CaptainMarvel in @MarvelChampions, @MarvelPuzzle, @Marvel_FFightUS, @MVLBattleLines, & @MarvelStrikeF in upcoming events inspired by Marvel Studios' Captain Marvel, in theaters March 8th. Get tickets now! http://www.fandango.com/CaptainMarvel ", "SNIKT! @AgentM and @TuckerMarkus chat about all things Wolverine and more on a new #MarvelsPullList podcast! Listen to the full episode: http://bit.ly/2V7pwUT ", "Happy #LoveYourPetDay from #GooseTheCat!  #CaptainMarvel", "Some are built. Some are made. Some are born. \nOn March 8, witness the rise of a hero. \n\nGet tickets to Marvel Studios’ @CaptainMarvel now: http://www.Fandango.com/CaptainMarvel ", "REVEALED AT LAST! Find out how Wolverine got his hands on an infinity Stone when you purchase \"Wolverine: Infinity Watch\" #1 issue in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2Gnmc4K  to get started.", "#NCBD with Jessica Jones! Marvel’s top P.I. is joined by a slew of guest-stars to solve the mystery of her purple daughter. Who else will show up in the next double-sized issue from Kelly Thompson (@79SemiFinalist) and @MattiaIulis? Read to find out: http://bit.ly/2GA7rvE ", "Season 2 of Marvel's \"Wolverine: The Lost Trail\" is coming to @Stitcher Premium on 3/25. Listen to the full trailer now and read an exclusive interview with writer @Benjamin_Percy: http://bit.ly/2V7FH4x  #WolverinePodcast", " #MarvelMotivation", "Take a look at some of the incarnations of the elder statesman from the Great White North. Which Old Man Logan is your favorite?", "Learn all about the evolution of Deathlok, Marvel's cyborg soldier extraordinaire:", "Get a brief rundown on some of the most influential members of S.H.I.E.L.D.! Who's your favorite agent?", ".@Hasbro celebrates Marvel's 80th anniversary, #SpiderManFarFromHome, and much more with new Marvel Legends figures and more from #ToyFair2019:", "Dive into the mystical side of the Marvel Universe ahead of tomorrow's release of \"Doctor Strange' #11:", "Japanese artist Nao Fuji pays tribute to Goose, the feline star of Marvel Studios' @CaptainMarvel, with #MarvelMeow variant covers for six upcoming comic releases! See the first three:", "New this week in #MarvelUnlimited! Luke Cage vs. a Harlem heatwave, more Daredevil (1964), and Wolverine enters feudal Japan. See all new titles here: http://bit.ly/2NdCJJj ", "In this episode of #EatTheUniverse, chef @EatFellowHumans welcomes @JamesMathisIII, the voice of T’Challa from \"Marvel’s Avengers: #BlackPanthersQuest,\" to create a Black Panther-inspired Spicy Goat Brochette with Isombe! Watch and get the recipe: http://bit.ly/2TWcRnB ", "Prepare for tomorrow's \"Old Man Quill\" #2 with a look at some of the best future stories in Marvel Comics:", "Didja know Dazzler's comic book career took a while to take off? Learn more about one of the most unique Marvel stars ever on http://Marvel.com : http://bit.ly/2BI4fKd  #Marvel80", "Excited for Season 2 of \"Marvel's @CloakAndDagger\"? Here are 15 thoughts that ran through our heads when we watched the new trailer: http://bit.ly/2GzPkGd  #CloakAndDagger", "The Inner Circle unveils their dark plan on a new episode of #TheGifted, airing tonight on FOX:", "Here's a look at a Marvel Studios' @CaptainMarvel-inspired poster created by illustrator @TracieChing. ", "There is a new evil growing in New Orleans.\n\"Marvel’s @CloakAndDagger\" Season 2 premieres Thursday, April 4 on @FreeformTV. #CloakAndDagger", "Tour the @Marvel Cinematic Universe with these two new collectible books coming this spring. Perfect for fans of all ages! #MarvelAlphablock #MarvelMoviemakingMagic https://bit.ly/2BieyUo ", "What's Billy and Madani's favorite pizza? What was their favorite episode to film? #ThePunisher's @benbarnes and @AmberRoseRevah answer these questions and more on a new episode of #AskMarvel!", "Before picking up \"Age of X-Man: The Amazing Nightcrawler\" #1, brush up on the comic history of the X-Men’s blue-furred teleporter in #MarvelUnlimited: http://bit.ly/2IfAoyG ", "Official \"Marvel’s @CloakAndDagger\" Season 2 trailer drops tomorrow. #CloakAndDagger", "Get ready for \"Marvel’s @TheOffenders\"! Marvel partners with @YoungStory to tell @Marvel_Rising stories! It's time for your #MarvelMinute with host @LorraineCink. #ad", "Discipline. Strength. Dedication.  #MondayMotivation #CaptainMarvel", "A Letter to Marvel Television Fans from Jeph Loeb:", "ICYMI: Romance comics ruled the 1940s and 1950s, and to celebrate Marvel’s 80th anniversary, you can follow the path of love to find your inner romance comics heroine! Learn more: http://bit.ly/2GuopeO  #Marvel80", "Are you ready for “Marvel’s @TheOffenders”? Learn more about the @Hulu animated series and what you can expect on http://Marvel.com :", "ICYMI: #EarthsMightiestShow hosts @LorraineCink and @LangstonBelton explore all things love in the Marvel Universe, including their favorite love triangles! Plus, @DArcyCarden from #TheGoodPlace finds her robot soulmate! Watch: http://bit.ly/2GrQROf ", "“I’ve never seen anything like her.” See Marvel Studios’ @CaptainMarvel in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "ICYMI: Our own Ryan Penagos, AKA @AgentM, transforms into a Super Hero who's a pro wrestler with a fanny pack and a cat on the latest episode of #MakeMeAHero! Watch: http://bit.ly/2E7GMUy ", "ICYMI: In the latest #EatTheUniverse, author and comedian @HelloLaneMoore and chef @EatFellowHumans cook up special rice and beans dish in honor of one of Marvel’s most famous couples, Rogue and Gambit! Watch the full episode, and get the recipe: http://bit.ly/2E6Tzqa ", ".@DArcyCarden from #TheGoodPlace and #BarryHBO takes a quiz to determine robot soulmate! Who do you think it'll be? Watch and find out: http://bit.ly/2Gt95z5  #EarthsMightiestShow", "It's clobberin' time! Join @JoshDSaleh and @NoreDavis as they play @MarvelChampions as the Thing from the #FantasticFour on a new episode of #MarvelLetsPlay! Watch: http://bit.ly/2Iegm7K ", "Iron Man and Captain America team up with T'Challa in a new episode of \"Marvel's Avengers: #BlackPanthersQuest,\" airing tomorrow on @DisneyXD! Watch a clip: http://bit.ly/2IiT3te ", "“I know a renegade soldier when I see one.” Marvel Studios’ @CaptainMarvel is in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Don't miss the latest episodes of our digital series on http://Marvel.com ! Go: http://www.marvel.com/watch ", "On a new #ThisWeekInMarvel podcast, @KindaFunnyVids’s @GameOverGreggy stops by to chat about his picks for Marvel characters who would host their own podcast! Listen to the full episode: http://bit.ly/2Ifskh7 ", "We’ll be going live from #ToyFair2019 tomorrow at 11am ET to give you a preview of our new and upcoming @Hasbro toys, including #MarvelLegends and more! Tune in on the #ThisWeekinMarvel Facebook page: http://Facebook.com/thisweekinmarvel …", "Here's a look at the new comics hitting shelves next week! What are you looking forward to reading?", "\"Marvel's @HowardTheDuck\" writers @ThatKevinSmith and @DaveWillis2 express their excitement for fowl adventures in the new @Hulu animated series:", "King of Wakanda, protector of his people, and complicated Avenger! This week on #Marvel101, the Black Panther reigns supreme. Watch: http://bit.ly/2IeMnfH ", "This May, rise to new heights with \"Giant-Man\" from writer Leah Williams (@mymonsterischic) and artist Marco Castiello! Read more:", "See first in a series of 10 exclusive posters inspired by Marvel Studios’ @CaptainMarvel. Art by @needledesign. Reply with  if you’re excited for March 8!", "Congratulations to the @Marvel's Avengers: #BlackPanthersQuest and #DocMcStuffins teams, as well as @layahayes (voice of Doc McStuffins) for their 2019 @naacpimageaward nominations! #ImageAwards50", "They're never far apart from one another. Here's your first look at Season 2 of \"Marvel's @CloakAndDagger,\" premiering April 4 on @FreeformTV! http://bit.ly/2Gtk6R2  #CloakAndDagger", "This May, prepare for the arrival of the \"New Agents of Atlas\" in the \"War of the Realms\"! Learn more on http://Marvel.com :", "On March 8, who can you trust? Marvel Studios’ @CaptainMarvel is in theaters in three weeks. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "Behind every great #AntMan stands a great ant. Read all about the five times Ant-Man's ants saved the day:", "There's more to Mantis than meets the eye! Learn 13 things you didn't know about Mantis on http://Marvel.com :", "Prep for next week's \"Doctor Strange\" #11 with a look at five times the Sorcerer Supreme had to fight without magic:", "This April, Malekith's dark forces finally reach Earth in \"War of the Realms\"! Read more about the three new \"Strikeforce\" one-shots:", "Track down a slimy alien with #SpiderMan and #CaptainMarvel in this installment of \"Marvel Super Hero Adventures\"! Watch:", "What is Carol Corps? @OMG_Dj_Judy and @MiniB622 tell you more about this community dedicated to Carol Danvers and #CaptainMarvel in a new #WomenOfMarvel podcast! Listen to the full episode: http://bit.ly/2In5aps ", "Romance comics ruled the 1940s and 1950s, and to celebrate Marvel’s 80th anniversary, you can follow the path of love to find your inner romance comics heroine! Learn more: http://bit.ly/2GuopeO  #Marvel80", "Doreen Green joins the \"War of the Realms\" action this March, as writer @ryanqnorth previews \"Unbeatable Squirrel Girl\" #44, her first-ever event tie-in:", "Look through the photos of Marvel Studios' @CaptainMarvel cast and filmmakers at the Singapore fan event! (3/3)", "Look through the photos of Marvel Studios' @CaptainMarvel cast and filmmakers at the Singapore fan event! (2/3)", "Look through the photos of Marvel Studios' @CaptainMarvel cast and filmmakers at the Singapore fan event! (1/3)", "This is mayhem.\n\"Marvel’s @CloakAndDagger\" Season 2 premieres Thursday, April 4 on @FreeformTV. #CloakAndDagger", "\"Age of X-Man\" writers Lonnie Nadler (@Lon_Monster) and Zac Thompson (@ZacBeThompson) list their favorite mutant bonds for #ValentinesDay! Which mutant pairing's your favorite?", "“Marvel’s @TigraAndDazzler Show\" writers Erica Rivinoja and @ChelseaHandler share their excitement for the new Hulu animated series:", "No fight's too tough for T'Challa and Shuri! Watch episodes of NAACP Image Award-nominated \"Marvel's Avengers: #BlackPanthersQuest\" on the YouTube Kids app now: http://bit.ly/2GqShss ", "A huge and well-deserved congratulations to @insomniacgames for winning Outstanding Achievement in Animation for Marvel's Spider-Man at last night's #DICEAwards. We are so proud to work with such an incredible studio and talented people. #SpiderManPS4 #BeGreater", "Discover what makes her a hero. Get tickets to Marvel Studios’ @CaptainMarvel, in theaters March 8: http://www.Fandango.com/CaptainMarvel ", "Celebrate #ValentinesDay with a look at the unlikeliest of romantic pairings in the Marvel Universe! What's your favorite Marvel couple?", "Celebrate #ValentinesDay with #EarthsMightiestShow as @LorraineCink and @LangstonBelton explore all things love in the Marvel Universe, including their favorite love triangles! Plus, @DArcyCarden from #TheGoodPlace finds her robot soulmate! Watch: http://bit.ly/2GrQROf ", "We revisit a classic in this #MarvelUnlimited panel of the week! Feeling romantic? Celebrate Valentine’s week with the wedding of Peter Parker and Mary Jane Watson: http://bit.ly/2IbflNC ", "Conan thunders into the Marvel Universe in “Savage Avengers” by @GerryDuggan and @mikedeodato! Learn more about this deadly team:", "We celebrate the romantic and the complicated in this #MarvelUnlimited Valentine’s Special! Check out a handful of our favorite couples: http://bit.ly/2I6R779 ", "Exclusive: Conan the Barbarian will star in a new Avengers comic series", "Have an X-tra sweet #ValentinesDay. ", "Wakanda takes over the 50th annual @NAACPImageAward nominations with nods for Marvel Studios' #BlackPanther, \"Marvel's Avengers: #BlackPanthersQuest,\" and more: http://bit.ly/2Gp2gOT  #ImageAwards50", "Ahead of Toy Fair this weekend, get a sneak peek at the new Marvel items coming this fall from @CollectDST:", "Marvel’s 80th Anniversary celebration continues with the #MarvelsPullList as we take you back to the beginning with books from 1950s! @AgentM and @TuckerMarkus break down \"Journey Into Mystery\" #1, \"Marvel Boy\" #1, and more: http://bit.ly/2UZgqtA  #Marvel80", "Captain Marvel soars into \"MARVEL ULTIMATE ALLIANCE 3: The Black Order,\" coming to Nintendo Switch this summer! Wield her powers and learn more: http://bit.ly/2IlMVQS  #MUA3", "Captain Marvel is joining the fight in MARVEL ULTIMATE ALLIANCE 3: The Black Order! Wield her powers to stop Thanos and The Black Order from unleashing cosmic chaos when the game launches exclusively on #NintendoSwitch this summer. #MUA3", "With the first issue available now, get a rundown on Voyager's new team in \"Avengers: No Road Home\":", "\"Marvel's @HitMonkey\" executive producers Josh Gordon and Will Speck share how they're bringing the character into animation for the upcoming @Hulu series:", "This spring, get ready for a night of action-packed adventure at @Disneyland After Dark: Heroes Assemble! Learn more:", "Don't miss the coolest costumes from this week's comic releases on http://Marvel.com :", "Our own Ryan Penagos, AKA @AgentM, transforms into a Super Hero who's a pro wrestler with a fanny pack and a cat on a new episode of #MakeMeAHero! Watch: http://bit.ly/2E7GMUy ", "Night has fallen across the universe. Now the Avengers journey forth to bring back the light. Get \"Avengers: No Road Home\" #1 in the Digital Comics Shop and earn 1,000 #MarvelInsider points! Terms apply. Log in to http://bit.ly/2Ib2D1e  to get started.", "#TodayInMarvelHistory in 1992, the bloodthirsty Carnage made his first full appearance in \"The Amazing Spider-Man” #361.  #Marvel80", "Who is Bushmaster? Take a look at the criminal mastermind and his greatest moments in Marvel history:", "What's in a day in the life of #CaptainMarvel? Writer Margaret Stohl (@mstohl) gives a rundown of what Carol Danvers' typical day would look like:", "Getting in the way of Wilson Fisk is the last thing you ever want to do. Read about eight of Kingpin's worst moments:", "The Marvel Multiverse is no stranger to time traveling tales! Let us know in the replies which stories and characters you love most with the hashtag #EarthsMightiestShow, and your response may appear in a future episode.", "\"Marvel: #PowersOfAGirl\" author @LorraineCink chats with http://Marvel.com  about the triumphs and vulnerabilities of Super Heroes! Read:", "This May, Spidey teams-up with an unlikely crew in the new limited series, \"War of the Realms: Spider-Man and the League of Realms\"! Learn more:", "Who's the worst dad in the Marvel Universe? Take a look at five of the peskiest patriarchs that made our list:", "On an all-new #MarvelsPullList podcast, hosts @AgentM and @TuckerMarkus break down this week's new comics, including \"Captain Marvel\" #2, \"Amazing Spider-Man\" #15, and more! Listen to the full episode: http://bit.ly/2UTBu4n ", "Drop into Earth-65, and explore the secrets and Easter eggs of Ghost-Spider's home universe:", ".@MarvelsMODOK creators @PattonOswalt and @BlumJordan share their big plans for the big-headed character in the upcoming @Hulu series:", "With \"Mr. and Mrs. X\" #8 hitting comic shelves tomorrow, explore how seeing how Marvel’s mutants inspired Kelly Thompson's career: http://bit.ly/2I9nIcA  @79SemiFinalist", "The world needs a hero. See Marvel Studios’ @CaptainMarvel in theaters March 8. Get tickets: http://www.Fandango.com/CaptainMarvel ", "Prepare for \"Runaways\" #18 with a refresher to the Gibborim and their history:", "In a new #EatTheUniverse, author and comedian @HelloLaneMoore and chef @EatFellowHumans cooks up special #ValentinesDay rice and beans dish in honor of one of Marvel’s most famous couples, Rogue and Gambit! Watch the full episode, and get the recipe: http://bit.ly/2E6Tzqa ", "New this week in #MarvelUnlimited! Marvel’s first family is back, get struck by Cupid with issues of \"Venus,\" and the monstrous Man-Thing. See all new titles here: http://bit.ly/2Go7Elh ", "Writer and artist Barry Windsor-Smith mesmerized readers with his defining take on Wolverine’s origin. Read the entire \"Weapon X\" arc in #MarvelUnlimited today: http://bit.ly/2I7xdsP ", "What makes U.S. Agent different from #CaptainAmerica? Learn all about the history and evolution of this black garbed patriot:", "Just how twisted is Vision's family tree? Explore the roots of the synthezoid's history on http://Marvel.com :", "Apart from being the occasional intergalactic traveler, aspiring cop, and resident of Cleveland, here are five other things you should know about Howard the Duck:", "The situation within the Inner Circle is more dangerous than ever in an all-new episode of #TheGifted, airing tomorrow night on FOX:", "Continuing its historic awards season, Marvel Studios' #BlackPanther lands two Grammy wins, including Best Score Soundtrack for Visual Media! Read more:", "Who's your sweetheart? Get ready for #ValentinesDay with these Marvel conversation heart treats! Get the step-by-step recipe:", "Step up and take charge with the Marvel Universe's best leaders in this #MarvelTopTen! Learn more: http://bit.ly/2E7gXnt ", "Writer Dennis \"Hopeless\" Hallum (@HopelessDent) previews the brand new \"Marvel's #SpiderMan: City at War\" comic series, coming March 20:", "Squirrel Girl must save her friends Ms. Marvel and Quake from the evil super villain, Exile, before it's too late in this story from Young Storyteller Corryn, featuring @SkaiJackson, @MintMilana, and more! @youngstory #MarvelRising", "Prep for Kamala Khan's fifth anniversary and Wednesday's landmark release of \"Ms. Marvel\" #38 with a look back at five of her biggest moments:", "Host @AgentM will be joined by EIC @CBCebulski for a new #ThisWeekInMarvel podcast to talk about the reading club's four Atlas-era tales! Read their picks in #MarvelUnlimited and send in your questions and comments to be answer with hashtag #TWIMURC: http://bit.ly/2URH3Aj ", "Conan is back. I was so pumped to get this new special edition comic book. They’ll be available at the @ArnoldSports or you can get yours now.: http://Conancomic.com ", "A new poster for \"Marvel's @CloakAndDagger\" Season 2! Carnage creeps into @MarvelStrikeF! It's time for your #MarvelMinute with host @LorraineCink.", "Learn about the top X-things you need to know about \"Age of X-Man\" from senior editor Jordan D. White (@cracksh0t)! Watch: http://bit.ly/2UMQJvY  #EarthsMightiestShow", "BREAKING! M.O.D.O.K., Hit-Monkey, Tigra, Dazzler, and Howard the Duck get animated on @Hulu as \"Marvel's The Offenders\". Learn more about their individual shows and the team-up event: http://bit.ly/2UUCAx4  #TheOffenders", "\"War of the Realms,\" \"Avengers,\" and \"Thor\" comic writer @jasonaaron is invading Marvel HQ to answer YOUR burning questions! Send us all your must-know questions with the hashtag #AskMarvel and tune in to a future episode to see if they get answered.", "“She refuses to give up on herself.” #MondayMotivation #CaptainMarvel", "The universe will know her name. Marvel Studios’ @CaptainMarvel is in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "ICYMI: Pro wrestlers @JohnnyGargano and @CandiceLeRae are ready to wrestle the Marvel Universe, and host @LorraineCink talks her new book #PowersOfAGirl on the latest #EarthsMightiestShow! Watch the full episode: http://bit.ly/2tcvFDj ", "Last chance! Use redeem code 'FOREVER' at http://www.marvel.com/redeem  by the end of today to get a FREE digital bundle of five #BlackPanther comics. Great jumping-on points for new readers, http://Marvel.com  account required to redeem.", "ICYMI: In the latest #EatTheUniverse, chef @EatFellowHumans and @julieklausner, star of #DifficultPeople on @Hulu, celebrate Marvel’s 80th Anniversary with a 1940s Captain America-inspired beef tongue dish!  Get the recipe: http://bit.ly/2HWitg9  #Marvel80", "In this episode of #MarvelLetsPlay, @NoreDavis plays #SpiderManPS4 with comedian, @RonFunches! Watch: http://bit.ly/2UJMmSg \n\nSee Ron’s special Giggle Fit on the Comedy Central app, website, and on-demand.", "ICYMI: In the latest episode of #MakeMeAHero, fan Karama Horne transforms into a warrior of Wakanda who's ready to take on any threats! Watch: http://bit.ly/2UKYClw ", "In a new episode of #AskMarvel, @ThePunisher's @jonnybernthal and @giorgia_whigham answer some of your burning questions about working on the series!", "Fight to \"Reclaim the Realms\" as the Avengers venture out on a series of suicide missions!\nGet an exclusive look at \"War of the Realms\" #3:", "Don't miss all the latest episodes for our http://Marvel.com  digital series! Watch: http://www.marvel.com/watch ", "Catching up on Marvel news? Read the latest and top highlights from this week on http://Marvel.com :", "As \"Daredevil\" #1 launches this week, take a look back at Frank Miller and John Romita Jr.'s seminal story in \"Daredevil: The Man Without Fear\": http://bit.ly/2I0ewa8  #Marvel80", "Step back into the 1990s and explore a crucial era for Carol Danvers in the history of #CaptainMarvel:", "Pro wrestlers @JohnnyGargano and @CandiceLeRae pick their very own Survivor Series teams full of Marvel characters in this special chat with @AgentM, on an all-new #ThisWeekInMarvel podcast episode! Listen: http://bit.ly/2tbau4C  #Marvel80", "Before Marvel Studios' @CaptainMarvel comes to theaters in one month, learn about how the @Russo_Brothers kept Carol's powers balanced in #AvengersEndgame:", "Here's a look at the new comics hitting shelves next week! What are you most excited to read?", "Marvel and @YoungStory partnered up to give middle school students a chance to write stories based on \"@Marvel_Rising: Secret Warriors\"! Young Storyteller Ruby Arana crafts America Chavez's origin story with the help of @MintMilana, @ChloeBennet, and more: http://bit.ly/2UUTvQ7 ", "How did Thanos destroy the Marvel Universe? As Cosmic Ghost Rider gets ready to obliterate everything, learn about the time the Mad Titan did it the first time:", "Watch T'Challa and White Wolf team up in two new episodes of \"Marvel's Avengers: #BlackPanthersQuest,\" airing this Sunday on @DisneyXD! Watch a preview:", "Hey @Marvel Comics fans, #ThisWeekinMarvel listeners, people who like stuff--our 1950s reading club picks are up: https://www.marvel.com/comics/discover/1271/twimurc-tales-of-the-50s … Me & @CBCebulski want your questions & comments & thoughts on these books! Tweet 'em w/#TWIMURC! #Marvel80", "Oreo the Raccoon, who served as a model for Rocket from Marvel Studios' \"@Guardians of the Galaxy,\" has passed away at the age of 10:", "One month until Marvel Studios' @CaptainMarvel. See the film in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "\"War of the Realms,\" \"Avengers,\" and \"Thor\" comic writer @jasonaaron is invading Marvel HQ to answer YOUR burning questions! Send us all your must-know questions with the hashtag #AskMarvel and tune in to a future episode to see if they get answered.", "Marvel Studios’ @CaptainMarvel soars into theaters in one month. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "In one month, get ready to marvel. Get tickets to Marvel Studios’ @CaptainMarvel now: http://www.Fandango.com/CaptainMarvel ", "TAG TEAM ALERT! Pro wrestlers @JohnnyGargano and @CandiceLeRae named their top Marvel tag team - now tell us yours! Who do you think is the toughest duo in the MU? Send us your picks with the hashtag #EarthsMightiestShow and your tweet could be featured in next week's episode.", "ICYMI: See the new posters, magazine covers, and more featuring Marvel Studios' @CaptainMarvel on http://Marvel.com :", "What is the War of the Realms? Learn everything you need to know about this epic Marvel Comics event before it kicks off this April:", "Can you name a Marvel character more calculating than Ebony Maw? Take a look into this Black Order member's most manipulative moments:", "Not every Skrull is evil! Meet nine friendly Skrulls who have earned their place among Earth’s champions:", "Assistant editor @ChrisRobinson joins the #MarvelsVoices podcast to give a behind-the-scenes look at editing X-Men comics and more! Listen to the full episode:", "Step back in time and take a bite out of Dracula's Marvel Comics debut: http://bit.ly/2Gggt0r  #Marvel80", "Didja know the Black Widow made her debut as a very different type of character? Explore more fun details about this well-known super-spy: http://bit.ly/2HTGvIC  #Marvel80", "In honor of the upcoming \"Doctor Strange\" #12, explore seven other masters of magic in the Marvel Universe:", "\"Ziggy Pig - Silly Seal Comic\" writers @FrankTieri and @JohnCerilli answer the big burning questions about Ziggy Pig and Silly Seal as they make their return to the Marvel Universe: http://bit.ly/2Ggnr5S  #Marvel80", ".@WylieSofia's \"Side By Side\" is still on repeat for us - how about you? Watch the behind-the-scenes featurette for the \"@Marvel_Rising: Chasing Ghosts\" featured song: http://bit.ly/2ULl12g ", "“I’ve never seen anything like her.” Marvel Studios’ @CaptainMarvel lands in theaters March 8! Get tickets: http://www.Fandango.com/CaptainMarvel ", "Pro wrestlers @JohnnyGargano and @CandiceLeRae are ready to wrestle the Marvel Universe, and host @LorraineCink talks her new book #PowersOfAGirl on an all-new #EarthsMightiestShow! Watch the full episode: http://bit.ly/2tcvFDj ", "Get SHOCKED by our #MarvelUnlimited panel of the week! Need more Shocker-Mobile? Read \"Superior Foes of Spider-Man\" now: http://bit.ly/2GapKXW ", "Take a look at some of our favorite alternate reality Spider-Men! Who's your favorite?", "Look back at Super Heroes who braved the weird and way-out wonders of the Negative Zone:", "Revisit the Sorcerer Supreme's most important investigation of his career - his own murder! Read:", "Dive into today's \"Age Of X-Man: The Marvelous #XMen\" #1 with a team meet-and-greet:", "Before \"Avengers\" #16 comes to comic shops in March, dig into Blade's history and learn about the times he proved himself as a team player:", "Black Cat and #SpiderMan's relationship is rather complicated, to put it lightly. Explore the ups and downs of their bond and how they got to where they are:", "\"Immortal Hulk\" #13 hits comic shelves today, and what better way to celebrate than with a list of the Hulk's unluckiest moments:", "Take a look at the new @TotalFilm magazine cover and subscriber's edition of the latest issue, featuring Marvel Studios’ @CaptainMarvel! Read more: https://bit.ly/2TAAt0V ", "From a starstruck teen to a hero in her own right, Patsy Walker dreamt of being a Super Hero and got her wish! This week on #Marvel101, our original feline hero shows her mettle on every team she joins: http://bit.ly/2tcjmqw  #Marvel80 #ad", "Would you ever strike up a deal with the Devil? With Miles Morales caught up in his grasp in the \"Champions\" series, we're looking back on the most historic deals with Mephisto himself:", "Look through the best costumes from this week's comic releases, featuring styles with a quiet hit of edginess:", "February is Black History Month and to celebrate, #EarthsMightiestShow host @LangstonBelton has compiled a list of must-read comics featuring African-American characters and creators! Watch and learn more: http://bit.ly/2UOR81b  #Marvel80", "Always up to no good up against #IronMan, the Controller's schemes are nothing short of memorable! Read about them on http://Marvel.com :", "In a new episode of #MakeMeAHero, fan Karama Horne transforms into a warrior of Wakanda who's ready to take on any threats! Watch: http://bit.ly/2UKYClw ", "Celebrate today's release of \"Daredevil\" #1 with a look at Matt Murdock's death-defying past:", "“She’s just the beginning.” Marvel Studios’ @CaptainMarvel is in theaters March 8! Get tickets now: http://www.Fandango.com/CaptainMarvel ", "We're here for this #CaptainMarvel and #SpiderMan team-up! See what happens next in this episode of \"Marvel Super Hero Adventures\" now: http://bit.ly/2HUsDOc ", "Learn more about what you can expect from Season 3 of #LegionFX, premiering this June:", "Matt Murdock is back...but is he now the Man Without Limits? Don't miss the new #1 by @zdarsky and @MChecC! Purchase \"Daredevil\" #1: Director's Cut in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2DbOEmb  to get started.", "The Thing. Wild Thing. Man-Thing. In the Marvel Universe, these are a few of our favorite things:", "Higher. Further. Faster. Soar to new heights with @AlaskaAir's special edition plane, featuring Marvel Studios' @CaptainMarvel! ", "ICYMI: \"Marvel’s @CloakAndDagger\" sets Season 2 premiere date on @FreeformTV!", "A monumental team-up takes over #FCBD 2019 with \"Spider-Man/Venom\" #1, featuring work by @doncates, @RyanStegman, @TomTaylorMade, @saladinahmed, and @csmitharts! Read more:", "Back in action! In this week’s #MarvelsPullList podcast, @AgentM and @tuckermarkus break down four comics that feature heroes saddling back up, including the new “Daredevil” #1. Listen to the full episode: http://bit.ly/2HVLjNA ", "This week marks the 75th anniversary of “Captain America,” a live-action serial that serves as the first-ever on screen adaptation of a Marvel Comics character! Learn more:", "Get an inside look at Captain Marvel and Monica Rambeau's features in the newly released #PowersOfAGirl by @lorrainecink and @alicexz:", "Here’s a look at an exclusive poster for Marvel Studios' @CaptainMarvel, created by Matt Ferguson (@Cakes_Comics)! (via @ODEONCinemas)", "Follow @AgentM as he takes on heroic encounters and more at Marvel Day at Sea on @DisneyCruise! Watch now: http://bit.ly/2GazbXr  #EarthsMightiestShow", "In an all-new #EatTheUniverse, chef @EatFellowHumans and @julieklausner, star of #DifficultPeople on @Hulu, celebrate Marvel’s 80th Anniversary with a 1940s Captain America-inspired beef tongue dish!  #Marvel80\n\nGet the recipe on http://Marvel.com : http://bit.ly/2HWitg9 ", "Before \"Old Man Quill\" #1 arrives, revisit five of Star-Lord's most mature moments in comic history:", "\"Something in my past is the key to all of this.\" Get tickets to Marvel Studios’ @CaptainMarvel, in theaters March 8: http://www.Fandango.com/CaptainMarvel ", "Our mightiest Super Heroes assemble for the LEGO® Marvel Collection, bundling three of the top-selling video games in one package! Find out which games and when you can get it:", "#AgentsOfSHIELD's @ClarkGregg Teases His 'Very Mysterious' Season 6 Role", "Mayhem is coming. \"Marvel’s @CloakAndDagger\" Season 2 premieres Thursday, April 4 on @FreeformTV! #CloakAndDagger", "Coulson is gone and dead, but @ClarkGregg will be returning for \"Marvel's #AgentsofSHIELD\" Season 6. Learn more about his mysterious new character: http://bit.ly/2HUnK82 ", "March cover star @BrieLarson reveals why she was drawn to the feminist role of Captain Marvel, the importance of inclusion in Hollywood, and how she manages to balance it all.", "\"Champions\" and \"Avengers: No Surrender\" writer @JimZub shares his must-read #Avengers stories in this #MarvelUnlimited Creator Spotlight: http://bit.ly/2GcG9em ", "#PowersOfAGirl is out today! This power-packed book dives into the world and stories behind all your favorite women of the Marvel Universe. Get it here: http://bit.ly/2D7FKGr ", "The final season of @LegionFX casts David's parents, Professor X and Gabrielle! Get the details:", "For this ragtag group of heroes, the West Coast is the Best Coast! Get to know the overly enthusiastic, slightly dysfunctional, West Coast Avengers:", "As another chapter of the Exiles comes to a close in this week's \"Exiles\" #12, take some time to appreciate the history of this reality-hopping team:", "On a new #ThisWeekInMarvel, @PattiMurin, AKA Anna from @FrozenBroadway, joins host @AgentM to talk about Anna's possible super powers! Listen to the full episode: http://bit.ly/2HS01Fy ", "The #Marvel80 celebration continues with #MarvelUnlimited! Get sci-fi thrills, chills, and monster mash-ups with our 80th Anniversary spotlight on 1950s: http://bit.ly/2D7D1wB ", "Daredevil has battled some of the biggest baddies of the Marvel universe, but a few of his foes are more kooky than criminal. Explore the Man Without Fear's most obscure enemies:", "New this week in #MarvelUnlimited! Infinity Wars, more Moon Knight, Black Panther vs. a nation, plus the Punisher. See all new titles here: http://bit.ly/2G921Yg ", "Rack up points and redeem for cool rewards like these – just by being a #MarvelInsider! Terms apply: http://bit.ly/2D7gUGH ", "Before Scott and Logan reunite in the pages of \"Uncanny X-Men\" #11, look back on four of Cyclops and Wolverine's most crucial moments:", "The conclusion of @LegionFX arrives this summer! Learn more about the final season:", "#MondayMotivation  #CaptainMarvel", "Here's the new international poster for Marvel Studios’ @CaptainMarvel!", "What's it like working with Old Lace? Who are the most evil parents on #MarvelsRunaways? Super-dads @jamesyaegashi (Robert Minoru) and @theryansands (Geoffrey Wilder) answer these questions and more on a new #AskMarvel!", ".@RunDisney Virtual Series meets Marvel! New comics featuring your favorite leading men! It's time for your #MarvelMinute with host @LorraineCink. Watch: http://bit.ly/2tducNn  #Marvel80", "#TodayInMarvelHistory in 1964, Matt Murdock becomes street-level hero Daredevil - lawyer by day, vigilante by night. #Marvel80", "Long live the king! Use redeem code 'FOREVER' at http://www.marvel.com/redeem  to get a FREE digital bundle of five #BlackPanther comics and celebrate Wakanda Forever all month long. http://Marvel.com  account required to redeem.", "Revisit the time the Black Panther and Storm worked together to bring down the mutated monstrosities:", "Think you know all about Black Bolt? Read these five facts about the Inhumans' king and his quiet power:", "Go #HigherFurtherFaster with the Big Game spot for Marvel Studios' @CaptainMarvel:", "See the Big Game teaser for Marvel Studios' #AvengersEndgame now:", "HIGHER. FURTHER. FASTER. Watch the brand new Marvel Studios' @CaptainMarvel spot that aired during the Big Game. See it in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "\"Some people move on. But not us.\" Watch the brand new Marvel Studios' #AvengersEndgame spot that aired during the Big Game. See the film in theaters April 26.", "ICYMI: From @DisneyParks to Marvel Day at Sea on @DisneyCruise, explore the ultimate Marvel vacations with #EarthsMightiestShow hosts @LorraineCink and @LangstonBelton! Plus, the fabulous @PattiMurin talks @FrozenBroadway! Watch: http://bit.ly/2HJXr4h ", "ICYMI: Sharpen your knife skills with the latest #EatTheUniverse episode!  Our resident chef @EatFellowHumans channels Wolverine to show the various ways to safely slice and dice various ingredients for your favorite dishes: http://bit.ly/2HEL9KD ", "The Merc with the Mouth's got plenty of memorable moments, but we've narrowed down his greatest highlights on http://bit.ly/2D77lrj :", "Take a closer look at five of the strongest and most dangerous intergalactic species in the Marvel Universe:", "Congratulations to Marvel Studios' #BlackPanther and Hannah Beachler (@chinchilla1970) on winning the Art Directors Guild Award for Best Production Design in a Fantasy Feature Film! #ADGAwards", "Spider-Man's got more than just one origin story, so we've gathered 10 different depictions of the webslinger's early days:", "In this episode of #MarvelLetsPlay, @NoreDavis introduces the @LucasBros to #SpiderManPS4! Watch: http://bit.ly/2t9ofkx \n\nCatch the comedic pair in your city during their 2019 tour, and get tickets now at http://thelucasbros.com !", "ICYMI: On the latest episode of #MakeMeAHero, fan Randall Acosta shares how he found a community through board games and comics as he transforms into a soul reaper! Watch: http://bit.ly/2SeEuur ", "Watch this brand new clip from Marvel Studios' @CaptainMarvel, coming to theaters March 8! Get tickets now: http://www.fandango.com/captainmarvel ", "He’s the marksman that the Avengers rely on to make the shot when no one else can. #Hawkeye is on the scene, and he’s going to let you know it on this week's #Marvel101: http://bit.ly/2HKeoeR ", "Catch the latest episodes for all our digital series on http://Marvel.com ! Go: http://www.marvel.com/watch ", "From the new #SpiderManPS4 suits to the \"Marvel's #AgentsOfSHIELD\" teaser, read up on the biggest stories of the week on http://Marvel.com :", "Check out @BrieLarson from Marvel Studios' @CaptainMarvel on @TheEllenShow! Watch:", "Can the X-Men ever find utopia? Revisit previous attempts to create a perfect home for the mutants on http://Marvel.com : http://bit.ly/2HVsRoe  #Marvel80", "Editor @Wil_Moss joins a new #ThisWeekInMarvel podcast to help get you ready for \"The War of the Realms,\" kicking off this April! Listen to the full episode: http://bit.ly/2t09m3H ", "\"Uncanny X-Men: Winter's End\" writer @SinaGrace and artist @StockmanNate talk about Bobby Drake's battle with his future self! Read now on http://Marvel.com :", "Our latest History of Captain Marvel installment explores Carol Danvers' star-turning change:", "Who is Nate Grey? Learn about X-Man himself and how one of the X-Men’s former allies became a threat to their existence:", "Would you team up with T'Challa and Shuri? Watch episodes of \"Marvel's Avengers: #BlackPanthersQuest\" on the Marvel HQ YouTube channel today: http://bit.ly/2G5uqhH  #WakandaForever", "Here's your look at the new comics hitting shelves next week! What are you most excited to read?", "#WomenOfMarvel hosts Sana Amanat (@MiniB622) and Judy Stephens (@OMG_Dj_Judy) tease an all-new podcast conversation featuring @DarcyCarden from #TheGoodPlace! Listen to the full episode now: http://bit.ly/2HGezYC  #Marvel80", "\"A Skrull cannot do that.\" #CaptainMarvel", "From Wakanda to America, young T'Challa travels to a new school, setting him on the path to becoming the #BlackPanther. Get the novel by @RonSmithbooks from @DisneyBooks now: http://bit.ly/2RWkIoi ", "EXCLUSIVE: The fourth annual @runDisney Virtual Series kicks off this summer with a celebration of 80 Years of Marvel, including Captain Marvel, Iron Man, and Black Panther themes! Learn more and sign up: http://bit.ly/2D4yAT1  #Marvel80", "The voice cast of “Marvel’s Avengers: #BlackPanthersQuest” will be stopping by to answer YOUR questions! Send us all your fun and important Black Panther questions with #AskMarvel and stay tuned to see if they get answered.", "Don't turn your back on these five biggest betrayals in Marvel history:", "What happens when T'Challa investigates a murder overseas? Wakanda falls apart. Revisit the time the Black Panther had to deal with a refugee crisis and a Tomorrow Fund scandal:", "Life is anything but a straight line for the Man Without Fear. Explore the most intense and surprising evolutions (and de-evolutions) of Matt Murdock:", "Actress Lyrica Okano (@Lyricaforreal) chats with #MarvelsVoices host @AngeliqueRoche about playing an Asian American hero, Nico Minoru on @MarvelsRunaways! Listen to the full podcast episode: http://bit.ly/2Shwgll ", "Action! Mystery! Adventure! Celebrate 80 years of Marvel with \"Marvel Comics\" #1, the cover that started it all and our top cover of the 1930s: http://marvel.com/marvel80  #Marvel80", "How do you craft a new X-Men world? \"Age of X-Man: Alpha\" writers @ZacBeThompson and Lonnie Nadler (@Lon_Monster) share details on creating a new realm for mutants:", "Ziggy Pig and Silly Seal are returning with a new comic series next month, so we've assembled a list of the Marvel Universe's animal heroes! Who's your favorite?", "Look back at Deathlok's first appearance in the wake of this week's \"X-Force\" #2: http://bit.ly/2CW9ztd  #Marvel80", "Some of the voice cast of @Marvel_Rising will be joining us at Marvel HQ to answer fan questions! Send us YOUR questions with the hashtag #AskMarvel and tune in to a future episode to see if they got answered.", "Didja know a Star-Lady almost replaced Star-Lord? Ahead of next week's new \"Old Man Quill\" #1, dig into the impossible story of Peter Quill: http://bit.ly/2RZOXuI  #Marvel80", "Hope begins with a hero. Marvel Studios’ @CaptainMarvel is in theaters March 8. Get tickets now: http://www.Fandango.com/CaptainMarvel ", "From @DisneyParks to Marvel Day at Sea on @DisneyCruise, explore the ultimate Marvel vacations with #EarthsMightiestShow hosts @LorraineCink and @LangstonBelton! Plus, the fabulous @PattiMurin talks @FrozenBroadway! Watch: http://bit.ly/2HJXr4h ", "#AgentsofSHIELD and #MarvelRising's @MingNa will be swinging by Marvel HQ to answer your fan questions! Send us your super important and fun questions with the hashtag #AskMarvel and stay tuned to an upcoming episode to see if they got answered.", "Perfect for new readers! Dive into the DOUBLE-SIZED Marvel Digital Originals with #MarvelUnlimited. Binge-worthy stories starring your favorite heroes from the small screen and beyond: http://bit.ly/2RXbOa5 ", "Celebrate today's \"Doctor Strange\" #400 with a look at eight of the Sorcerer Supreme's finest issues:", "Join host @AgentM and Marvel Editor-in-Chief @CBCebulski in a special edition of #TWIMURC as they celebrate Marvel's 80th anniversary with three reasons to read 1939's \"Marvel Comics\" #1! Listen to the full podcast episode: http://bit.ly/2HEET5i  #Marvel80", "\"Age of X-Man: Alpha\" #1 is now on comic shelves, and writers @ZacBeThompson and Lonnie Nadler (@Lon_Monster) discuss what to expect next from the series:", "\"Age of X-Man\" writers @Lon_Monster and @ZacBeThompson break down their #MarvelUnlimited favorites in a new Creator Spotlight! Pick up the dystopic \"Age of X-Man: Alpha\" one-shot in print or digital, on sale this Wednesday: http://bit.ly/2S1fpUL ", "\"Superior Spider-Man\" #2 is here, and writer @ChristosGage chats with http://Marvel.com  about the fight with Terrax, Otto’s feelings towards another villainous doctor, and more:", "Celebrate Marvel's 80th anniversary with #MarvelsPullList and a trip back in time to the 1930s and 1940s! Break down \"Marvel Comics\" #1, \"Captain America\" #1, and more: http://bit.ly/2SbpcqB  #Marvel80", "What exactly does \"Pantherpool\" look like? As cool as you might expect. See the best costumes from this week's new comic releases:", "#MarvelRising's @tylergposey (Inferno) and @Kamil_McFadden (Patriot) will be answering YOUR questions in a new episode of #AskMarvel! Send us all your burning questions with the hashtag and stay tuned to see if they get answered.", "Drop into the universe of Miles Morales in this #SpiderMan novel by @JasonReynolds83, available now from @DisneyBooks: http://bit.ly/2RWd3q6 ", "Nova launches to the top as this month's #MarvelPixelBattle winner! Join us next month for another big face-off. ", "In a new episode of #MakeMeAHero, fan Randall Acosta shares how he found a community through board games and comics as he transforms into a soul reaper! Watch: http://bit.ly/2SeEuur ", "#NCBD with the Daughters! Misty Knight and Colleen Wing’s Digital Original arc concludes on a cruise. Buy the double-sized #1-3 in the Digital Comics Shop today, or collect the entire story next month in print or digital wherever comics are sold: http://bit.ly/2RW3bN4 ", "The age of X-Man dawns…and the X-Men cannot stop it.  Purchase \"Age of X-Man Alpha\" #1 in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2RMaO8D  to get started.", "Hero. Leader. King. Brush up on five essential reads featuring T'Challa, AKA the Black Panther:", "Super Villains aren't the only ones who find themselves behind bars. Learn about six Marvel Super Heroes who were locked up:", "Read about eight different Marvel Super Heroes who have acted and helped out as agents of S.H.I.E.L.D.:", "To celebrate Marvel's 80th anniversary and the new comic series, learn everything you need to know about the Invaders, one of Marvel's first super teams: http://bit.ly/2CVfK0P  #Marvel80", "It’s the Age of the X-Man! Writers @ZacBeThompson and Lonnie Nadler (@Lon_Monster) chat with http://Marvel.com  about their mutant aspirations and what to expect from the new \"Age of X-Man Alpha\" comic series:", "Look back on the most memorable action sequences featuring Frank Castle! What's your favorite fight scene from \"Marvel's @ThePunisher\"?", "Writer @Al_Ewing discusses Marvel’s 80-year history and how it feels to horrify fans with his latest turn on \"Crypt of Shadows\" and \"The Immortal Hulk\": http://bit.ly/2CRTCEp  #Marvel80", "The voice cast of “Marvel’s Avengers: #BlackPanthersQuest” will be stopping by to answer YOUR questions! Send us all your fun and important Black Panther questions with #AskMarvel and stay tuned to see if they get answered.", "New this week in #MarvelUnlimited! The prelude to Infinity Wars, love and marriage in Mr. and Mrs. X, a Spidey and Daredevil team-up, plus fresh issues from Excalibur (1988). See all new titles here: http://bit.ly/2CRR1KI ", "Sharpen your knife skills with a new #EatTheUniverse!  Our resident chef @EatFellowHumans channels Wolverine to show the various ways to safely slice and dice various ingredients for your favorite dishes! Watch the full episode: http://bit.ly/2HEL9KD ", "Before he makes his debut as Mysterio in #SpiderManFarFromHome, Jake Gyllenhaal reveals why he decided to join the Marvel Cinematic Universe:", "Join #MarvelsPullList podcast hosts @AgentM and @TuckerMarkus as they go worlds beyond with this week's new comic releases, including \"Journey Into Unknown Worlds\" #1, \"Age of X-Man Alpha\" #1, and more! Listen to the full episode: http://bit.ly/2HQOOFl ", "Hey LAites! Come watch me laugh nervously LIVE onstage Tomorrow as we get to remember and honor one of the most important writers of the last century (supporting @heroinitiative is just the cherry on top).", "Before the new \"Journey Into Unknown Worlds\" #1 hits comic shelves tomorrow, read about how writers @cullenbunn and @claymcleod are bringing old-fashioned thrills back into the spotlight: http://bit.ly/2RYogqe  #Marvel80", "“I have this power, but I don’t know where it came from.” #CaptainMarvel", "Giving away yearly #marvelunlimited subscriptions all week. Unlimited reading of over 24,000 Marvel comics! #Marvel #ad http://ow.ly/p6sH30nuOSo ", "Just two more days and I hope to see you all on the left coast to celebrate the life of one of the creative giants of the modern era while also supporting a great cause.", "Don't miss the new teaser for Season 6 of \"Marvel's #AgentsofSHIELD\"! Watch:", "See how Carol Danvers went from head of security to Super Hero in this History of Captain Marvel installment:", "On a new episode of #MarvelBecoming, cosplayer @Pixel_Stitcher transforms into Silver Sable and debuts the suit at New York Comic Con! Play the \"Marvel's Spider-Man: Silver Lining\" DLC for #SpiderManPS4, available now in the @PlayStation Store. #ad", "From the police station standoff to the brutal gym fight, \"Marvel's @ThePunisher\" showrunner Steve Lightfoot discusses some of Frank Castle’s most noteworthy Season 2 battles:", "Academy Award Best Picture Nominee Marvel Studios' #BlackPanther returns to the big screen beginning February 1st. Fans of all ages can see the movie for free in honor of Black History Month at participating @AMCTheatres. Visit http://bit.ly/2RTNcPG  for more info.", "\"Conan the Barbarian\" writer @JasonAaron, who's celebrating his birthday today, talks about bringing the beloved barbarian back to the pages of Marvel Comics in this special #EarthsMightiestShow bonus clip: http://bit.ly/2SbExHn ", "Marvel Studios' #BlackPanther makes history with Academy Award nominations! \"Marvel's #EatTheUniverse\" is back! It's time for your #MarvelMinute with host @LorraineCink.", "Discover what makes her a hero. Marvel Studios’ @CaptainMarvel is in theaters March 8! Get tickets now: http://www.Fandango.com/CaptainMarvel ", "How will the #AgentsofSHIELD move on without Coulson? Here’s your first look at Season 6!", "If the Runaways were pizza toppings, what would they be? What would Nico and Karolina dress up as for Halloween? #MarvelsRunaways Lyrica Okano (@Lyricaforreal) answers these questions and more in a new #AskMarvel!", "New #SpiderManPS4 update! Celebrate the wall-crawler's history with the Fantastic Four with the Bombastic Bag-Man and Future Foundation suits, available now in the game. ", "Relive the time when Doctor Strange went up against his greatest enemy, Dormammu:", "Go inside the most famous and dangerous jails in the Marvel Universe:", "Congratulations to the cast of Marvel Studios' #BlackPanther for winning the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture! #SAGAwards", "Congratulations to Marvel Studios' #BlackPanther for winning the Screen Actors Guild Award for Outstanding Action Performance by a Stunt Ensemble! #SAGAwards", "ICYMI: From films to TV to comics, get a look at everything you can expect from Marvel in 2019 with #EarthsMightiestShow hosts @LorraineCink and @LangstonBelton! Watch the latest episode: http://bit.ly/2HJLP1p ", "ICYMI: In the latest episode of #MakeMeAHero, veteran and fan Tamar Bains becomes a Super Hero with powers to discern the truth and fight for justice! Watch: http://bit.ly/2RWmGV5 ", "Dive into the history of Marvel's deadliest assassin, Taskmaster:", "Look back on the life and times of Madcap, the Marvel Universe's malevolent prankster:", "Note to self: Don't invade Wakanda. Revisit when T'Challa and his people defended their kingdom from Super Skrulls:", "Get ready for a blast from the past with a special #Marvel80 edition of #MarvelTopTen, featuring the most iconic comics! Watch: http://bit.ly/2HKdm2L ", "ICYMI: Actress @AmyRutberg, AKA Marci Stahl from \"Marvel's @Daredevil\" on Netflix, joins chef @EatFellowHumans on the latest #EatTheUniverse episode to make a Wilson White Fisk with Blood Orange Sauce! Get the recipe and watch now: http://bit.ly/2Hs7Gdg ", "Straight from the 1930s at the beginning of Marvel’s comic history comes Lady Dorma, princess of Atlantis. This week on #Marvel101, we’ve got the love and loss of one of Marvel’s original ladies: http://bit.ly/2HuEZg4  #Marvel80 #ad", "Get up to speed on the latest Marvel news with these top highlights in film, TV, comics, and more:", "With his return in this week's \"Uncanny X-Men Annual\" #1, we're taking a look back at the life and death of Scott Summers, AKA Cyclops:", "\"Jessica Jones: Purple Daughter\" writer Kelly Thompson (@79SemiFinalist) and artist @MattiaIulis discuss Jessica's past and what to expect in future issues:", "\"Marvel's @Daredevil\" receives award for Fans' Choice Favorite TV Show of 2018 from @RottenTomatoes! Learn more:", "Who are the Avengers of 1,000,000 BC? Learn about this ancient super squad and their rich mythology on http://Marvel.com :", "T'Challa explores the histories of Wakanda and his family line in a new episode of \"Marvel's Avengers: Black Panther's Quest,\" airing this Sunday on @DisneyXD! Watch a clip:", "Actress and comedian @DarcyCarden joins the #WomenOfMarvel podcast to talk about her improv comedy background and how that influences her role as Janet on #TheGoodPlace! Watch: http://bit.ly/2HzsIqx ", "Here's your look at the new comics hitting shelves next week! What are you most excited to read?", "Start at the beginning with Carol Danvers' days in the Air Force and her first interactions with Mar-Vell as we dive into Captain Marvel's history:", "On a new #ThisWeekInMarvel podcast, wrestling personality and former pro wrestler @OfficialTAZ, AKA “The Human Suplex Machine,” talks with @AgentM about which Marvel characters he’d like to tag team with! Listen: http://bit.ly/2S8lTAh ", "\"Marvel's @ThePunisher\" showrunner Steve Lightfoot explains how Frank Castle embraces his nature in Season 2 (spoilers ahead!):", "Marvel editors @nick_lowe_ and @MarkPaniccia reveal details about Marvel’s 80th Anniversary one-shots, releasing next month: http://bit.ly/2RMF1Ew  #Marvel80", "For the first time on 4K Ultra HD, see Steve Rogers like you’ve never seen him before! Pre-order Marvel's \"@CaptainAmerica: The First Avenger\" now: http://bit.ly/2RNZ5q9 ", "Look back at Kurt's first solo series ahead of February's release of \"Age of X-Man: The Amazing Nightcrawler\" #1:", "#FridayFeeling #CaptainMarvel", "From films to TV to comics, get a look at everything you can expect from Marvel in 2019 with #EarthsMightiestShow hosts @LorraineCink and @LangstonBelton! Watch the full episode: http://bit.ly/2HJLP1p ", "#MarvelUnlimited panel of the week! The #Marvel80 celebration continues with Cap and Bucky’s first issue:\nhttp://bit.ly/2RMnpcd ", "Would you ever team up with the Merc with a Mouth? Read about six of Deadpool's finest partners in the Marvel Universe:", "\"Ultimates Squared\" writer @Al_Ewing gives us a quick history of Lord Chaos and Master Order on http://Marvel.com :", "Would you ever take a trip to Wakanda? Here are five reasons this African nation's worth a visit:", "We're celebrating the return of \"Marvel Comics Presents\" with a guide to everything you need to know about the legendary series! Learn now on http://Marvel.com :", ".@LorraineCink and Preeti Chhibber (@runwithskizzers) join #WomenOfMarvel hosts Sana Amanat (@MiniB622) and Judy Stephens (@OMG_Dj_Judy) to talk about their new books and connecting with fans on a new podcast episode! Listen: http://bit.ly/2HxAnpe ", "Lyrica Okano (@Lyricaforreal), AKA Nico Minoru from @MarvelsRunaways, joins the #MarvelsVoices podcast with host @AngeliqueRoche to talk about her journey as an actress and how she prepared for Season 2's action scenes:", "To celebrate the \"Guardians of the Galaxy\" comic series relaunch, we're counting down the best team members on http://Marvel.com ! Who's your favorite?", "\"Marvel's @ThePunisher\" showrunner Steve Lightfoot goes into Billy Russo's motivations and journey in Season 2 (spoilers ahead!):", "Who is Tiger Tyger? Read about how tragedy shaped Jessan Hoan into who she is today, ahead of her arrival in \"Black Widow\" #2:", "Hope begins with a hero. Marvel Studios’ @CaptainMarvel is in theaters March 8. Get tickets: http://www.Fandango.com/CaptainMarvel ", "Didja know Doctor Strange earned his Cloak of Levitation through battle? Learn more about the Master of Mystic Arts with these fascinating details:", "Enter the #SpiderVerse with these prints from artists @mrflorey and Matt Ferguson (@Cakes_Comics)! Get them while supplies last from @GreyMatterArt and @BottleneckNYC. ", "#TodayInMarvelHistory in 1991, the 'Weapon X' story arc began on the pages of \"Marvel Comics Presents\" #72.", "More Marvel Minimates are on the way, and this time, we're focusing on Spider-Man's friends and foes! See them here:", "Travel back in time to the early days of K'un Lun and learn about the secret history of the Iron Fist:", "Explore the legacy of respected mutant hero and revolutionary Scott Summers, who makes a comeback in \"Uncanny X-Men Annual\" #1, available now:", "What happens after Thanos dies? Prepare to find out in the brand new \"Guardians of the Galaxy\" #1, available in comic shops now:", "From \"Guardians of the Galaxy\" #1 to \"Avengers\" #13, #MarvelsPullList hosts @AgentM and @TuckerMarkus dive into classic stories told in a new way on the latest podcast episode! Listen: http://bit.ly/2HubyL7 ", "Read about the times Steve Rogers had to shed the mantle of Captain America to get things done: http://bit.ly/2CDFC0T ", "Here are the top three costumes from this week's new comics! Which outfit would you wear? http://bit.ly/2RKNbx9 ", "Who will come out victorious? Vote now! #MarvelPixelBattle", "Can the human rocket defeat Great Britain's finest? Cast your vote, and find out next week! #MarvelPixelBattle ", "Big Man is back! Before you read \"Amazing Spider-Man\" #13, learn all about one of the classic Spidey villains who just won’t stay dead:", "In a new episode of #MakeMeAHero, veteran and fan Tamar Bains becomes a Super Hero with powers to discern the truth and fight for justice! Watch: http://bit.ly/2RWmGV5 ", "Now more than ever the cosmos need the Guardians…but who is left to answer the call?  Find out when you purchase \"Guardians of the Galaxy\" #1 in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms apply. Log in to http://bit.ly/2CBzSot  to get started.", "#MarvelUnlimited takes you through writer @JHickman’s entire reading chronology: http://bit.ly/2RMm8St ", "Take a brief tour of alternate versions of Reed Richards! How many Reeds off the top of your head? http://bit.ly/2RGPIZj ", "Revisit the 1977 launch of the Black Panther's solo series and the search for King Solomon's Frog: http://bit.ly/2CAJnEs ", "As the God of Thunder, Thor clashes with legendary opponents pretty regularly. Run down a list of his six greatest battles: http://bit.ly/2RGGKLD ", "ICYMI: Marvel Studios' #BlackPanther lands historic 'Best Picture' Academy Awards nomination: http://bit.ly/2RHdlRn  #OscarNoms⁠ ⁠", "Inspired by #MarvelFutureFight, @CollectSideshow is releasing The Punisher War Machine Armor Sixth Scale Figure by Hot Toys! See how you can pre-order: http://bit.ly/2CBDnLx ", "Where have you been, Black Widow? Follow Natasha Romanoff's journey from her death in \"Secret Empire\" to the launch of her new comic series, out now: http://bit.ly/2CApHk4 ", "Get the inside scoop on how Namor's war buddies respond to his recent threats with \"Invaders\" writer Chip @Zdarsky: http://bit.ly/2CFae2l ", "Actress @AmyRutberg, AKA Marci Stahl from \"Marvel's @Daredevil\" on Netflix, joins chef @EatFellowHumans to make a Wilson White Fisk with Blood Orange Sauce in a new episode of #EatTheUniverse! Get the full recipe: http://bit.ly/2Hs7Gdg ", "New this week in #MarvelUnlimited! Jessica Jones and Cloak & Dagger Digital Originals are here, the Life of Carol Danvers, old-school Power Man. See all new titles here: http://bit.ly/2RKhPqH ", "The world needs a hero. Get tickets to Marvel Studios’ @CaptainMarvel, in theaters March 8: http://www.fandango.com/captainmarvel ", "An attack is coming. Watch a preview for the new episode of #TheGifted, airing tonight on FOX: http://bit.ly/2CxSupe ", "Watch the full music featurette for @WylieSofia's \"Side By Side,\" the featured song from \"@Marvel_Rising: Chasing Ghosts\"! Stream and download it now: http://bit.ly/2S2wBID ", "This April, \"Marvel Team-Up\" relaunches with writer @EveEwing and artist @JoeyVazquezArt! Learn more: http://bit.ly/2CzrWUJ ", "Exclusive: Chicago's own literary wunderkind @eveewing will be taking on a new project at @Marvel comics — writing a Ms. Marvel and Spider-Man team-up. https://trib.al/Zdl8g9y ", "Congratulations to Marvel Studios' @Avengers: #InfinityWar on its Academy Awards nomination for Best Visual Effects! #OscarNoms", "Congratulations to Marvel Studios' #BlackPanther on its seven Academy Awards nominations, including Best Picture! #OscarNoms", "Congratulations to #BlackPanther on its Academy Awards nomination for Best Original Song, \"All The Stars\"! #OscarNoms", "Congratulations to Marvel Studios' #BlackPanther on its Academy Awards nomination for Production Design! #OscarNoms", "Congratulations to Marvel Studios' #BlackPanther on its Academy Awards nomination for Original Score! #OscarNoms", "Congratulations to Marvel Studios' #BlackPanther on its Academy Awards nomination for Sound Editing! #OscarNoms", "Congratulations to Marvel Studios' #BlackPanther on its Academy Awards nomination for Sound Mixing! #OscarNoms", "Congratulations to Marvel Studios' #BlackPanther on its Academy Awards nomination for Costume Design! #OscarNoms", "From Deadpool to the Hulk, explore the Marvel heroes who have joined forces with the galaxy’s power-packing protectors in their times of need! Who would you want the Guardians to team up with?", "Revisit when T'Challa joined the Marvel Universe's top problem-solving team, the Ultimates: http://bit.ly/2RDw5S2 ", "Simon Williams, AKA Wonder Man, rebounded from death’s door almost more than any other, so we're revisiting five of his greatest returns:", "\"@Marvel_Rising: Chasing Ghosts\" is here! A new \"Guardians of the Galaxy\" comic series debuts this week! It's time for your #MarvelMinute with host @LorraineCink. #ad", "Honestly not sure if I’m spoiling this @EmpireMagazine cover but whatever, someone has to be the @MarkRuffalo of 2019. This hits stands Thursday. (via @BrieLarson) #CaptainMarvel", "Run down a list of past hosts who've taken on the Phoenix Force! How many can you name off the top of your head?", "Frank Castle's been in some tricky situations, but he keeps coming no matter what you throw at him. Read more:", "Look back at some of the real-life musicians who rocked their way into the pages of a Marvel comic:", "In the latest #ThisWeekInMarvel podcast, get the inside scoop on everything you need to know about Frank Castle from the writer of the \"Punisher\" series, Matthew Rosenberg (@AshcanPress)! Listen to the full episode: http://bit.ly/2FJzfwl ", "ICYMI: In the latest #EatTheUniverse, chef @EatFellowHumans creates a Meat Loaf Wellington inspired by one of the earliest Marvel heroes, Angel, AKA Thomas Halloway, to celebrate Marvel’s 80th anniversary! Watch the full episode: http://bit.ly/2RvQqst  #Marvel80", "ICYMI: In the latest episode of #MakeMeAHero, we transform Marvel executive editor @TomBrevoort and \"The Fantastic Four\" writer @DanSlott into new members of Marvel's First Family! Watch: http://bit.ly/2RPZQy7 ", ".@WylieSofia's \"Side By Side,\" the featured song from \"#MarvelRising: Chasing Ghosts,\" is now streaming (http://bit.ly/2Rz6WaZ ) and available for download (http://bit.ly/2RyYxEu )! @Marvel_Rising", "Congrats to the cast and crew of “Wolverine: The Long Night” for their @iHeartRadio Podcast Awards win for “Best Scripted Podcast” of 2018! #WolverinePodcast", "See what the reviews are saying about Season 2 of \"Marvel's @ThePunisher\":", "Missed your dose of Marvel news? Here are the top highlights from this week on http://Marvel.com :", "Catch all the latest episodes for all our digital series on http://Marvel.com ! Go: http://www.marvel.com/watch ", "Get ready to meet the ancient cult of Koga Thun! Look inside @GerryDuggan and @RonGarney's \"Savage Sword of Conan\" on http://Marvel.com :", "Here's a preview of all the new comics hitting shelves next week!", ".@Disney & @Marvel star @WylieSofia makes her music debut with \"Side by Side\" https://blbrd.cm/UJg7nV ", "\"The War of the Realms\" just got more crowded, as Venom, Daredevil, and the X-Men enter the fray! Read all the announcements on http://Marvel.com :", "#EarthsMightiestShow host @LangstonBelton recaps everything you need to know from the first season of \"Marvel's @ThePunisher\" before you dive into Season 2, streaming now on Netflix! Watch: http://bit.ly/2FGnV49 ", "Gear up for Season 2 of \"Marvel's @ThePunisher\" with official apparel, available now! Learn how to get your own: http://bit.ly/2Cv2MXg ", "Who is Voyager? Learn everything you need to know about Valerie Vector ahead of \"Avengers: No Road Home\" #1, arriving in February:", ".@AnikaNoniRose joins an all-new episode of \"Marvel's Avengers: Black Panther's Quest,\" guest starring as T'Challa's ancestor! Learn more and tune in Sunday on @DisneyXD: http://bit.ly/2RTftoI ", " #GooseTheCat #CaptainMarvel", "This April, enter \"Major X\" with legendary creator @RobertLiefeld! Get all the details:", "Higher. Further. Faster. Discover all of the Marvel Studios' #CaptainMarvel emojis by @100Soft! #GooseElGato #닉퓨리 #MásAltoMásLejosMásRápido", "Explore the history behind Rogue and Longshot’s unrealized romantic relationship:", "Exclusive: Deadpool creator's new comic Major X will introduce a new X-Men character", "“Side By Side” by @WylieSofia, the featured song from “#MarvelRising: Chasing Ghosts,” is here! Listen and watch the full music featurette: http://bit.ly/2FF7ViO  @Marvel_Rising", "In a new #MarvelLetsPlay, hosts @JoshDSaleh and @AngeliqueRoche showcase the Fantastic Four's abilities in @Marvel_FFightUS! #FantasticFourWeek #ad", "Explore Frank Castle's complicated history with these essentials comic reads featuring the Punisher:", "Take a look at the new @EmpireMagazine subscriber cover for Marvel Studios' @CaptainMarvel!", "#MarvelUnlimited panel of the week by artist @RyanOttley! What else could Peter Parker have on his mind? Find out in \"Amazing Spider-Man\" #1, now available in #MarvelUnlimited: http://bit.ly/2CoAeP6 ", "Who is Madelyne Pryor, AKA the Goblin Queen? Learn about the X-Men’s ally-turned-enemy:", "Take a look into Scott Lang's comic history and all the big (and small) milestones of his life! What's your favorite Ant-Man moment?", "As an editor and writer at Marvel in the 1980s and 1990s, Carl Potts spoke to http://Marvel.com  about the history of Frank Castle and what it’s like for him to witness how far the Punisher has come:", "Explore the most dangerous and power-mad beings that inhabit the Negative Zone:", "What happens when your favorite Marvel Super Hero goes bad? Apart from a certain sub-mariner in this week's \"Invaders\" #1, learn about who else has strayed from the path of righteousness:", "\"Marvel Comics Presents\" #1 returned this week, so we're taking a look back at 10 classic tales from the original series:", "Actress @KimikoGlenn sits down with #MarvelsVoices host @AngeliqueRoche to talk about how she embraces identity in her roles in film and TV! Watch: http://bit.ly/2FH8RTD ", "Jigsaw: a fractured man with a fractured past. Dive into the history of the Punisher’s most persistent foe:", "Get ready to celebrate Ms. Marvel's fifth anniversary with \"Ms. Marvel\" #38, coming to comic shops in February! See a preview:", "Authors Preeti Chhibber (@runwithskizzers) and @LorraineCink join a new #WomenOfMarvel podcast to share more about their upcoming books and what it’s like to be a part of the amazing Marvel literary community! Listen: http://bit.ly/2FBPxIz ", "#80YearChallenge #Marvel80", "X marks the spot with @RobertLiefeld. #XMen #MarvelComics", "Now THIS is a team-up of epic proportions! Watch \"#MarvelRising: Chasing Ghosts\" on the Marvel HQ YouTube channel now: http://bit.ly/2FDNm6l  @Marvel_Rising", " THWIP! Be one of the first 25,000 fans at @Mets' Marvel Super Hero Day and get a limited edition #SpiderMan bobblehead: http://atmlb.com/2AQEg2L ", "Dating Matt Murdock may be exciting, but it's also just as perilous! Read about high cost of loving the Devil of Hell's Kitchen:", "Didja know Terrax the Tamer once put New York in orbit? Learn more about this cosmic Super Villain on http://Marvel.com :", "Star of @HamiltonMusical and Erg from #TheGifted on FOX, @MichaelLuwoye celebrates Marvel’s 80th Anniversary on an all-new #EarthsMightiestShow with @LorraineCink and @LangstonBelton! Watch the full episode: http://bit.ly/2FFFAsD  #Marvel80", "X marks the spot on this unused X-Men cover from 1992. #XMen #MarvelComics", "1964's \"Daredevil\" #52 brought T'Challa and the Man Without Fear together, but definitely not without a fight:", "Explore the most important milestones of Peter Parker's high school days:", "Learn about the fall and rise of Richard Rider, AKA Nova, with a look back at his greatest moments:", "What's next for Frank Castle? Star @JonnyBernthal and showrunner Steven Lightfoot spoke with http://Marvel.com  to give us a look into \"Marvel's @ThePunisher\" Season 2:", "Mysterio: hero or villain? Look through a list of must-read comics featuring the mystifying master of the macabre:", "#FantasticFourWeek may be coming to an end, but if you missed any news about Marvel's First Family, look no further! Here's a roundup of all the highlights:", "http://Marvel.com 's fashion columnist highlights the best looks from today's new comics! Which one's your favorite?", "While Frank Castle's sorting himself out, tackle a Jigsaw of your own by making this \"Marvel's @ThePunisher\"-inspired puzzle! Get the step-by-step guide on how to create it:", "To kick off the debut of \"Black Widow,\" available now in comic shops, http://Marvel.com  looks back at Natasha's deadliest nemeses:", "She’s the hero that brought Doctor Doom back from the brink. This week on #Marvel101, Victorious is on the scene in Latveria and ready to fight for her homeland: http://bit.ly/2HdCZIR  #FantasticFourWeek", "Learn how to play with each member of the Fantastic Four in #MarvelFutureFight in this highlight from our #FantasticFourWeek livestream! Watch the full clip: http://bit.ly/2RNa1nj  @Marvel_FFightUS #ad", "#MarvelLetsPlay host @JoshDSaleh gives some helpful tips ad tricks for how to succeed in @Marvel_FFightUS with the Fantastic Four! Watch: http://bit.ly/2HpeoB4  #FantasticFourWeek #ad", "Just 15 minutes until the premiere of \"Marvel Rising: Chasing Ghosts\" on the Marvel HQ YouTube channel! Are you tuning in? Go: http://bit.ly/2RwA9n8 ", "Is it getting hot in here, or is it just us? Catch up on all things #FantasticFourWeek on http://bit.ly/2CtRMts ! (: @baristart_mike) #HumanTorch #ComicsNCoffee", "X marks the spot. #XMen #MarvelComics", "From the production sets to the costume design, explore how the look of \"Marvel's @ThePunisher\" Season 2 creates a perfect setting for Frank Castle:", "Let him do what he does best. \"Marvel's @ThePunisher\" Season 2 premieres this Friday, January 18 on Netflix.", "In a special #FantasticFourWeek episode of #MakeMeAHero, we're transforming Marvel executive editor @TomBrevoort and \"The Fantastic Four\" writer @DanSlott into new members of Marvel's First Family! Watch: http://bit.ly/2RPZQy7 ", "This new \"#CaptainAmerica: The Winter Soldier\" poster from @GreyMatterArt and artist Anthony Petrie (@zombiebacons) will stay with you till the end of the line! Get it now: http://greymatterart.com ", "\"#MarvelRising: Chasing Ghosts\" premieres TODAY on the Marvel HQ YouTube channel! Catch it at 4pm PT/7pm ET and live chat with stars from the show: http://bit.ly/2CoGtmg  @Marvel_Rising", "Terrific teams try to triumph in the four new Marvel comics featured on an all-new #MarvelsPullList podcast! Listen to the full episode: http://bit.ly/2HiY8kP  #FantasticFourWeek #ad", "50 days. Check out these brand new character posters, and see Marvel Studios' @CaptainMarvel in theaters March 8th! Get tickets now: http://www.fandango.com/CaptainMarvel  (3/3)", "50 days. Check out these brand new character posters, and see Marvel Studios' @CaptainMarvel in theaters March 8th! Get tickets now: http://www.fandango.com/CaptainMarvel  (2/3)", "50 days. Check out these brand new character posters, and see Marvel Studios' @CaptainMarvel in theaters March 8th! Get tickets now: http://www.fandango.com/CaptainMarvel  (1/3)", "#NCBD with Jessica Jones! When her daughter comes home with purple skin, Jessica’s forced to question her time with the Purple Man…and her marriage to Luke Cage. Read the first TWO chapters of this double-sized #1 by @79SemiFinalist and @MattiaIulis: http://bit.ly/2RyIAy3 ", "SNIKT! \"Wolverine: The Long Night\" podcast and comic writer @Benjamin_Percy will be answering YOUR questions on a new episode of #AskMarvel. Send us all your fun and crucial questions with the hashtag and stay tuned to see if they get answered, bub.", "Celebrate #Marvel80 with #MarvelUnlimited! We’re kicking off our monthly 80th Anniversary spotlights with this list of Golden Age comic wonders: http://bit.ly/2ClXhtU ", "Galactus has returned to devour the Earth…and only one man can save us: Doctor Doom! Purchase \"Fantastic Four\" #6 in the Digital Comics Shop and earn 1,000 #MarvelInsider points. Terms Apply. Log in to http://bit.ly/2Cio2PY  to get started.", "Learn about the nine most important women in Peter Parker's life by looking back into Spider-Man's comic history:", "Marvel meets the glitz and glam of Hollywood! Read about the characters who have taken their shots at big screen fame:", "Explore the history of Spider-Man's black suit and how he discovered it:", "Marvel Minimates for Marvel Studios' #CaptainMarvel are here! See more and shop the line at Walgreens:", "Doctor Doom may be the Fantastic Four's greatest foe, but what if he wasn't really all that bad? Take a more positive look back at some of Doom's most noteworthy moments: http://bit.ly/2CnGQ09  #FantasticFourWeek", "In a new #EatTheUniverse, chef @EatFellowHumans creates a Meat Loaf Wellington inspired by one of the earliest Marvel heroes, Angel, AKA Thomas Halloway, to celebrate Marvel’s 80th anniversary! Watch the full episode: http://bit.ly/2RvQqst  #Marvel80", "Prepare for Season 2 of \"Marvel's @ThePunisher\" with a primer on where we left off:", ".@MarvelPuzzle lead designer @CaseyMalone joins @AngeliqueRoche in this #FantasticFourWeek episode of #MarvelLetsPlay to uncover all the game's new tips and tricks! Watch: http://bit.ly/2RwJ5J8  #ad", "Tune in for the \"#MarvelRising: Chasing Ghosts\" premiere TOMORROW at 4pm PT/7pm ET on our Marvel HQ YouTube channel, featuring a live chat with stars @KathreenKhavari, @TylerGPosey, @Kamil_McFadden, and more! Mark your calendars now: https://youtu.be/HkFrDCTpZC4 ", "SNIKT! \"Wolverine: The Long Night\" podcast and comic writer @Benjamin_Percy will be answering YOUR questions on a new episode of #AskMarvel. Send us all your fun and crucial questions with the hashtag and stay tuned to see if they get answered, bub.", "Don't miss all the #FantasticFourWeek excitement on our Marvel HQ YouTube channel! Watch episodes of \"Fantastic Four: World's Greatest Heroes\" and more: http://bit.ly/2CqgpqH ", "In a special #FantasticFourWeek episode of #MarvelQuickdraw, artist Andy Macdonald (@andymacdeez) reveals how he was introduced comics as he brings Victorious to life! Watch: http://bit.ly/2Rwuopa  #ad", "#ThisWeekInMarvel listeners! This month's Marvel Unlimited Reading Club selection is \"Marvel Comics\" #1. Read along with us and send in your questions with the hashtag #TWIMURC, then tune into a new episode to hear them get answered by our hosts: http://bit.ly/2HeJdZ2 ", "Our #FantasticFourWeek celebrations continue with a breakdown of the Fantastic Four's fabulous fashion featured in Marvel Comics! Learn more: http://bit.ly/2Rt4VNJ  #ad", "We just added another workshop! Check it out, \"Non-Fiction Storytelling: The Marvel Method\" with Marvel Audio Producer @BrandonGrugle", "X marks the spot. 5-16-92 #MarvelComics", "Take a dive into 13 standout moments from the new #SpiderManFarFromHome teaser trailer:", "100 days. Marvel Studios' #AvengersEndgame is in theaters April 26.", "Can Stephen Strange save the universe from Galactus? Find out when you read \"Doctor Strange\" #13, coming to comic shops in March! See the cover:", "You've seen the new #SpiderManFarFromHome trailer, so you might have one question: Who is Mysterio? Learn about the mind-bending marauder on http://Marvel.com :", "In theaters July 5. #SpiderManFarFromHome ", "\"Are you going to step up or not?\" Watch the #SpiderManFarFromHome teaser trailer now! 7.5.19 ", "Avengers Mansion is under siege by Baron Zemo and his Masters of Evil! Read this fan-favorite Avengers arc with a new #MarvelUnlimited reading list: http://bit.ly/2RqJ1uv ", "“Killmonger” comic writer @bryanedwardhill will be answering some of your questions for an upcoming episode of #AskMarvel! Send us all your important questions with the hashtag and stay tuned to see if they get answered."]}