{"tweets": ["Deeply anguished by the loss of lives due to the foot overbridge accident in Mumbai. My thoughts are with the bereaved families. Wishing that the injured recover at the earliest. The Maharashtra Government is providing all possible assistance to those affected.", "Joined the ceremony to mark the presentation of the Gallantry Awards and Distinguished Service Decorations.\n\nIndia is proud of all those who protect the nation. \n\nTheir courage will be remembered for generations to come.", "India First, India always!", "Great gesture! \n\nAlso, Kudos to the great Dabbawalas, whose notable work ensures lakhs of people are fed.", "Voting in high numbers is not about politics but about national interest, for which 130 crore Indians must work together.", "Good effort! \n\nKeep doing so till the elections.", "Happy to know that Jan Aushadhi stores are reducing medical expenses and providing good quality medicines.", "With the blessings of 130 crore Indians, what was deemed impossible for decades, by successive governments, is now possible.\n\nOur unwavering commitment to public welfare has ensured outstanding results for all sections of society. \n\nA lot has been done and we aim to do much more!", "No place for middlemen.\n\nNo tolerance for corruption. \n\nNo fake beneficiaries swindling away recourses. \n\nThis is a New India. We have worked hard to remove corruption and punish the corrupt.\n\nDo read this fine piece by @arunjaitley Ji.", "My fellow Indians, \n\nUrging you all to strengthen voter awareness efforts across India. \n\nLet us all ensure maximum number of Indians come out to vote in the 2019 Lok Sabha elections.", "Dear @mathrubhumieng, @dinathanthi and Eenadu, \n\nYou have worked to give voice to people's aspirations.\n\nIncreased voter awareness is key to a strong democracy. \n\nI appeal to you to motivate people to vote in large numbers.", "The media plays a vital role in a democracy. \n\nIt is also a strong influence on people's minds.\n\nI request @Sanjaygupta0702, @aroonpurie and @18RahulJoshi to work towards greater voter awareness and registration that ensures an impressive turnout at the hustings.", "Urging @SrBachchan, @iamsrk and @karanjohar to creatively ensure high voter awareness and participation in the coming elections. \n\nBecause...its all about loving your democracy (and strengthening it). :)", "Voting is not only a right but it’s also a duty. \n\nDear @BeingSalmanKhan and @aamir_khan, \n\nIt is time to inspire and motivate youth in your own Andaz to vote so that we can strengthen Apna Democracy & Apna country.", "Dear @akshaykumar, @bhumipednekar and @ayushmannk, \n\nThe power of a vote is immense and we all need to improve awareness on its importance. \n\nThoda Dum Lagaiye aur Voting ko Ek Superhit Katha banaiye.", "I call upon veterans of the media world, @RajatSharmaLive, @subhashchandra and @vineetjaintimes to take the lead in highlighting the need to vote in large numbers. Doing so would ensure greater participation in democratic processes and strengthen our nation's development.", "Dear @msdhoni, @imVkohli and @ImRo45, \nYou are always setting outstanding records on the cricketing field but this time, do inspire the 130 crore people of India to set a new record of high voter turnout in the upcoming elections. \nWhen this happens, democracy will be the winner!", "I appeal to @RSSorg, NCC, NSS, Nehru Yuva Kendra and @Brahmakumaris to help increase voter awareness and tap the power of society for democracy.", "Dear @anilkumble1074, @VVSLaxman281 and @virendersehwag - your heroic deeds on the cricket pitch have inspired millions. \n\nCome, it is time to inspire people once again, this time to vote in record numbers.", "I appeal to @RubikaLiyaquat, @anjanaomkashyap, @sudhirchaudhary, @rahulkanwal and the team of @republic to spread awareness on voter registration, and why every Indian, particularly the youth should vote. \n\nYour support can ensure more people exercise their franchise.", "Dear @BajrangPunia, @shankar_live and @BajpayeeManoj, \n\nYour talent and skill has entertained millions, and made India proud. \n\nYour voice is respected widely. \n\nPlease lend strength to our democracy by increasing voter awareness and inspiring people to vote.", "The prolific Phogat sisters, @geeta_phogat, @BabitaPhogat, @PhogatRitu and @Phogat_Vinesh manifest the best of Indian sporting talent. \n\nWe've seen you in the wrestling world. \n\nI urge you all to support the movement to ensure greater voter participation in the 'Chunavi Dangal.'", "Requesting @deepikapadukone, @aliaa08 and @AnushkaSharma to urge people to vote in large numbers for the coming elections. \n\nAs renowned film personalities whose work is admired by many, I am sure their message will have a positive impact on our citizens.", "Respected @CitiznMukherjee, \nBeing among India's most prolific statesmen and someone who has been active in politics for decades, you would understand the power of a vote. I request you to appeal to the people to enrich the festival of democracy by participating in large numbers.", "When @mangeshkarlata Didi, @sachin_rt and @arrahman say something, the nation takes note!\n\nI humbly request these remarkable personalities to inspire more citizens to come out and vote in the 2019 elections. \n\nA vote is a great way to make the people's voice heard.", "Dear @sarbanandsonwal, @himantabiswa, @SangmaConrad and @Neiphiu_Rio,  \n\nI request you to work towards increasing vote awareness in the Northeast. \n\nA vote is a powerful way for people to express and become active participants in India's growth trajectory.", "Requesting @smitaprakash, @PTI_News, @navikakumar and @prasannavishy to embolden the cause of high voter turnout in the 2019 polls. As leading public voices associated with important platforms, your support on voter awareness will be valuable and beneficial for 130 crore Indians.", "My young friends @RanveerOfficial, @Varun_dvn & @vickykaushal09, \n\nMany youngsters admire you. \n\nIt is time to tell them: Apna Time Aa Gaya Hai and that it is time to turn up with high Josh to a voting centre near you.", "Dear @RNTata2000, @anandmahindra and @ashishchauhan, \n\nIndia wins when our democracy gets strengthened. \n\nEnsuring maximum participation in voting is the perfect way to strengthen democracy. \n\nCan we all make this happen?", "Dear @srikidambi, @Pvsindhu1 & @NSaina, \n\nThe core of badminton is the court and the core of democracy is the vote. \n\nJust like you smash records, do also inspire a record-breaking voter turnout. I request you to increase voter awareness & motivate youth to vote in large numbers.", "India is proud of @Neeraj_chopra1, @DuttYogi and @WrestlerSushil. \nHowever, they made India win because they participated. I request Neeraj, Yogeshwar and Sushil to encourage people to participate in the elections and vote so that India wins here too!", "Dear @SriSri ji, @SadhguruJV ji, @yogrishiramdev ji and Sri M, \n\nSpiritual leaders like you inspire many through words and work. \n\nI request you to also inspire people towards greater democratic participation. \n\nPlease encourage greater voter awareness.", "Dear @k_satyarthi, @thekiranbedi and @sudarsansand, \n\nA vote gives voice to people's aspirations. \n\nAs widely respected personalities, your efforts towards increasing voter awareness will strengthen India's democracy. \n\nI request you to lend your voice for the same.", "Dear @Mohanlal and @iamnagarjuna, \n\nYour performances have entertained millions over the years and you have also won many awards. I request you to create greater voter awareness and urge people to vote in large numbers.\n\nThe award here is, a vibrant democracy.", "Dear @HarsimratBadal_ , @ichiragpaswan and @AUThackeray, increasing awareness among the youth on the importance of voting is a paramount task in front of us. \n\nUrging you to do your best to ensure high public participation in the upcoming elections.", "Dear @NitishKumar, @irvpaswan and @pawanchamling5, soliciting your support and active participation in improving voting across the country in the coming elections. \n\nLet us strive to create an atmosphere where maximum voting can take place.", "I call upon KCR Garu, @Naveen_Odisha, @hd_kumaraswamy, @ncbn and @ysjagan to work towards bringing maximum Indians to the polling booths in the upcoming elections. May voter awareness efforts be strengthened across the length and breadth of India.", "I appeal to @RahulGandhi, @MamataOfficial, @PawarSpeaks, @Mayawati, @yadavakhilesh, @yadavtejashwi and @mkstalin to encourage increased voter participation in the upcoming Lok Sabha polls. A high turnout augurs well for our democratic fabric.", "मजबूत लोकतंत्र के लिए चार अनुरोध। \n\nभारत के मतदाताओं, विशेषकर युवा साथियों से एक अपील।", "Four requests for a stronger democracy.\n\nAn appeal to the voters of India, especially my young friends.", "जब एक मुट्ठी नमक ने अंग्रेजी साम्राज्य को हिला दिया !", "Tributes to Bapu and all those who marched with him to Dandi in pursuit of justice and equality. \n\nSharing a few thoughts on the Dandi March, the ideals of Bapu and his disdain for the Congress culture in my blog.", "Earlier today, had a wonderful interaction with a delegation of Parliamentarians from Bangladesh.", "Joined the ceremony in which Padma Awards were conferred on various distinguished citizens. \n\nCongratulations to all those who received the awards. \n\nIndia is proud of their exemplary service and accomplishments.", "There was always a desire to serve Baba Bholenath and I am happy to have got that opportunity in the form of the Vishwanath Dham Project.", "Thank you! The Jan Aushadhi Kendras have helped crores of citizens across all age groups. It is a vital part of our efforts to ensure that healthcare is affordable and is of good quality.", "Absolutely! The idea of 'One Nation, One Card' will further 'Ease of Living' and ensure a better quality of life, especially for those living in cities.", "Kannada is a beautiful language.", "Thank you. Hopefully more youngsters will know about the sacrifices of the great women and men who ensured we breathe the air of freedom.", "Nari Shakti has a central role in national progress. \n\nWe have always worked to create opportunities in various fields that empower women and ensure a life of dignity for them.", "Agenda 2019 – Part - I : The Leadership Issue   http://bit.ly/2NXkpUQ ", "Greetings to Captain Amarinder Singh Ji on his birthday. Praying for his long and healthy life. @capt_amarinder", "Boosting India and Bangladesh ties. Inaugurating key projects with PM Sheikh Hasina. Watch.", "Majestic Gir Lion....Lovely picture!", "Guided by ‘Sabka Saath, Sabka Vikas’, NDA seeks your blessings again. \nWe spent the last five years fulfilling basic necessities that were left unfulfilled for 70 long years. Now, time has come to build on that and create a strong, prosperous & secure India. #PhirEkBaarModiSarkar", "India is proud that:\n\n2.5 crore families have electricity for the first time.\n\n7 crore households have smoke-free kitchens. \n\n1.5 crore Indians got their own homes.\n\nThese, and many other instances show that with the right approach and futuristic policies, nothing is impossible!", "Today:\n\n50 crore Indians have access to good quality and free healthcare. \n\n42 crore people of unorganised sector have access to old-age pension.\n\n12 crore farmer households get yearly monetary support of Rs. 6000.\n\nCrores of middle class families are exempt from income tax.", "Today, the people of India know that it is possible to:\n\nBecome the fastest growing economy.\n\nGive a befitting reply to terror. \n\nEliminate poverty at a record pace. \n\nMake India Swachh.\n\nRemove corruption and punish the corrupt. \n\nEnsure inclusive and extensive development.", "The last five years have shown that with the blessings and participation of 130 crore Indians, what was earlier deemed impossible has now become possible. \n\n2019 polls are about a spirit of confidence and positivity with which India is fulfilling the aspirations of its people.", "Wishing all political parties and candidates the very best for the 2019 Lok Sabha elections. \n\nWe may belong to different parties but our aim must be the same- the development of India and empowerment of every Indian!", "In 2014, the people comprehensively rejected the UPA. There was unprecedented anger over the UPA’s corruption, nepotism and policy paralysis. India’s self-confidence was at an all-time low and the people of India wanted to rid the nation of such decay and pessimism.", "Best wishes to the Election Commission, all those officials and security personnel who will be on the field, across the length and breadth of India assuring smooth elections. India is very proud of the EC for assiduously organising elections for several years.", "The festival of democracy, Elections are here. \n\nI urge my fellow Indians to enrich the 2019 Lok Sabha elections with their active participation. I hope this election witnesses a historic turnout. \n\nI particularly call upon first time voters to vote in record numbers.", "We are all proud of @CISFHQrs's service to the nation. \n\nThey protect vital development infrastructure and thus, play a crucial role in India’s growth.\n\nToday, on the 50th Raising Day of CISF, joined their programme and interacted with CISF personnel.", "Paid tributes to the martyrs of @CISFHQrs for their outstanding service to the nation.", "India is proud of CISF! Watch my speech at their Raising Day programme.", "दिव्य काशी विश्वनाथ की भव्यता बढ़ाने का एक अनूठा प्रयास। देखिए...", "Ayushman Bharat has transformed lakhs of lives across India.\n\nHere is a book that chronicles a hundred such stories, of those who lead a healthier life thanks to Ayushman Bharat.\n\nRead, get inspired and share widely with others. \n\nhttps://www.pmjay.gov.in/sites/default/files/2019-03/100_Stories_PM_JAY.pdf …", "Had a wonderful interaction with recipients of the Nari Shakti Puraskar. \n\nhttp://nm-4.com/v8h8 \n\nvia NaMo App", "Today’s India will not be helpless in front of terror.\n\nWe will give a befitting reply to those forces who ruin the atmosphere of peace and harmony.", "The Pandit Deendayal Upadhyaya Institute of Archaeology is a wonderful attempt towards connecting our coming generations with our glorious past. Happy to have inaugurated this institute today.", "Laid the foundation stones for thermal power plants in Buxar and Khurja. \n\nBy focussing on production, transmission, distribution and connection, the NDA Government has transformed the power sector.", "Thank you Noida, for joining today's public meeting in such record numbers.\n\nI derive great strength from the blessings of the people.", "Congratulations to the people of Chhattisgarh, Goa, Haryana, Himachal Pradesh, Jharkhand, Manipur, Meghalaya, Mizoram, Nagaland, Tripura and Uttarakhand for getting their own Doordarshan channels on DD Free Dish for the first time!", "Glad to note that Prasar Bharati has brought 11 more State DD Channels on the Satellite footprint of India through DD Free Dish. This includes five channels for Northeastern states. This will go a long way in strengthening regional cultures and fulfilling people's aspirations.", "Inaugurating projects that will further ‘Ease of Living’ for people of Greater Noida. Watch.", "With Party colleagues at the @BJP4India Parliamentary Board meeting.", "India is united when it comes to fighting terrorism.\n\nIndia is proud of our armed forces and the nation trusts the forces.\n\n130 crore Indians have seen through the dirty politics of a handful of Opposition parties on national security!", "Came back to Delhi from Ghaziabad via the Metro. \n\nHad delightful interactions with fellow passengers.", "Euphoric atmosphere at the public meeting in Ghaziabad, where multiple projects were inaugurated. Have a look at these pictures.", "Do hear about the work happening in the Namami Gange Mission, and how it is positively impacting the people of Uttar Pradesh.", "The case of the Panki Power Plant shows best how BJP has worked on the energy sector in Uttar Pradesh while Congress, SP and BSP did simply nothing during their long tenures.", "Thoughtful and wonderful rendition, @ArkoPravo19! The song captures very well the accomplishments of India’s Nari Shakti. \n\nMy best wishes.", "महिलाओं को आर्थिक और सामाजिक रूप से स्वावलंबी बनाने के लिए  मोदी सरकार द्वारा चलाई जा रही योजनाओं का लाभ उठा नामुमकिन को भी मुमकिन कर रही हैं देश की साधारण महिलाएं। #NewIndia4NariShakti", "न्यू इंडिया की कहानी, देश की एक बेटी की जुबानी... #NewIndia4NariShakti", "Yesterday, I had a great time with Divyang friends at my residence. Sharing some memorable moments.", "बीते 15 दिनों में दो ऐसे निर्णय लिए गए हैं, जिनका सीधा लाभ महिलाओं और गांवों को होने वाला है।", "Self Help Groups play an important role in our society. During our tenure, new vigour has been added in the working of SHGs, which will further empowerment of women.", "Inaugurating multiple development works in Ghaziabad. Watch.", "केंद्र सरकार महिला सशक्तिकरण के लिए पूरी तरह समर्पित है। बेटियों के जन्म से लेकर जीवन के हर चरण के लिए महिला सशक्तिकरण की योजनाएं चल रही हैं।", "Today, on International Women’s Day, interacted with over 65 lakh women from 75,000 locations all over India. \n\nSharing some glimpses.", "Overwhelmed by the warmth and support in Kanpur. Watch my speech.", "Vishwanath Dham is an exercise happening at a scale unseen for many years. Among the notable aspects of the project is that Maa Ganga’s Darshan from Kashi Vishwanath Temple will be possible. \n\nI would like to thank the people of Kashi for enthusiastically supporting the project.", "Began my Kashi visit by praying at the Kashi Vishwanath Temple, a symbol of our culture’s pride. In the Temple complex, performed the Bhumipujan of Vishwanath Dham project, a futuristic corridor around the Temple that will benefit several pilgrims and tourists coming to Kashi.", "काशी में राष्ट्रीय आजीविका सम्मेलन संबोधित कर रहा हूं। देखिए... #NewIndia4NariShakti", "हर हर महादेव! \n\nआज बाबा भोलेनाथ के आशीर्वाद से श्री काशी विश्वनाथ धाम के शिलान्यास का सौभाग्य प्राप्त हुआ है।", "Birthday greetings to @VasundharaBJP Ji. Vasundhara Ji’s good work in Rajasthan ensured substantial progress in the state. Praying for her long and healthy life.", "On International Women's Day, we salute our indomitable Nari Shakti.\n\nWe are proud to have taken numerous decisions that have furthered women empowerment.\n\nEvery Indian is proud of the stupendous accomplishments of women in various spheres. #NewIndia4NariShakti", "The Dictionary of Martyrs of India’s Freedom Struggle is a humble tribute to the great personalities who sacrificed their present for the glorious future of India. \nI compliment all those who have been working assiduously on this exercise, which is remarkable and one of its kind.", "We had a memorable programme at 7, Lok Kalyan Marg today. \n\nIn the presence of young Divyang friends, a new series of visually impaired friendly coins were launched. \n\nThese coins will help the visually impaired greatly.", "Janaushadhi Kendras across India are at the forefront of providing affordable medicines to the poor. This initiative has added significant strength to the efforts of the Central Government to ensure every Indian has access to healthcare that is of good quality and is affordable.", "Thanks to Janaushadhi Kendras, there is no need to go back from a medical store just because medicines are exorbitantly priced.\n\nOurs is a Government that cares and is ensuring affordable medicines for India's hardworking people.", "Healthcare costs in urban areas are rising considerably. In such times, Janaushadhi Kendras offer a ray of hope. Here is an interaction with people in Delhi.", "In addition to creating a healthier India, the Pradhan Mantri Bhartiya Janaushadhi Pariyojana has created economic opportunities for many. \n\nDharmesh Bhai from Surat told me about his switch from a career in marketing to running a store under PMBJP. Have a look.", "The Rathore family from Rajasthan's Bikaner is more than satisfied with the quality of medicines thanks to Pradhan Mantri Bhartiya Janaushadhi Pariyojana. I thank young Lokendra for his kind words too.", "India salutes all those greats who took part in the freedom struggle.", "A historic occasion for Maharashtra! Watch.", "Steps that will improve governance in the Northeast. Watch.", "A great interaction with Pradhan Mantri Bhartiya Janaushadhi Pariyojana beneficiaries. Watch.", "At 1 PM this afternoon, I will interact with beneficiaries and entrepreneurs associated with the Pradhan Mantri Bhartiya Janaushadhi Pariyojana, from over 5000 locations. During the interaction, beneficiaries will share their own experiences. Do watch live!", "NDA’s priorities are India First.\n\nNDA’s policies put people first.\n\nOur decisiveness, work culture and track record are known to everyone.\n\nOpposition lacks proper leadership and a vision to take the country forward.", "The NDA is best suited to fulfil regional aspirations. \n\nCongress has always trampled over regional aspirations, pride and insulted any leader who does not bow to their High Command.", "Son of the soil, Bharat Ratna MGR lives on in the hearts of crores of people.\n\nInaugurated a statue in his honour and also announced the decision to rename Chennai Central Station after him.\n\nNDA will always work hard to fulfil the dreams of MGR.", "I thank all those who joined the NDA rally in Kancheepuram, Tamil Nadu.\n\nNDA in Tamil Nadu is a wide ranging coalition, which will always work for the people of the state. \n\nI urge my sisters and brothers of Tamil Nadu to bless NDA in the upcoming elections.", "India is home to the world’s largest healthcare programme, Ayushman Bharat.\n\nToday in Kalaburagi, I met beneficiaries of the flagship healthcare scheme and heard their experiences.", "The NDA Government at the Centre has come down heavily on corruption. \n\nMiddlemen no longer get access to the corridors of power.\n\nThat is why, those who thrived in the earlier times dislike me and are getting together to form a ‘Maha Milawat’ or adulterated alliance.", "In Kalaburagi, highlighted steps taken by the Central Government for those associated with the sugarcane sector.", "These pictures from Kalaburagi show the strong support for @BJP4India.\n\nKarnataka is tired of the opportunistic alliance between Congress and JD(S).\n\nThey promised to waive loans but ended up harassing farmers and filing cases against them.", "Vanakkam Kancheepuram. Happy to be here. Watch my speech at the NDA rally.", "Addressing a huge public meeting in Kalaburagi. Watch.", "The @PrayagrajKumbh set notable records. Emphasis on cleanliness & sanitation was visible. A record was set for most number of people sweeping the floors. Records were also set in the fields of transportation and art. Use of technology for administering the Kumbh was commendable.", "Congratulations to the people of UP, especially Prayagraj, and the entire State Government under CM @myogiadityanath Ji for the exceptional organisation of @PrayagrajKumbh. \n\nThis Kumbh showcased the best of our culture, spirituality and will be remembered for years to come.", "Kumbh 2019 now holds a Guinness World Record. By organising the historic parade of 510 Shuttle Buses in #Kumbh2019,  Prayagraj Mela Authority achieved the record of largest parade of buses.", "Another record achieved by Kumbh 2019.The Guinness World Record for \"Most contribution to a Handprint Painting in 8 hours\", in which 7664 people participated, broke the former record held by Seoul of 4675 people. #Kumbh2019", "#Kumbh2019 has made a Hattrick under the Guinness World Records, a new record of \"Most People Sweeping the Floor (Multiple Venues) has been achieved in Prayagraj, with the participation of more than 10,000 sanitation workers.", "Looking forward to being in Kancheepuram for the launch of many development works relating to road and railways sector. \n\nThe Ennore LNG Terminal will be dedicated to the nation. \n\nA statue of the great MGR will be unveiled at Dr. MGR Janaki College of Arts & Science for Women.", "The foundation stone for the resitement of BPCL Depot Raichur to Kalaburagi will be laid. \n\nA women’s hostel for students from the Northeast at Bangalore University will also be dedicated to the nation. \n\nLater, I shall address a @BJP4Karnataka gathering in Kalaburagi.", "I will be in Kalaburagi today to launch key development projects. \n\nESIC Hospital and Medical College, Bengaluru, and the Super Specialty Block of KIMS, Hubballi will be dedicated to the nation. \n\nThere will also be an interaction with Ayushman Bharat beneficiaries.", "Last month, I had the honour of seeking the blessings of Boro Ma Binapani Thakur at Thakurnagar. I will always cherish the interaction I had with her. We stand in solidarity with the Matua community in this hour of sadness.", "Boro Ma Binapani Thakur was an icon of our times. A source of great strength and inspiration for several people, Boro Ma’s rich ideals will continue to influence generations. Her emphasis on social justice and harmony will never be forgotten.", "Earlier today, prayed at Shree Annapurna Dham in Adalaj, Gujarat.", "आदिवासी भाइयों और बहनों के हित में लिए गए एनडीए सरकार के महत्वपूर्ण फैसले...", "कई बड़े वादे किए थे कांग्रेस ने।\n\n10 दिन में कर्ज माफ करेंगे, नहीं तो मुख्यमंत्री बदलेंगे।\n\nमध्य प्रदेश में नई सरकार बने महीनों हो गए। ना कर्ज माफ हुआ, ना ही मुख्यमंत्री बदले गए।", "भारत भर में महामिलावट करने वाले लोग अब अंतर्राष्ट्रीय महामिलावट करने में लगे हैं।", "In Dhar, interacted with beneficiaries of Ayushman Bharat. \n\nGlad that this initiative has transformed the lives of many by providing top quality and affordable healthcare.", "Sharing some pictures from the massive rally in Dhar, Madhya Pradesh. @BJP4MP", "Empowering every citizen. Launching the PM Shram Yogi Maan Dhan Yojana.", "Dear @ChouhanShivraj Ji, best wishes on your birthday. Your energy and humility have endeared you to all sections of society. Madhya Pradesh always remembers your outstanding governance. \n\nLooking forward to being in Dhar later today and being with @BJP4MP Karyakartas.", "Remembering Biju Babu on his Jayanti. His noteworthy efforts for Odisha’s development continue to be cherished by generations. He undertook numerous measures for empowerment of the poor and marginalised during his long years in public service.", "On the auspicious occasion of Mahashivratri, prayed at the Dholeshwar Mahadev Temple in Gandhinagar. \n\nHar Har Mahadev!", "Here is how the dream of ‘One Nation, One Card’ was fulfilled today, furthering ‘Ease of Living’ for several citizens.", "It’s a memorable day in Ahmedabad’s history. \n\nOur beloved Ahmedabad gets a Metro! \n\nInaugurated Phase-1, travelled on the metro and laid the foundation stone for Phase-2. \n\nWe want to provide convenient, and cost effective transportation in our cities.", "यह नया भारत है। \n\nआतंक के सामने कभी नहीं झुकेगा, चुन-चुन कर बदला लेगा और जरूरत पड़ी तो दुश्मन के घर जाकर भी हिसाब चुकता करेगा।", "We are committed to building a society where gender sensitivity and gender equality are vital cornerstones", "With the blessings of Maa Umiya, the Bhumipujan of Vishv Umiyadham took place amidst unparalleled enthusiasm. Here are some glimpses.", "The Guru Gobind Singh Hospital is a state-of-the-art centre that will improve healthcare infrastructure in Jamnagar and surrounding areas. Glad to have inaugurated it today.", "People from all walks of life joined the public meeting at Jamnagar.\n\nSpoke about Gujarat's outstanding growth trajectory. Also highlighted the importance of water conservation and discussed the important steps taken by the NDA Government for farmer welfare.", "Speaking at the inauguration of New Civil Hospital in Ahmedabad..Join Live!", "Jai Umiya Mata! At the Bhumipujan of Vishv Umiyadham.", "Delighted to be in Jamnagar. Inaugurating various development works. Watch.", "#Mahashivratri greetings to everyone. \n\n#महाशिवरात्रि के पावन अवसर पर सभी देशवासियों को बहुत-बहुत शुभकामनाएं। \n\nऊँ नम: शिवाय!", "In Ahmedabad, will inaugurate the New Civil Hospital. Shall also dedicate to the nation, a Women Children & Super Specialty Hospital, Cancer Hospital, Eye Hospital and Dental Hospital. This health infrastructure will greatly help people get affordable & quality healthcare.", "In Ahmedabad, various projects relating to healthcare and the railways will also be dedicated to the nation.", "4th March 2019- a historic day for the wonderful people of Ahmedabad. \n\nPhase-1 of the Ahmedabad Metro is going to be inaugurated. This project will further ‘Ease of Living’ for the people of Ahmedabad. \n\nThe foundation stone for Phase-2 of the Metro will also be laid.", "At Jaspur, I will lay the foundation stone for the Vishva Umiyadham Complex. \n\nAfter that, I would be going to Ahmedabad to inaugurate vital infrastructure projects for the city.", "The Bandra-Jamnagar Humsafar Express will be flagged off tomorrow. \n\nA 51 km long pipeline from Aaji-3 to Khijadiya will be dedicated to the nation. \n\nThe foundation stone to double the Rajkot-Kanalus Railway line will also be laid.", "I look forward to visiting Gujarat tomorrow and the day after. I will be joining programmes in various parts of the state. \n\nIn Jamnagar, I will dedicate to the nation the Annexe of the Guru Gobind Singh Hospital. Various works relating to the SAUNI Yojana will also be unveiled.", "The NDA Government is proud of our Defence Forces and will do everything possible to strengthen the forces.\n\nThose who ruled India for years neglected the forces when in power and now, when they are out of power these people are busy questioning our forces. \n\nShame!", "The work done by the NDA Government for Amethi should have been done years ago.\n\nSadly, it was not done.", "A boost to ‘Make in India’ and India-Russia friendship. \n\nThe AK-203, that will be manufactured in Amethi will strengthen our armed forces and help them fight terrorists.", "Gratitude to the people of Amethi for blessing us today.\n\nThose in whom the people of Amethi placed their faith have ignored this great place for several years. \n\nIn the 2019 elections, history will be created in Amethi!", "Great atmosphere at the NDA rally in Patna. I thank all those who joined the rally at the historic Gandhi Maidan.", "वो कहते हैं, आओ मिलकर मोदी को खत्म करें। \n\nमैं कहता हूं, आओ मिलकर गरीबी, भ्रष्टाचार, कुपोषण दूर करें। \n\nआओ मिलकर देश का विकास करें।", "देश को सेना पर गर्व है, पर कुछ राजनीतिक दल ऐसी बातें करते हैं, जिससे दुश्मनों के चेहरे खिलते हैं। \n\nउनका यह तरीका दुर्भाग्यपूर्ण और शर्मनाक है।", "केंद्र और बिहार की एनडीए सरकारें मिलकर बिहार के विकास को प्राथमिकता दे रही हैं।", "NDA Government is committed to Amethi’s progress. Addressing a public meeting in Amethi. Watch.", "पटना के ऐतिहासिक गांधी मैदान से एनडीए की रैली संबोधित कर रहा हूं। देखिए...", "Looking forward to being among my sisters and brothers of Amethi today. \nhttp://nm-4.com/5jh8 \n\nvia NaMo App", "This afternoon, I would be joining the NDA rally at Patna’s iconic Gandhi Maidan. \n\nWatch my address at the rally live on the NaMo App.", "सबसे तेज भारत...", "आज तक क्यों?", "Their token approach versus our total approach...here is a glimpse of which approach has been more effective.", "Congress' approach of doles and deals harmed our Jawans and Kisans the most.\n\nNow, times have changed. Public welfare and poverty alleviation matter over everything else.", "This is a New India. \n\nWe are fully capable of protecting our nation and giving a befitting reply to those who disturb the atmosphere of peace.", "Interacting with bright youngsters at the Grand Finale of Smart India Hackathon.", "Speaking at the India Today Conclave on a wide range of issues. Watch!", "At 8 PM, will be addressing the @IndiaToday Conclave 2019. Watch my address on channels of the India Today group. #LetsConclave19", "Looking forward to interacting with young innovators during the Grand Finale of Smart India Hackathon 2019 at 10 PM via video conferencing. \n\nThe 36 hour long Hackathon would surely lead to pioneering research and innovations that would help solve several national challenges.", "Congratulations to @BJP4India family for the successful organisation of the #BJPVijaySankalpBikeRally in various parts of India. I thank people from all walks of life, particularly my young friends for joining the rallies in large numbers. Great seeing such energy and positivity.", "Handed over a “Chadar” that would be presented at the Ajmer Sharif Dargah on the 807th Urs in the coming days.", "Addressing the Construction Technology India 2019 conference in Delhi. Watch.", "Welcome Home Wing Commander Abhinandan!\n\nThe nation is proud of your exemplary courage.\n\nOur armed forces are an inspiration for 130 crore Indians.\n\nVande Mataram!", "Thank you Andhra Pradesh for the phenomenal support. Addressing a rally in Visakhapatnam.", "Addressing a rally in Kanyakumari, Tamil Nadu. Watch.", "Greetings to my friend and Bihar’s hardworking Chief Minister, @NitishKumar Ji. Nitish Ji’s persistence ensured Bihar emerged out of the shadows of years of misrule. His pro-people governance has touched the lives of many. I pray for Nitish Ji’s long and healthy life.", "Interacting with crores of BJP Karyakartas across several locations. Watch. #MeraBoothSabseMazboot", "Speaking at the National Youth Parliament Festival 2019. Watch.", "Travelled to the ISKCON temple and back via the Delhi Metro. \n\nHad delightful interactions with fellow passengers.", "Here are some images from the Gita Aradhana Mahotsav at Delhi’s iconic ISKCON temple. \n\nUnveiled a Bhagwad Gita that is 2.8 meters high and weighs over 800 kg.\n\nThe Gita’s prolific teachings have touched the lives of millions of people across the world.", "May the lamp of progress and prosperity shine brighter and brighter in every home. \n\nJoin crores of beneficiaries of people-centric schemes of the NDA Government and hardworking @BJP4India Karyakartas in the ongoing #BJPKamalJyoti Sankalp Abhiyan.\n\nCome, let us spread brightness.", "The Gita teaches us harmony and brotherhood. Addressing a programme at Delhi’s ISKCON temple.", "सौगंध मुझे इस मिट्टी की, मैं देश नहीं झुकने दूंगा...", "वीरों की भूमि, राजस्थान के चुरू से देखिए मेरा संबोधन...", "Honouring those who have been conferred the Gandhi Peace Prize. Watch my remarks.", "Spoke on a widely discussed topic - jobs...", "I found it surprising that the Congress would oppose Aadhaar but the reasons are now clear. Know why...", "These two examples, one each from UP and Jharkhand, will show you how delayed projects adversely impact the development trajectory of our nation.", "NDA's priorities are people centric. Which is why, what must rise, like GDP growth & Ease of Doing Business have risen in our tenure & what should fall, like corruption & prices are falling.\nIn UPA, GDP growth rate was falling, business was tough, prices & corruption were high!", "Speaking at the #News18RisingIndia Summit. Watch.", "Sharing some more glimpses from the Rashtriya Samar Smaarak, located in the heart of Delhi, near India Gate. \n\nDo visit the Smaarak whenever you can.", "Rashtriya Samar Smaarak, the #NationalWarMemorial has been dedicated to the nation.\n\nIndia is eternally grateful to all those who have served the nation with utmost bravery and vigour. It is due to them that our nation is safe, secure and can reach new heights of progress.", "People have seen the difference between a Government guided by India First and a Government guided by ‘Family First.’\n\nThose who focused on ‘Family First’ were bothered about naming everything under the sun after one family.\n\nOur way is different, we care for 130 crore Indians!", "Those who ruled the nation for decades were not serious about the welfare of our armed forces. There are several examples to illustrate this point. \n\nFrom Bofors to Helicopter Scam, why is it that the same people’s names come up?", "Making India self-sufficient as far as defence production is concerned.", "With the blessings of the people of India, the four decade old demand for OROP was fulfilled during the tenure of the NDA government. \n\nSeveral ex-servicemen benefitted from this decision.", "Addressing ex-servicemen before the dedication of #NationalWarMemorial to the nation.", "In a short while from now, Rashtriya Samar Smaarak, the #NationalWarMemorial will be dedicated to the nation. \n\nHere are some glimpses of the Memorial, located near India Gate in Central Delhi.", "बीमार का मुफ्त उपचार...अब मुमकिन है।\n\nनामुमकिन अब मुमकिन है!", "The people of Prayagraj must be congratulated for being exceptional hosts of the Kumbh in the city.\n\nThe efforts of the Naviks, local administration, police personnel have been noteworthy. \n\nCongratulations to the UP Government for their stupendous organisation of the Kumbh!", "‘Swachh Kumbh, Swachh Aabhaar’ was a great platform to honour those great women and men who have worked tirelessly to keep the Kumbh at Prayagraj clean. Here are some glimpses from the programme. @PrayagrajKumbh", "Moments I’ll cherish for my entire life! \n\nHonouring remarkable Safai Karamcharis, who have taken the lead when it comes to realising the dream of a Swachh Bharat! \n\nI salute each and every person making a contribution towards a Swachh Bharat", "Enrich the programme on 28th by:\n\nMobilising family & friends to join.\n\nFilling People’s Pulse survey and giving ground level feedback from your constituency. \n\nDonate to BJP, boost morale of Karyakartas. \n\nShare thoughts on NaMo App or social media using #MeraBoothSabseMazboot.", "For @BJP4India, hardworking Karyakartas are the biggest assets of the party. \n\nThey are serving society with great diligence. \n\nOn 28th February, I look forward to interacting with crores of Karyakartas, spread across more than 15,000 locations. #MeraBoothSabseMazboot", "Addressing the ‘Swachh Kumbh, Swachh Aabhaar’ programme in Prayagraj.", "Had the good fortune of taking a holy dip at the #Kumbh. Prayed for the well being of 130 Crore Indians.", "Long live India’s farmers!\n\n#PMKisan Yojana enhances the dignity of farmers, brings prosperity in their lives and contributes to India’s agricultural transformation.", "किसानों का जीवन आसान बनाने के लिए केंद्र सरकार के कुछ अनूठे प्रयास।", "केंद्र सरकार की ‘बीज से बाजार’ एप्रोच के कारण, कृषि व्यवस्था में जो बातें लोग पहले नामुमकिन समझते थे, वो अब मुमकिन हो रही हैं।", "ये नया भारत है। इसमें केंद्र सरकार, जितना पैसा किसी गरीब के लिए, किसी किसान के लिए भेजती है, वो पूरा पैसा सीधे उसके खाते में पहुंचता है। बिचौलियों की कोई जगह नहीं है।", "जब केंद्र में किसानों के कल्याण के कार्य करने वाली सरकार होती है, तो यह उसकी नीतियों से भी स्पष्ट होता है।\n\nकांग्रेस की बेहद कमजोर कर्जमाफी की नीति का लाभ बहुत कम किसानों को मिला, #PMKisan योजना से करोड़ों किसानों पर सकारात्मक प्रभाव पड़ेगा।", "आज 1 करोड़ 1 लाख किसानों के बैंक खातों में #PMKisan की पहली किस्त ट्रांसफर करने का सौभाग्य मिला। यह मेरे लिए बहुत भावुक क्षण था।\n\nहमारे अन्नदाता देशवासियों का पेट भरने के लिए दिन-रात परिश्रम करते हैं। उनके कल्याण के लिए काम करना हमारी सर्वोच्च प्राथमिकता है।", "आज बाबा गोरखनाथ की धरती गोरखपुर से 'प्रधानमंत्री किसान सम्मान निधि' योजना की शुरुआत हुई।\n\nइस ऐतिहासिक अवसर पर मैं देशभर के करोड़ों किसान परिवारों को बधाई देता हूं। #PMKisan", "My fellow Indians, \n\nDo you wish to see an India where everyone has access to good quality and affordable healthcare?\n\nIf so, then here's an appeal from me about what you can do... #MannKiBaat", "Popularising local paintings of Kutch,\n\nServing Divyang sisters and brothers,\n \nImproving local irrigation networks,\n\nFighting timber mafia and Maoists,\n\nSpoke about Padma Awardees and how the awards honour fine individuals working silently at the grassroots. #MannKiBaat", "The wait for our own National War Memorial is over!\n\nTomorrow, India will get its own War Memorial, which will honour those who protect us with utmost valour.\n\nI am sure visiting the war memorial will be no less than a pilgrimage! #MannKiBaat", "The 44th Amendment made our democracy stronger and ensured authoritarian tendencies can't subvert our Constitution, like what was done during the Emergency. \n\nDuring #MannKiBaat today, we paid tributes to Morarjibhai Desai and his role in protecting our democratic fabric.", "India stands with our farmers! Launching the #PMKisan Yojana from Gorakhpur. Watch.", "Discussing several subjects during #MannKiBaat. Tune in.", "Today’s #MannKiBaat is special! Do tune in at 11 AM. \n\nLater on don’t say I didn’t tell you in advance :)", "Tributes to Jayalalithaa Ji on her birth anniversary. Her contribution towards the development of Tamil Nadu will be remembered for generations. A fine administrator and compassionate leader, her welfare measures benefitted countless poor people.", "Tomorrow’s launch of PM Kisan Samman Nidhi demonstrates two things:\n\nNDA's unwavering commitment to farmer welfare.\n\nSpeedy decision making- a scheme announced on 1st February has become a reality in such a short span. \n\nThis is the new work culture of New India!", "Tomorrow is a historic day! The Pradhan Mantri Kisan Samman Nidhi will be launched from Gorakhpur. This is a scheme that will give wings to the aspirations of crores of hardworking farmers of India who feed our nation.", "बीते साढ़े चार वर्षों में जनहित के अनेक काम हुए हैं। \n\nएक नया विश्वास जगा है ।", "बीजेपी के संस्कार कांग्रेस से अलग हैं। हमने किसान कल्याण के लिए कोई कसर नहीं छोड़ी।\n\nराजस्थान की जनता कांग्रेस से पूछ रही है – कर्जमाफी के वादे का क्या हुआ?", "आज टोंक में मुझे राजस्थान के लोगों का भरपूर स्नेह और आशीर्वाद मिला। मैदान भी छोटा पड़ गया था। इस स्नेह के लिए धन्यवाद। @BJP4Rajasthan", "A historic accomplishment by a stellar athlete! \n\nCongratulations to @apurvichandela for winning the Gold in the 10m Air Rifle event at the ISSF World Cup. Her success makes every Indian proud and motivates more youngsters to excel in various sports!", "Lok Sabha MP Shri S Rajendran will be remembered for his community service initiatives. He diligently worked for the development of Viluppuram and Tamil Nadu. Saddened by his demise. My thoughts are with his family and supporters in this hour of grief.", "राजस्थान की जनता को शत-शत नमन। टोंक में सभा को संबोधित कर रहा हूं। देखिए...", "India missed the bus when it came to the first three industrial revolutions but as far as the Fourth Industrial Revolution is concerned, this is a bus we haven't simply boarded, but we will also drive it!", "नामुमकिन अब मुमकिन है!", "There are competitions now and there were competitions before 2014. \n\nWhich ones do you prefer?", "Over the last 4.5 years, \n\nHesitations made way for hope. \n\nObstacles have been replaced by optimism. \n\nIssues have been sorted out by initiatives. \n\nThe results of the efforts can be seen in many global rankings too.", "Addressing the @EconomicTimes Global Business Summit. Watch. #ETGBS", "I would like to specially thank President @moonriver365 and FL Kim Jung-sook. It was wonderful to interact with them. President Moon and I will continue working together for stronger ties between India and the Republic of Korea.", "Gratitude to the people and Government of the Republic of Korea for the exceptional warmth during my visit. This visit will lead to closer economic and cultural relations between our countries. Strong India-Korea ties benefit not only Asia but the entire world.", "문재인 대통령과 김정숙 여사 내외께 특별히 감사드림. 함께 멋진 시간을 보냈음. 문대통령과 함께 강력한 한-인도 협력관계를 위해 앞으로도 협력하겠음.", "한국 정부와 국민들이 보여준 환대에 감사. 이번 방문으로 양국간 경제 문화적 관계가 가까워질 것임. 강력한 한-인도 협력은 아시아뿐 아니라 전세계를 위해 좋은 일임.", "India will always do everything possible to contribute to global peace and progress.", "The solution to hardships is in hard work. \n\nWe are leaving no stone unturned to bring a transformative change in the lives of 130 crore Indians.", "I would be giving the prize money of the #SeoulPeacePrize to the Namami Gange fund. It is our collective duty to ensure a clean Ganga, which is so central to our culture.", "Here are some glimpses from the ceremonial welcome at the \n@TheBlueHouseKR.", "The Act East Policy of India and President @moonriver365’s New Southern Policy augur well for close friendship between India and the Republic of Korea. Today, President Moon and I talked about cooperation in areas like ports, food processing and the vital infrastructure sector.", "Held productive discussions with President @moonriver365 on various aspects relating to India-Korea relations. Today’s discussions will add further vigour to bilateral relations between our nations.", "문재인 대통령과 한-인도 양국관계의 여러 측면에 대해 생산적인 대화를 가졌음. 오늘의 논의는 양국간 관계에 활력을 더해 줄 것임.", "The Seoul Peace Prize is dedicated to the people of India & our country’s culture of peace and harmony.", "Addressing the media after the productive talks with President @moonriver365. Watch.", "Interacting with the Republic of Korea's dynamic Indian community. Watch.", "Here are some glimpses from Yonsei University, where Mahatma Gandhi’s bust was unveiled. \n\nThe august presence of President @moonriver365, FL Kim Jung-sook and my friend, Mr. Ban Ki-moon (former Secretary General of the United Nations) made the programme even more special.", "The start-up sector has the energy of youngsters as well as the zeal to create something unique and beneficial for fellow citizens. \n\nBoth India and the Republic of Korea are giving topmost importance to this sector. Hence, it is natural to deepen cooperation in start-ups.", "Over the last four and a half years, the transformative changes have led to:\n\nSound economic fundamentals. \n\nConsistent growth. \n\nPathbreaking reforms. \n\nFruits of development reaching the poorest of the poor.\n\nFast paced creation of futuristic infrastructure.", "For the last four and a half years, India has witnessed unprecedented transformation. \n\nI hope companies from the Republic of Korea leverage the series of opportunities India offers.", "Bapu’s voice reverberates globally! Unveiling a bust of Gandhi Ji in Seoul.", "Addressing Indian and Korean businesspersons in Seoul. Watch.", "Subjects relating to world peace, security, the need to fight terrorism figured during the talks with HRH Mohammed Bin Salman.", "HRH Mohammed Bin Salman and I discussed aspects relating to closer investment ties between our nations. We also had discussions relating to the oil and energy sector. I am glad that Saudi Arabia has decided to strengthen the International Solar Alliance with its participation.", "Held extensive talks with HRH Mohammed Bin Salman, the Crown Prince of Saudi Arabia. \n\nIndia’s ties with Saudi Arabia are historical and time-tested. \n\nSaudi Arabia is a valued strategic partner of India in the 21st century.", "During our talks, President @moonriver365 and I will take forward our conversations from last year on how best to advance the India-ROK partnership. \n\nI will also meet business leaders,  the Indian community as well as eminent persons from all walks of life.", "As fellow democracies, India and ROK have shared values and a vision for world peace. \n\nAs fellow market economies, our needs and strengths are complementary. \n\nROK is an important partner for @makeinindia, @swachhbharat and @startupindia initiatives.", "This evening, I will be leaving for the Republic of Korea at the invitation of President @moonriver365. \n\nWe regard the Republic of Korea as a valued friend with which we have a Special Strategic Partnership. \n\nThe visit will boost bilateral cooperation.", "Addressing the media after talks with HRH Mohammed Bin Salman, the Crown Prince of Saudi Arabia.", "हिन्दी साहित्य के शिखर पुरुष नामवर सिंह जी के निधन से गहरा दुख हुआ है। उन्होंने आलोचना के माध्यम से हिन्दी साहित्य को एक नई दिशा दी। ‘दूसरी परंपरा की खोज’ करने वाले नामवर जी का जाना साहित्य जगत के लिए अपूरणीय क्षति है। ईश्वर दिवंगत आत्मा को शांति दे और परिजनों को संबल प्रदान करे।", "Best wishes on Mizoram Statehood Day. \n\nThe people of Mizoram are known for their valour and rich value systems. The entire nation is proud of the Mizo culture and the contribution of the state towards India’s progress. \n\nPraying for Mizoram’s growth in the coming years.", "Greetings to the people of Arunachal Pradesh on their Statehood Day. \n\nThe culture of Arunachal Pradesh is special and its people are known for their wonderful nature as well as patriotic zeal. \n\nMay the state continue to prosper in the years to come.", "India is delighted to welcome HRH Mohammed Bin Salman, the Crown Prince of Saudi Arabia.", "Memorable moments from the public meeting in Varanasi.", "हमारी सरकार देश के विकास को दो पटरियों पर एक साथ आगे बढ़ा रही है।\n\nपहली पटरी है इंफ्रास्ट्रक्चर।\n\nदूसरी पटरी गरीब, किसान, श्रमिक, मध्यम वर्ग का जीवन आसान बनाने की है।", "Remarkable strides in the IT and health sector, that will benefit Uttar Pradesh, especially Purvanchal.", "In Varanasi, flagged off the first ever Diesel to Electric Converted Locomotive. \n\nI congratulate the entire team that has worked on this historic accomplishment, which will enhance the efforts of the Railways towards electrification.", "Today, on the auspicious occasion of Ravidas Jayanti, offered prayers at the Shri Guru Ravidass Janam Asthan. \n\nGuru Ravidas’ message of harmony, equality and efforts to empower the poor continue to motivate people across India.", "काशी की जनता को शत-शत नमन। काशी के विकास के लिए हमारे प्रयास जारी रहेंगे। औढ़े गांव से देखिए लाइव...", "काशी के संत रविदास जी के मंदिर में दर्शन करने का सौभाग्य मिला और विकास की परियोजनाओं की नींव रखी।", "परम पूज्य संत रविदास जी को उनकी जयंती पर कोटि-कोटि नमन। सद्भाव, समानता और सामाजिक सशक्तिकरण के लिए उन्होंने जो अनमोल एवं अमिट संदेश दिया, वह हमें सदा प्रेरित करता रहेगा।", "I bow to Chhatrapati Shivaji Maharaj on his Jayanti. \n\nA warrior for truth and justice, he is revered as an ideal ruler, devout patriot and is particularly respected by the poor and downtrodden. Jai Shivaji!", "Inspired by the vision of Atal Ji and Balasaheb Thackeray Ji, BJP-Shiv Sena alliance will continue working for the well-being of Maharashtra and ensuring the state once again elects representatives who are development oriented, non corrupt and proud of India’s cultural ethos.", "Our association with the @ShivSena goes beyond politics. We are bound by a desire to see a strong and developed India. \n\nThe decision to contest together strengthens the NDA significantly. I am sure our alliance is going to be Maharashtra’s first and only choice!", "Today, ten MoUs were signed between India and Argentina. \n\nCovering sectors such as defence, tourism, pharmaceuticals, agriculture, IT and civil nuclear cooperation, these agreements will further cement relations between our nations. @mauriciomacri", "During the talks today, President @mauriciomacri and I discussed ways to deepen trade ties. The coming of a large Argentinian business delegation to India augurs well for strong economic relations.", "President @mauriciomacri and I discussed aspects relating to security and terrorism. \n\nWe agree that forces of terror pose a serious threat to world peace and it is important for humanitarian forces to join hands and fight the menace of terror.", "Delighted to welcome President @mauriciomacri. \n\nToday was our fifth meeting, indicating the priority we accord to close friendship between India and Argentina. \n\nWe are meeting at a time when we complete 70 years of bilateral diplomatic ties between our countries.", "Joined the programme to mark the conferring of the 'Tagore Award For Cultural Harmony' for 2014, 2015 and 2016.\n\nI congratulate Rajkumar Singhajit Singh Ji, Chhayanaut and Ram V. Sutar Ji on being conferred the Tagore Award for their rich contribution to culture, art and music.", "Happy to know about the successful operation. \n\nBest wishes for your good health Ashok Ji. @ashokgehlot51", "स्वस्थ बिहार, विकसित बिहार।", "हमारा प्रयास:\n\nउत्तम इन्फ्रास्ट्रक्चर\n\nगरीब का पक्का घर\n\nहर घर में बिजली\n\nरसोई को धुएं से मुक्त करना- गैस कनेक्शन\n\nपीने का साफ पानी।", "आज कई ट्रेनों को हरी झंडी दिखाई। इनसे कनेक्टिविटी में सुधार आएगा। \n\nपटना रिवरफ्रंट बनने से पर्यटन को बढ़ावा मिलेगा।", "प्रधानमंत्री ऊर्जा गंगा योजना पूर्वी भारत के विकास में महत्वपूर्ण भूमिका निभा रही है।", "Ensuring ‘Ease of Living’ for my sisters and brothers of Jharkhand.", "Boosting Bihar’s development. Inaugurating multiple projects in Barauni.", "This month’s #MannKiBaat programme will take place on the 24th. \n\nDial 1800-11-7800 to record a message for the programme. \n\nExpress your wonderful ideas on either the MyGov Open Forum or the NaMo App.", "Will be in Hazaribagh, Jharkhand today to inaugurate:\n\nThree medical college buildings.\n\nFour rural water supply schemes.\n\nSahibganj Sewerage Treatment Plant\n\nMadhusudan Ghat.\n\nFoundation stone for many projects will also be laid. \n\nKnow more.", "I look forward to being in Bihar’s Barauni. \n\nThe inauguration and laying of foundation stones for projects relating to urban development, sanitation, railways, oil and gas, healthcare as well as fertilisers will take place today.", "Greetings to Telangana’s Chief Minister, Shri K. Chandrashekar Rao Garu on his birthday. May Almighty bless him with a long life filled with good health. @TelanganaCMO", "In Yavatmal, talked about landmark decisions for the benefit of farmers and nomadic communities.", "Connecting people, furthering aspirations. \n\nThe foundation stones and inaugurations took place for many connectivity related projects, which will improve convenience for people in Yavatmal and surrounding areas. \n\nSeveral people also got their own new homes.", "Ayushman Bharat is having a positive impact among the poor, SC and ST communities of Maharashtra. \n\nThanks to Ayushman Bharat, good quality and affordable healthcare is no longer a dream…", "Dhule and Gau Mata have a glorious history. \n\nThe proposed Kamdhenu Aayog will have a transformative impact as far as the animal husbandry sector is concerned.", "A significant effort has been made today to overcome the issue of water scarcity in Maharashtra. \n\nAt the same time, there is emphasis on ensuring better irrigation and improving sewer systems.", "The dastardly attack in Pulwama has anguished the nation. \n\nYes, this is a time of great sadness. \n\nBut, I assure every family that a befitting reply will be given!", "It was good interacting with my sisters and brothers of Maharashtra during programmes at Yavatmal and Dhule. \n\nHere are some glimpses.", "Improving irrigation and connectivity in Maharashtra.", "Enhancing education, housing and financial inclusion for the poor.", "We salute you, brave sons of Mother India. \n\nYou lived for the nation and served the country with unparalleled valour. \n\nWe stand in solidarity with the bereaved families.", "A grateful nation bows to the martyrs of Pulwama. \n\nA befitting reply will be given to the perpetrators of the heinous attack and their patrons. \n\nNo force will succeed in disturbing peace, progress and stability of India.", "India gets the first Semi High Speed Train, 'Vande Bharat Express.'", "Spoke to Home Minister Rajnath Singh Ji and other top officials regarding the situation in the wake of the attack in Pulwama.", "Attack on CRPF personnel in Pulwama is despicable. I strongly condemn this dastardly attack. The sacrifices of our brave security personnel shall not go in vain. The entire nation stands shoulder to shoulder with the families of the brave martyrs. May the injured recover quickly.", "Greetings to @SushmaSwaraj Ji on her birthday. Sushma Ji is one of the most remarkable leaders of our nation. She has distinguished herself as an outstanding Minister and her oratory is par excellence. Her role in strengthening BJP is key. Praying for her long and healthy life.", "Productivity of the 16th Lok Sabha is exceptionally high, with the average being over 85%. The House took landmark decisions in the interest of the poor, farmers, youth and in eliminating corruption. These will have a transformative impact on India’s growth in the years to come.", "Earlier today, spoke at the last sitting of the 16th Lok Sabha. \n\nI congratulate all my fellow Lok Sabha MPs who enriched the proceedings with their insights. \n\nI also congratulate Speaker Sumitra Mahajan Ji for her outstanding efforts as the Speaker of the House. @S_MahajanLS", "Addressing the #CREDAIYouthCon2019. Watch.", "Speaking in the Lok Sabha. Watch.", "I wholeheartedly support the #DrugFreeIndia movement organised by @SriSri Ji and his team. Their efforts will spread great awareness on the menace of substance abuse. Efforts like these reflect the collective will of our society towards a better and healthier future. @ArtofLiving", "In Kurukshetra today, I had the opportunity to see glimpses of some of the toilets that have been painted. \n\nI was impressed, both by the dexterity of the artists and the passion towards cleanliness. \n\nSuch awareness and efforts add valuable strength to the Swachh Bharat Mission.", "You’ve heard of many competitions but we’ve been having a unique one called the Swachh Sundar Shauchalaya, where toilets are to be painted. This fusion of art with cleanliness is commendable. In January, almost 1.3 crore toilets were painted. Well done to all those who took part!", "I am really happy to see @BJP4India leaders and Karyakartas strengthen the #MeraParivarBhajapaParivar movement across India. \n\nIt is wonderful to see the BJP endearing itself to all sections of society and being at the forefront of raising issues of public welfare.", "On the way to Kurukshetra, captured a picture of the sacred Brahma Sarovar. \n\nNext time you are travelling to Haryana, do make it a point to see this iconic place and the other tourist places in the state. #IncredibleIndia", "जो भ्रष्ट है, उसको मोदी से कष्ट है!", "A commitment towards the development of Haryana, including better healthcare and education opportunities.", "Increased maternity leave.\n\nFulfilling entreprenurial dreams through Mudra Yojana.\n\nFocus on maternal health. \n\nThe efforts of the NDA Government are contributing towards empowerment of women.", "The Swachh Shakti- 2019 in Haryana’s Kurukshetra was a wonderful occasion to honour the outstanding people who are making the Swachh Bharat Movement stronger at the grassroots level. \n\nIn Kurukshetra, also inaugurated and laid foundation stones for various development works.", "This morning, Atal Ji’s portrait at Parliament’s Central Hall was unveiled by Rashtrapati Ji.\n\nIndia is proud of Atal Ji’s landmark contribution to the nation. His leadership took India to newer heights of progress. @rashtrapatibhvn", "Addressing a programme in the historic land of Kurukshetra in Haryana. Watch.", "A tribute to Atal Ji. His portrait has been unveiled at Central Hall.", "3 billion meals is a remarkable feat!\n\nHappy to have joined the programme organised by the Akshaya Patra Foundation and interact with these wonderful youngsters.", "अक्षय पात्र फाउंडेशन के प्रयास, ‘मैं से हम’ तक की यात्रा का सबसे अच्छा उदाहरण है।", "Know more about some of the major reforms in the oil and gas sector in India during the last four years.", "Prioritising energy justice.", "India has taken the lead when it comes to ensuring equality in energy access. \n\nWe are also hopeful that the problems of energy availability globally will be suitably addressed.", "Had the honour of serving food to children in Vrindavan today.", "3 billion meals and a commitment to serve society! At the Akshaya Patra Foundation programme.", "Towards a vibrant oil and energy sector. Addressing @Petrotech2019.", "Deen Dayal Ji emphasised on honesty in public life. Today on his Punya Tithi, BJP is starting a movement #SamarpanDivas to further transparency and clean money in politics. Urging you all to donate to the Party. The NaMo App is an easy way to do so. I too made my contribution.", "Remembering Pandit Deen Dayal Upadhyaya Ji on his Punya Tithi. His emphasis on ‘Integral Humanism’ inspires millions of people. He was known as an exceptional organiser who mentored several patriotic and hardworking Karyakartas. His was a life devoted to nation building.", "I will be in Vrindavan today for a unique programme- to mark the serving of the 3rd billionth meal by the Akshaya Patra Foundation. \n\nCongratulations to all those associated with this mission. Their efforts towards eradicating hunger are exemplary.", "Today, will inaugurate @Petrotech2019 and address the inaugural session of the conference.  #PETROTECH2019 brings together leading stakeholders of the oil and gas sectors. This conference will enhance investments in India in the oil and energy sectors. http://www.pmindia.gov.in/en/news_updates/pm-to-inaugurate-petrotech-2019-on-february-11-2019/?comment=disable …", "Thank you Hubballi for the enthusiasm today! @BJP4Karnataka", "Karnataka offers the best trailer of a 'Maha Milawat' government. \n\nOpportunist alliance. \n\nDecisions taken by a few.\n\nConstant bickering over portfolios. \n\nInternal fights. \n\nA helpless CM who becomes a punching bag for all coalition partners. \n\nSuch a Government is disastrous.", "The people of India trust BJP. \n\nOur track record shows we can eliminate corruption and end the culture of middlemen roaming the corridors of power.", "Good to see the vibrant conversations, insightful facts, stories and videos around how cities are transforming. Do check out #MODIfiedCities & also share your observations.", "Overwhelmed by the strong support in Hubballi. Speaking at a rally. Watch.", "There’s no place for adulteration in a healthy society as ours. \n\nThe people are going to reject the ‘Maha Milawat’ taking shape among the Opposition parties.", "There is a 'family pack' for bail and no prizes to guess who are the beneficiaries of this pack.", "Never forget how arrogant Congress ministers insulted the middle class. In all their years in power they didn’t do anything for the middle class. \n\nIn our 55 months, the NDA has focused on ‘Ease of Living’ for the middle class.", "Here a deal, there a deal, everywhere a deal...this is how Congress views defence sector. Always wanting to make money. \n\nFor us, what matters is a strong India and the welfare of those who serve the nation.", "Wonderful to be in Tiruppur, Tamil Nadu. Watch my speech at the massive rally.", "The BJP has served, is serving and always will serve the people of Andhra Pradesh. \n\nIn the last four and a half years, whatever had to be done to ensure justice for my sisters and brothers of Andhra Pradesh, we have done. \n\nWe stand with Andra Pradesh and its great people.", "One must admire Chandrababu Naidu Garu’s honesty. \n\nHe says he is a wealth creator! \n\nHe’s obviously creating lots of wealth for him and his son while AP suffers. \n\nWe are patriotic Indians...we are only thinking about the nation. Creating wealth is never on our minds.", "I thank the TDP cadre and their leader for wishing what every patriotic Indian also wishes- that Modi goes back to Delhi and once again becomes the Prime Minister! I guess they have read the writing on the wall!", "My ‘senior’ in politics, Shri Chandrababu Naidu obviously has lots to hide. Else why won’t he give an account of what his miserable Government has done for Andhra Pradesh. \n\nCentre has left no stone unturned for the state’s progress but the priorities of the TDP are different.", "From fighting the Dushta Congress under the formidable NTR Garu to becoming a Dost of Congress, the TDP has come a long way. \n\nAndhra Pradesh has seen the TDP’s true colours.", "Chandrababu Naidu Garu keeps saying he is senior to Modi, he is senior to Modi. \n\nOf course he is...\n\nKnow how!", "Speaking to my sisters and brothers of Andhra Pradesh. Watch the rally in Guntur.", "I would be visiting three states today. \n\nShall be addressing rallies in Guntur (Andhra Pradesh), Tiruppur (Tamil Nadu) and Hubballi (Karnataka).\n\nYou can watch the programmes on the NaMo App.", "नव उमंग, नई ऊर्जा एवं नव स्फूर्ति के प्रतीक-पर्व बसंत पंचमी की सभी देशवासियों को ढेर सारी शुभकामनाएं। मेरी कामना है कि विद्या की देवी मां सरस्वती सबको ज्ञान एवं सद्‌बुद्धि प्रदान करें।", "The BJP Government in Tripura is focussing on the education sector. \n\nDuring the Communist misrule, Government jobs were given on the basis of party loyalty. Now there is a culture of merit and transparency.", "In less than a year, the BJP Government in Tripura has brought major changes in the state. There is pro-people governance and a hard crackdown on corruption.", "Honoured to have unveiled a statue of the great Maharaja Bir Bikram Kishore Manikya Bahadur at the airport in Agartala.", "The strong bond between Assam and the BJP can be seen at the rally at Amingaon today. \n\nThe Centre and Assam Government are taking numerous steps for the progress of the state. \n\nThe recent Budget of the Assam Government will have a transformative impact too. @BJP4Assam", "During Congress rule, the headlines from the Northeast indicated sheer neglect and apathy. The headlines now reflect positivity and development. \n\nCongress has zero respect for Assam’s culture. They had no will to implement important parts of the Assam Accord.", "Spoke to my sisters and brothers of Assam on aspects of the Citizenship (Amendment) Bill and also assured them that the interests of Assam and other parts of the Northeast will always be protected.", "The BJP is committed to preserving the culture and ethos of Assam.", "When it comes to Bharat Ratnas, those who ruled the nation for 55 years had a fixed approach- the award for some was reserved the moment they were born while others were ignored. \n\nAtal Ji’s Government and the present NDA Government honoured two greats from Assam.", "Hello Agartala! Delighted to address a massive programme in this city.", "One of the prime considerations behind the impetus towards Arunachal Pradesh’s all-round development is to make the state an even bigger hub for tourism. \n\nMore people from India and across the world should come to Arunachal! \n\nTourism also boosts the local economy.", "55 years of one party and 55 months of BJP... in all spheres of Arunachal Pradesh’s development, our work has been quicker and all-inclusive. \n\nThe Congress ignored the youth of the state and their apathy towards the Jawans guarding our nation is anyway well known.", "Efforts are on, for not one, but two airports in Arunachal Pradesh!\n\nSuch focus on connectivity and affordable aviation is unheard of in Arunachal Pradesh’s history!", "Arunachal Pradesh...\n\nA land associated with the rising Sun, brightness and a land that is home to courageous and warm-hearted people. \n\nHappy to have been in Itanagar. Several projects were initiated that will transform lives of the people of the state.", "I bow to Assam’s great culture. Addressing a rally in Amingaon. Watch.", "Boosting the development of Arunachal Pradesh. Watch the programme in Itanagar.", "Yesterday, had requested you all to share pictures of your visits to the Northeast on Instagram using #MagnificentNortheast. \n\nI shared some of the pictures in a Story on my page. Do have a look! \n\nhttps://www.instagram.com/narendramodi/?hl=en …", "Looking forward being among the sisters and brothers of Arunachal Pradesh, Assam and Tripura today.", "Pictures from the rally in Jalpaiguri. @BJP4Bengal", "In TMC rule the following are welcome: \n\nIllegal infiltrators. \n\nChit fund looters. \n\nLeaders who face corruption charges. \n\nBut, those believing in democracy are not welcome.\n\nWhat TMC is doing is not the culture of West Bengal. They are trying to destroy the state’s culture.", "Have you ever seen a sitting CM doing Dharnas to defend those who looted the people in Chit Funds?\n\nWell, it happened in West Bengal. It is deeply unfortunate.", "If we thought the Communists were bad, meet Communism Part 2- the TMC!\n\nDidi is CM but someone else’s Dadagiri goes on in West Bengal.\n\nDidi is in such a hurry to go to Delhi that she has left the state in the hands of middlemen and a syndicate.", "North Bengal and I, both have a deep association with tea.\n\nBut, Didi dislikes both the tea sector and the tea-seller.\n\nNo wonder she is not working for the development of North Bengal!", "कांग्रेस ने छत्तीसगढ़ में सरकार बनाते ही जो काम किए, उनमें से एक है, राज्य को आयुष्मान भारत योजना से अलग करना। \n\nउनके लिए राजनीति, राज्य की जनता के स्वास्थ्य से भी ऊपर है।", "Congress style of politics- every ten years promise a waiver that is poorly conceived and benefits only a handful of farmers. \n\nIn Chhattisgarh Congress came to power promising waivers too but it’s been two months and the benefits have not reached the farmers. \n\nShame.", "Pictures from the public meeting in Raigarh.\n\nPeople of Chhattisgarh are already disappointed with the Congress government in the state. \n\nI talked about the steps taken by the Centre for the welfare of the farmers, middle class and unorganised sector. @BJP4CGState", "Come to Jalpaiguri and see the support for BJP! Speaking at a huge rally.", "Speaking to my sisters and brothers of Chhattisgarh. Watch the rally in Raigarh.", "The beauty of the Northeast is spectacular. \n\nDo you have pictures of your own Northeast visits or glimpses of the spectacular natural beauty of the region? \n\nShare them on Instagram using #MagnificentNortheast. I will share some of the posts on my page too!", "In the afternoon, I will address a public meeting in Mainaguri. \n\nDuring my recent visits to West Bengal, I have been seeing the massive support for BJP. \n\nThe people of West Bengal realise that only BJP can fulfil their dreams and aspirations. @BJP4Bengal", "Various development projects will be initiated in Jalpaiguri today. \n\nThese will greatly benefit the people of West Bengal. \n\nhttp://www.pmindia.gov.in/en/news_updates/pm-to-visit-jalpaiguri-west-bengal-tomorrow/?comment=disable …", "The first programme will be a public meeting in Chhattisgarh’s Raigarh. \n\nI would be sharing my thoughts on a wide range of subjects during the programme. You can watch the speech on the NaMo App. @BJP4CGState", "Today and tomorrow, I will be joining programmes in Chhattisgarh, West Bengal, Assam, Arunachal Pradesh and Tripura. \n\nLooking forward to interacting with the people of these states.", "देश ने एनडीए की मजबूत सरकार देखी और देश ने उनकी मजबूर एवं मिलावटी सरकार देखी।\n\nअब ये लोग महामिलावटी सरकार की बात कर रहे हैं।\n\nभारत जैसे देश में महामिलावटी सरकार बिल्कुल नहीं चलेगी।", "History, Congress style:\n\nBC- Before Congress…the era where nothing happened.\n\nAD- After dynasty…the era where everything happened and that too thanks to one family. \n\nThis is reflective of the arrogance that got them from 400 to 44!", "किसान कल्याण के लिए प्रतिबद्ध एनडीए सरकार...", "Congress imposed Emergency.\nCongress insults the Armed Forces.\nCongress goes on foreign soil and spreads lies about democratic processes.\nCongress misuses Article 356.\n\nYet, they say Modi destroys institutions. \nHow much do they lie?", "NDA’s efforts- strengthen national security. \n\nUPA’s efforts- weaken national security. \nOn whose bidding are they opposing important defence deals?\nWhy have they always looted the defence sector?", "More opportunities for education.\n\nBetter healthcare.\n\nControlling the menace of rising prices.\n\nOurs is a Government committed to ensuring a better quality of life for the middle class.", "Here are some important details about the opportunities being created for India's Yuva Shakti.", "Speaking in the Lok Sabha. Watch.", "Anguished by the passing away of Lok Sabha MP from Aska, Odisha, Shri Ladu Kishore Swain Ji. He will be remembered for his rich service to society. His work towards rural development was noteworthy. Spoke to his son Nachiketa and expressed condolences.", "NDA Government is honoured to have undertaken numerous steps for the wellbeing of the middle class. From a friendlier tax system to better healthcare, quality education to more opportunities, no stone is being left unturned to ensure ‘Ease of Living.' #MiddleClassWithModi", "India is home to a dynamic middle class, which is making an outstanding contribution to the nation’s progress. The work ethic of the middle class is admirable and so is their honesty and compassion.", "Today, on #WorldCancerDay we reiterate our commitment towards ensuring early detection and affordable treatment of cancer. Initiatives like Ayushman Bharat have a strong emphasis on providing quality healthcare and ensuring cancer-free lives.", "Congratulated @DrKrishanMiddha Ji for the remarkable win in Jind. \n\nOver the years, the people of Haryana have been continuously supporting BJP’s agenda of pro-people, inclusive and corruption-free development. @BJP4Haryana", "I salute all those who are valiantly fighting cancer. Millions are inspired by their remarkable zeal.\n\nI also appreciate those researching on aspects of cancer treatment. Their efforts will go a long way in ensuring a healthier planet. #WorldCancerDay", "The iconic Dal Lake is mesmerising! \n\nHad the opportunity to visit the lake during my visit to Srinagar.", "Had the wonderful opportunity of interacting with Sarpanchs from across Jammu and Kashmir. \n\nI admire these remarkable men and women, who have shown great courage and are working to transform lives.", "The NDA Government has made sincere efforts to enhance the prosperity of farmers.\n\nAll the Congress could do for years is to think about poorly conceived loan waivers!\n\nWhen the PM Kisan Samman Nidhi was announced, the Opposition was stunned.", "People from all walks of life came to bless the BJP during the rally in Jammu. Here are some glimpses. @BJP4JnK", "Youth of Jammu and Kashmir want peace and development. \n\nThe ethos of this land is all about harmony and brotherhood.\n\nAny element who disturbs the developent journey of Jammu and Kashmir, spreads violence and hate will be given a strong answer! Terrorism will not be tolerated.", "The Central Government attaches immense priority towards energy, education, healthcare and infrastructure related works in Jammu and Kashmir.", "The last few months have witnessed an increase in the pace of development in Jammu and Kashmir. \n\nProjects that were pending for years are being completed and this is helping the people of the state.", "In Leh, talked at length about an important decision of the Government that will have a positive impact on the lives of the SC and ST communities.", "The beauty of Leh, Ladakh draws people from all over the world. \n\nToday, I had the opportunity to visit this vibrant part of India and interact with its wonderful people. \n\nThe freezing temperature was inversely proportional to the people’s warmth!", "Interacting with students from across the country from Srinagar. Join us!", "BJP and Jammu have a strong bond. Addressing a rally. Watch.", "Every section of society has been empowered, every aspect of the nation has been strengthened by the Modi government over the past five years. Out of all the amazing work, what are the five things this government will be most remembered for? Let us know. #BharatKeMannKiBaat", "Participative democracy is an article of faith for our party. We have always worked to be an effective voice for rights and well-being of each and every Indian and to build a strong and prosperous India.\n#BharatKeMannKiBaat", "Your voice is of utmost importance. \n\nUrging you all to take part in 'Bharat ke Mann ki Baat, Modi ke Saath’, a unique effort by @BJP4India to get citizen feedback.\n\nWhat you all share will form the blueprint of our ‘Sankalp Patra’ for the 2019 elections. https://bharatkemannkibaat.com ", "Delighted to be in Leh. Addressing a public meeting.", "Deeply anguished by the loss of lives due to the derailment of coaches of the Seemanchal Express. My thoughts are with the bereaved families. May the injured recover quickly. Railways, NDRF, and local authorities are providing all possible assistance in the wake of the accident.", "Even a large stadium was too small for the sisters and brothers who joined us in Durgapur.\n\nThank you, your blessings are appreciated and give me strength in the fight against corrupt and criminal elements ruining West Bengal.", "My battle against corruption has ruffled many feathers, including TMC.\n\nSo, they all assembled in Kolkata and collectively abused me.\n\nThey got together to save their own families and hide their corruption. \n\nI will not rest till the corrupt are punished.", "In West Bengal:\n\nIf one wants to study- Triple T.\n\nIf one wants a job- Triple T.\n\nIf one want to lead a life of peace and dignity- Triple T.\n\nTMC’s syndicates are looting and harassing the state. \n\nBut, their days in power are numbered, I assure you.", "Her own party’s health is failing, support is dwindling so Didi decides to disassociate West Bengal from Ayushman Bharat!\n\nWhy has compassion for the poor become a rarity in TMC?", "Ours is a Government that cares for each and every Indian.\n\nFor decades, those associated with the unorganised sector were left to their own fate. Not any longer!", "Through poorly conceived loan waiver schemes, parties that ruled India for decades kept farmers under poverty. Most farmers never even benefitted from those so called waivers.\n\nNDA’s approach to prosperity of farmers is more inclusive, empowering and long term.", "The #BudgetForNewIndia, which was presented yesterday has a clearly defined approach to enhance ‘Ease of Living’ for the hardworking middle class.", "Eastern India is at the core of our development agenda but projects in West Bengal either do not start on time or their speed is slow.\n\nDo you know why? Because TMC refuses to work on any project where their syndicate cannot make money!", "The people of West Bengal are peace loving but the temperament of the Left and TMC is different. They thrive on violence and intimidation. \n\nI want to tell them- the people of the state will not be intimidated. \n\nAnd, the people will show their might by rejecting the TMC!", "I bow to the people of Thakurnagar. \n\nThese pictures indicate the enthusiasm towards BJP. \n\nThe people of West Bengal are speaking loud and clear- they want Parivartan, they want BJP. @BJP4Bengal", "West Bengal and BJP have a strong bond! Speaking in Durgapur. Watch.", "Amazing response at the rally in Thakurnagar. Watch.", "At a programme in Durgapur, the rail electrification of Andal-Sainthia-Pakur-Malda and Khana-Sainthia Sections, and the Hijli-Narayangarh third line will be dedicated to the nation.\n\nThese works will strengthen the transport sector in the East and Northeast.", "Tomorrow, I look forward to being among my sisters and brothers of West Bengal. I will be addressing @BJP4Bengal rallies in Thakurnagar and Durgapur.", "This is a #BudgetForNewIndia and for all Indians. Watch my take.", "In his address to Parliament today, Rashtrapati Ji highlighted the transformative changes that have taken place and presented a coherent roadmap for the times to come. @rashtrapatibhvn\nhttps://presidentofindia.nic.in/speeches-detail-hi.htm?645 …", "I thank the people of Jind for blessing @BJP4Haryana. This is a seat where the Party has never won before. Glad to see the development agenda of BJP finding support among all sections of society. I congratulate the Haryana BJP and CM @mlkhattar for assiduously serving the people.", "Euphoric New India Youth Conclave in Surat. Watch the interaction.", "I will be interacting with youth and professionals in a town-hall programme at the New India Youth Conclave in Surat shortly. You can watch live on the NaMo App.", "Venus Hospital will cater to Surat’s healthcare needs. I congratulate all those who worked towards the establishment of such a fine hospital. Inaugurated the hospital today.", "The NDA Government has transformed the housing sector and the beneficiaries are the poor and middle class. \n\nBe it urban or rural housing, our track record is exemplary. The numbers are more, the houses are bigger and the era of middlemen is over!", "More airports, bigger airports, better connectivity, affordable prices…know how the NDA Government is transforming the aviation sector.\n\nA vibrant aviation sector augurs well for India’s development.", "Surat personifies hardwork and enterprise. It is also a city that has always respected Bapu’s ideals. \n\nThe foundation stone laying and inauguration for many projects took place, including for a bigger airport. These projects will enhance ‘Ease of Living.’", "Paid tributes to venerable Bapu at Rajghat.", "In Dandi, a unique tribute to Bapu and brave Satyagrahis.", "Inaugurating the state-of-the-art Venus Hospital in Surat. Watch.", "Surat Airport to be expanded, leading to enhanced connectivity and prosperity. Watch.", "Best wishes to my colleague Shri @PrakashJavdekar Ji on his birthday. Praying for his long and healthy life.", "We salute all the martyrs who laid down their lives for India. The country remains eternally grateful to them for their service and sacrifice.", "पूज्य बापू को उनकी पुण्यतिथि पर शत् शत् नमन।\n\nRemembering Bapu on his Punya Tithi. We reiterate our commitment to follow the path shown by him and abide by the values he stood for.", "Tomorrow, on Bapu’s Punya Tithi, I will be in Dandi, the place from where Bapu challenged the might of colonialism.\n\nIn Dandi, the National Salt Satyagraha Memorial will be dedicated to the nation. This is a tribute to Satyagrahis led by Gandhi Ji, who worked for India’s freedom.", "Tomorrow evening in Surat, I will join the New India Youth Conclave. This is a wonderful forum, bringing together youngsters and people from all sections of society. I look forward to a wonderful interaction!", "In Surat, the Smt. Rasilaben Sevantilal Shah Venus Hospital will be inaugurated. This hospital will provide quality healthcare to citizens and strengthen the efforts to build a healthy India.", "I will be visiting Gujarat tomorrow to attend a wide range of programmes. \n\nIn Surat, the foundation stone for extending the terminal building at Surat Airport will be laid. This will improve connectivity and economic growth in Surat and surrounding areas.", "Glimpses from ‘Beating the Retreat’ ceremony.", "Depression and poor mental health are a cause of worry.\n\nHowever, aspects relating to these can get solved. \n\nWatch out for early signs, discuss, support and if necessary, do not hesitate to visit a counsellor. \n\nWe will always support our young friends!", "Interesting questions by students from AMU and BHU on exams, subject choices and selecting careers.", "Youngsters asked me- should our goals be small or big. \n\nHere’s what we discussed.", "A common worry among parents- children spend too much time playing computer games... \n\nYoung friends, enjoy the PlayStation but always remember the playground too!", "The report card of a child cannot become the visiting card of his or her parents. \n\nEvery child is blessed with unique talents and deserves the right support to pursue them.", "I thank people from all walks of life, particularly student friends, parents and teachers for joining today’s Pariksha Pe Charcha 2.0 in large numbers. \n\nHere are some glimpses.", "Join the Pariksha Pe Charcha 2.0 Town Hall! Delighted to be among our Yuva Shakti.", "During his long years in public life, George Sahab never deviated from his political ideology. He resisted the Emergency tooth and nail. His simplicity and humility were noteworthy. My thoughts are with his family, friends and lakhs of people grieving. May his soul rest in peace.", "When we think of Mr. George Fernandes, we remember most notably the fiery trade union leader who fought for justice, the leader who could humble the mightiest of politicians at the hustings, a visionary Railway Minister and a great Defence Minister who made India safe and strong.", "George Sahab represented the best of India’s political leadership. \n\nFrank and fearless, forthright and farsighted, he made a valuable contribution to our country. He was among the most effective voices for the rights of the poor and marginalised. \n\nSaddened by his passing away.", "The @BJP4India is fully committed towards the development and prosperity of Assam. \n\nWe will always protect the interests of the state. \n\nSeveral initiatives of the Central and Assam Government have contributed towards transforming lives of the citizens of Assam. @BJP4Assam", "Gratitude to my sisters and brothers of Assam for the strong support to @BJP4Assam in polls to three Tribal Autonomous Councils in the state. \n\nI appreciate the local unit of the Party for their constant efforts to serve the people of the state.", "During my visit to Madurai yesterday, I had the honour of meeting a remarkable woman entrepreneur, Arulmozhi Saravanan. \n\nThe Mudra Yojana brought a qualitative change in her life and she even sold products to the PMO!", "Giri, your father is looking very good!", "हमारी सेना ने ये स्पष्ट संदेश दिया है कि हम छेड़ते नहीं हैं, लेकिन किसी ने छेड़ा तो फिर छोड़ते भी नहीं हैं!", "Rajeev, I hope this brings more guests to the restaurant too! :)", "NDA Government is committed towards fulfilling the aspirations of the people of Tamil Nadu through a wide range of development projects.", "The people of Madurai welcomed me with great enthusiasm. \n\nIt is my privilege that I have got the opportunity to work for the development of Tamil Nadu.", "We have heard of many types of contests but a contest to beautify toilets is remarkable and an innovative way to strengthen the Swachh Bharat Mission.", "Please convey my regards to Chandrakanth Ji. I am deeply touched by his gesture.", "Thank you! \n\n#MannKiBaat showcases the extraordinary aspects of India's past, present and future. I am merely a medium...it is the voice of 130 crore Indians.", "Seeing the brilliant youngsters of the NCC reaffirms my belief that India's future is bright thanks to our talented Yuva Shakti.", "Sharing some pictures from the NCC Rally in Delhi today. \n\nI congratulate all those associated with the NCC family and wish them the very best for their future endeavours.", "Thanks to the power of technology, Pariksha Pe Charcha Townhall Programme can be seen in several schools and colleges across India. \n\nThis is an excellent opportunity to show solidarity with our hardworking and talented students who are preparing for exams.", "Dear students, parents and teachers,\n\nTomorrow at 11 AM, we will be discussing stress free examinations during the Pariksha Pe Charcha 2.0 Townhall Programme. \n\nLooking forward to your presence!", "Happy to see this. \n\nThese mementos I got during various programmes showcase the best of India’s diversity and artistic skills.\nFor years, the mementos I receive have been auctioned.\n\nThe proceeds of these mementoes will go towards Namami Gange. Know more.", "Saluting India's Yuva Shakti. Addressing the NCC rally. Watch.", "Glimpses from the public meeting at Thrissur. @BJP4Keralam", "Thank you for the phenomenal support Madurai! @BJP4TamilNadu", "To settle personal scores, leaders of the Kerala Congress played with India’s strategic interests. \n\nCan such a Party ever think about the welfare of 130 crore Indians?", "Elections will come and go, the nation will remain.", "The Opposition is bankrupt when it comes to a positive agenda for India’s development.\n\nTheir respect for institutions is minimal.\n\nCongress leaders are also going abroad to insult people’s mandates.\n\n130 crore Indians are seeing everything! They will punish such forces.", "Our endeavour is to make India a hub for the petrochemicals sector. \n\n‘Make in India’ offers many opportunities in this regard.", "Today, various projects were initiated at the Kochi Refinery. \n\nThese will go a long way in strengthening the petroleum and energy sector in India.", "Ensuring social justice and inclusive growth for all sections of society.", "As far as Tamil Nadu is concerned, the NDA Government is working to make the state a hub for defence and aerospace sectors.\n\nThe State is also at the core of our vision of port-led development.", "Delighted to be in the ancient city of Madurai, which has a central place in the history and culture of Tamil Nadu. \n\nLaid the foundation stone for various projects relating to the health sector, including AIIMS. \n\nThese projects will benefit the people of Tamil Nadu.", "Come to Thrissur and see the enthusiasm towards BJP! Addressing a massive rally.", "Tamil Nadu supports BJP! Watch the rally at Madurai.", "2019's first #MannKiBaat. Tune in.", "Best wishes to Meghalaya’s dynamic CM, Mr. @SangmaConrad on his birthday. He is energetically serving the people of the state. May Almighty bless him with a long and healthy life.", "Tune in at 11 AM today. #MannKiBaat", "Dear Exam Warriors, \n\nPeople across India are standing shoulder to shoulder with you as you prepare for the exams.\n\nLooking forward to seeing you all at a Pariksha Pe Charcha 2.0 Town Hall programme on the 29th! I hope you are sending your thoughts and ideas for the same as well.", "छोटा भीम का बड़ा समर्थन! \n\nThank you Chhota Bheem, for strengthening the team that is fulfilling the dream of a Swachh Bharat.\n\nThis valuable support will surely motivate more youngsters to join the movement.", "I had a great interaction with @YourStoryCo on aspects relating to startups, innovation, entrepreneurship, MSME sector and more. Have a look.", "The colours of India…\n\nHave a look at the cultural diversity of our country shown at the #RepublicDay2019 celebrations.", "India’s military and security prowess at Rajpath.\n\nOurs is a land of peace, which has shown the way when it comes to harmony and brotherhood. At the same time, we are fully prepared to give a strong answer to those elements who disturb the atmosphere of peace and spread violence.", "Our vibrant Republic! \n\nHere are some glimpses from the #RepublicDay2019 celebrations at Rajpath.", "At Amar Jawan Jyoti, a grateful nation pays homage to the brave soldiers who sacrificed their own lives for the nation. \n\nWe salute their courage and patriotism.", "Happy Republic Day to all fellow Indians. \n\nसभी देशवासियों को #गणतंत्रदिवस की शुभकामनाएं।\n\nजय हिन्द!", "Congratulations to all those who have been conferred the Padma Awards. \n\nIndia is proud of each and every awardee, for the rich contributions towards various fields. \n\nThey have made our nation and the world a better place! https://mha.gov.in/sites/default/files/Padma_Awards_2019.pdf …", "Pranab Da is an outstanding statesman of our times. \n\nHe has served the nation selflessly and tirelessly for decades, leaving a strong imprint on the nation's growth trajectory. \n\nHis wisdom and intellect have few parallels. Delighted that he has been conferred the Bharat Ratna.", "The songs and music of Shri Bhupen Hazarika are admired by people across generations. From them radiates the message of justice, harmony and brotherhood. \n\nHe popularised India's musical traditions globally. \n\nHappy that the Bharat Ratna has been conferred on Bhupen Da.", "Nanaji Deshmukh's stellar contribution towards rural development showed the way for a new paradigm of empowering those living in our villages. \n\nHe personifies humility, compassion and service to the downtrodden. He is a Bharat Ratna in the truest sense!", "Heard the insightful views of President @CyrilRamaphosa at the Gandhi-Mandela Memorial Freedom Lecture in New Delhi.", "Cooperation in areas such as agriculture, food processing, skill development, IT, gems and jewellery augurs well for the partnership between India and South Africa. \n\nPresident @CyrilRamaphosa and I also talked about steps to boost people-to-people ties.", "India and South Africa are shaped by the ideals of the great Mahatma Gandhi and the venerable Madiba. \n\nGuided by their thoughts, we are committed towards ensuring peace and prosperity for the people of our nations as well as deepening cooperation in various sectors.", "India is honoured to welcome President @CyrilRamaphosa. \n\nHe is visiting us at a special time, when we are marking Bapu's 150th birth anniversary and have marked the birth centenary of beloved Madiba. \n\nThis visit will have a positive impact on India-South Africa relations.", "Addressing the India-South Africa Business Forum. Watch.", "हर वोट की अहमियत है, हर वोट खास है, \n\nवोट सिर्फ ठप्पा नहीं, हमारी आवाज है।\n\nतो देश के प्यारे युवाओं, अपना पहला वोट बनाओ यादगार,\n\nआज सब मिलकर लें संकल्प...अबकी बार, फिर मोदी सरकार। #YouthWithModi", "Best wishes to the people of Himachal Pradesh on their Statehood Day. May this state, the land of natural beauty and bravery, attain even more prosperity in the years to come. I pray that the people of this state are blessed with joy and good health.", "I urge people from all walks of life to create awareness on voter registration and especially request my young friends to register themselves as voters if they have not done so already. Every vote cast enhances our democratic fabric.", "Greetings on #NationalVotersDay. This is a day to reaffirm our commitment towards further strengthening our democracy by unfailingly participating in democratic processes at the local, state and national levels. Your doing so will go a long way in building a New India.", "With this launch, India also becomes the first country to use the fourth stage of a space rocket as an orbital platform for micro-gravity experiments. @isro", "Heartiest congratulations to our space scientists for yet another successful launch of PSLV. \n\nThis launch has put in orbit Kalamsat, built by India's talented students.", "Under the leadership of Shri @myogiadityanath Ji and his team, Uttar Pradesh has been achieving remarkable success in several sectors. \n\nThe Centre and UP Government will continue to do everything possible so that the youth of UP can fulfil their aspirations.", "On the special occasion of Uttar Pradesh Diwas I convey my greetings to the people of UP and pray for the continued progress of the state. \n\nThis is a state whose contribution to India’s history is remarkable. People from UP have excelled in all spheres.", "Had an excellent interaction with tableaux artistes, guests from tribal communities, NCC cadets and NSS volunteers at 7, Lok Kalyan Marg today.", "India is phenomenally proud of these young achievers, who have been distinguishing themselves in a wide range of areas. \n\nWishing them the very best for their endeavours ahead. \n\nhttp://www.pmindia.gov.in/en/news_updates/pm-interacts-with-winners-of-rashtriya-bal-puraskar-2019/?comment=disable …", "Honouring a young genius! \n\nRaam M is a versatile music maestro. He is among the youngest Indians to have succeeded with distinction in final (8th) grade examination by Trinity College, London. He has also taken part in many Carnatic Music Concerts.", "Dev Dushyantkumar Joshi has distinguished himself as an actor. His work in TV serials has been admired all over. Happy to have met this winner of the Bal Shakti Puraskar.", "Vinayaka M belongs to Karnataka. He is a versatile artist and has given several stupendous performances. His musical talent has been appreciated nationally and globally.", "Meet Aryaman Agarwal.\n\nHe is a young magician, who presents interesting magic tricks. He has done shows not only for large audiences but also has done many workshops and demonstrations for the underprivileged.", "Truptraj Atul Pandya is a master percussionist He is an established radio and TV artist as well, who has given more than several live performances. Proud that he has been conferred the Bal Shakti Puraskar.", "Meeting and knowing brave Nikhil Jituri was a pleasure. He saved the life of a two-year-old who accidentally fell into a deep open well. Our young friend from Karnataka showed great courage and presence of mind. I congratulate Nikhil on winning the Bal Shakti Puraskar!", "Kartik Kumar Goyal and Adrika Goyal from Madhya Pradesh showed courage and social consciousness in providing food, water, and first aid to panicked train passengers during an adverse situation. I congratulate my brave young friends on winning the Bal Shakti Puraskar!", "Angel Vijay Deokule, from Maharashtra, is an inspiration for young girls. She is an Sqay martial artist and has brought laurels for India globally. Congratulations on winning the Bal Shakti Puraskar and all the best for the upcoming championships!", "Anish, from Haryana, is great at aiming and achieving. He is an international Gold medalist young shooter who won at the Commonwealth Games in Gold Coast. I congratulate young Anish on winning the Bal Shakti Puraskar and wish him great success in the future!", "It was a pleasure meeting young Priyam Tated. From Andhra Pradesh, he is a wonderful exponent of Roller or Figure Skating. He has made India proud by winning several awards on the world stage. Congratulations Priyam on winning the Bal Shakti Puraskar.", "My young friend Esow from Andaman and Nicobar islands has made us proud. He was awarded the Junior World No. 1 at the UCI Junior Track Cycling World Championship in Switzerland. \n\nCongratulations, Esow!", "Young Shivangi from Haryana is scaling the peaks of achievement, literally! \n\nShe is the youngest girl from India to scale Mount Everest from the Nepal side. She has also climbed the highest peaks in Africa and Europe. \n\nI congratulate her on winning the Bal Shakti Puraskar.", "Nishant Dhankhar is an ace mathematician, who has won many accolades internationally. \n\nHis project on Szemerédi's theorem has been internationally acknowledged and appreciated.", "More power to Megha Bose’s scholastic zeal! She distinguished herself at several Olympiads and quizzes. It was wonderful to interact with her and discuss a wide range of issues. Happy that she has been conferred the Bal Shakti Puraskar.", "Odisha's Ayushman Tripathy has won many accolades for his scholastic abilities at the National and International, level including at the International Junior Science Olympiad, 2016 held at Bali, Indonesia. He has represented India in Global Youth Leaders Conference, 2018 in USA.", "Ensuring a healthy India! \n\nMet Dr. Arunalla Sridhar Reddy from Andhra Pradesh, who has conducted free dental check-ups and treatment for thousands of children. He also runs 3 homes to take care of under-privileged children.", "Congratulated the energetic Tashi Namgyal, who has been supporting the education of young children from poor economic backgrounds. He runs 5 schools in Himachal Pradesh through which many children have benefitted.", "Youngsters like Eiha Dixit indicate that the Yuva Shakti of India will do outstanding things. She celebrated her 6th birthday by planting record 1008 saplings! She is extremely passionate about mitigating climate change. Proud that she has been conferred the Bal Shakti Puraskar.", "Through theatre, Prathyaksha B R has been spreading awareness about the importance of toilets in homes. \n\nShe conducted plays in remote villages of Karnataka and inspired people to construct toilets in their home. \n\nHappy that she has got the Bal Shakti Puraskar.", "Meet Aryamaan Lakhotia from West Bengal. \n\nHe founded ‘Toy Joy’ with the aim of collecting and distributing toys to the underprivileged children in Kolkata. \n\nThe organisation has spread to seven cities and brightened the lives of thousands of children!", "Delhi’s Madhav Lavakare made an affordable wearable assistive device for the hearing impaired called ‘Transcribe.’ \nIt aims to bridge the communication gap between hearing impaired persons and those with hearing ability but not knowing sign language.\nHappy to have met him today.", "Innovative Yuva Shakti! \n\nA U Nachiketh Kumar prepared standard rubber sheets from a fruit named Bilimbi (Averrhoa bilimbi) as a sustainable and environment friendly substitute for rubber latex created from formic acid by farmers. \n\nBest wishes to him for his future endeavours.", "Naisargik Lenka is 16 and at such a young age, he worked on innovative solutions for remediation of contaminated soil and water, a method of treating municipal waste water and a smart toilet model which has been named 'Swachh APT.’ \nA fitting recipient of the Bal Shakti Puraskar!", "Saluting the innovative zeal of young India.\n\nThe projects Aswath Suryanarayanan steered include ‘Magnetically operated Kinetic Car (MAGOKIN)’, and a mathematical model for managing space debris.\n\nCongrats on being conferred the Bal Shakti Puraskar.", "Towering efforts, outstanding outcomes! \nArunima Sen has done great work. She developed a model for energy efficient skyscrapers, solution to increase barley yield & a device determining micronutrient levels in a body using strands of hair. \nGlad she won the Bal Shakti Puraskar.", "My young friend Mohammed Suhail Chinya Salimpasha hails from Karnataka. \n\nHe has been awarded the Bal Shakti Puraskar for his work in using technology to diagnose Pre-symptomatic Protein Energy Malnutrition non-invasively using paper. \n\nCongratulations to him!", "Had a wonderful interaction with winners of Rashtriya Bal Puraskar 2019.", "Having a great interaction with Karyakartas from Maharashtra. Watch.", "I am grateful to the Bose family for presenting me a cap worn by Netaji Bose himself. \n\nThe cap has been immediately added to the display gallery at Kranti Mandir in the Red Fort complex. \n\nI hope more youngsters come to Kranti Mandir and get inspired by the life of Netaji Bose.", "To see Gurudev Tagore’s works at Drishyakala is a treat for art lovers. We all know Gurudev Tagore as a prolific writer but he also had a strong link with the world of art. He produced lots of works, featuring multiple themes. Gurudev’s works were also exhibited internationally.", "Works of eminent Indian artists like Raja Ravi Varma, Gurudev Tagore, Amrita Sher-Gil, Abanindranath Tagore, Nandlal Bose, Gaganendranath Tagore, Sailoz Mookherjea amd Jamini Roy are on display at the exhibition.", "I would specially urge art lovers to visit Drishyakala, which will take you through the finest aspects of Indian art and culture. \n\nThere are 4 historical exhibitions, spanning three centuries, with over 450 works of art!", "Museums on Netaji Bose and Azad Hind Fauj are a key part of Kranti Mandir. History echoes from these walls. In this very building, brave sons of India, Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon and Major General Shah Nawaz Khan were put on trial by the colonial rulers.", "This complex includes Museums on Netaji Subhas Chandra Bose and the Indian National Army, Yaad-e-Jallian Museum (on Jallianwala Bagh and World War 1), Museum on 1857- India’s First War of Independence and Drishyakala- Museum on Indian Art.", "It was extremely humbling to inaugurate four museums relating to India's rich history and culture. \n\nThis entire complex of museums will be known as Kranti Mandir as a tribute to the revolutionary zeal and courage of our great freedom fighters.", "These museums being inaugurated today will deepen the connect between our glorious history and our youth as well as add to the patriotic fervour among citizens.", "I will also inaugurate the Yaad-e-Jallian Museum (on Jallianwala Bagh and World War 1), Museum on 1857- India’s First War of Independence and Drishyakala- Museum on Indian Art at the Red Fort.", "In a short while from now, I will be inaugurating Museums on Netaji Subhas Chandra Bose and the Indian National Army at the iconic Red Fort in Delhi.", "Remembering the courageous Balasaheb Thackeray on his Jayanti. Respected Balasaheb was unwavering in his commitment towards protecting the rights and wellbeing of people. He was bold and was blessed with a sharp intellect and wit. His oratory skills mesmerised lakhs of people.", "I bow to Netaji Subhas Chandra Bose on his Jayanti. \n\nHe was a stalwart who committed himself towards ensuring India is free and leads a life of dignity. We are committed to fulfilling his ideals and creating a strong India.", "My first brush with a big city, organisational duties in the RSS and a yearly 5-day journey to a remote forest during Diwali…\n\nPart 3 of the interaction with @HumansOfBombay takes you through experiences from my youth & a request for today’s youngsters. \n\nhttps://www.instagram.com/p/Bs79RG8hPNc/ ", "Celebrate, do not fear exams.\n\nI am glad that people not only from India but also from overseas are going to be a part of the  Pariksha Pe Charcha 2.0 programme. \n\nKeep sharing your exam experiences on MyGov so that others read and get inspired.", "Inaugurated Centers of Excellence at Deen Dayal Hastkala Sankul. These centres will give a boost to those associated with the textiles and handicrafts sector and contribute to India’s prosperity.", "Made an announcement at the #PBD2019. Know what it is...", "At the peak of his party’s power, a former PM said that for every Rupee, only 15 paisa reaches the poor. Which was the hand that was siphoning off all funds?\n\nNDA Government’s paradigm shift in Governance has ensured the fruits of development reach the intended beneficiaries.", "India is at the forefront of global leadership in various sectors. \n\nOur country is undertaking numerous initiatives to ensure a better tomorrow for the coming generations.", "Addressing the Pravasi Bharatiya Divas programme in Varanasi. Watch.", "Looking forward to being in beloved Kashi today for the Pravasi Bharatiya Divas. This is an excellent forum to engage with the Indian diaspora, which is distinguishing itself all over the world. #PBD2019 @PBDConvention", "I have had the privilege to visit the Sree Siddaganga Mutt and receive the blessings of His Holiness Dr. Sree Sree Sree Sivakumara Swamigalu. \n\nThe wide range of community service initiatives being done there are outstanding and are at an unimaginably large scale.", "HH Dr. Sree Sree Sree Sivakumara Swamigalu remained at the forefront of ensuring better healthcare and education facilities for the marginalised. \n\nHe represents the best of our traditions of compassionate service, spirituality and protecting the rights of the underprivileged.", "His Holiness Dr. Sree Sree Sree Sivakumara Swamigalu lived for the people, especially the poor and vulnerable.  He devoted himself towards alleviating ills like poverty, hunger and social injustice. \n\nPrayers and solidarity with his countless devotees spread all across the world.", "Statehood Day greetings to the people of Tripura. In less than a year, the state has made remarkable progress. It is realising it’s true potential and people’s aspirations are being fulfilled at a record pace. May this spirit grow further in the coming years.", "Manipur is blessed with immense natural beauty and hardworking citizens. I can never forget the affection I have got in the state. \n\nOn their Statehood Day, I greet my sisters and brothers of Manipur. \n\nMay the state continue scaling new heights of development.", "On the special occasion of their Statehood Day, greetings to the people of Meghalaya. \n\nPeople from Meghalaya have made a notable contribution to our country. I pray for the state’s continuous progress.", "Not losers but Rockstars! \n\nNo selfie Jab We Met but there will always be another occasion. :)", "Happy to know! My best wishes.", "Thank you Divya Ji.", "The entire nation admires Jeetendra Ji for his acting. And, as I said yesterday, he is full of energy!", "As far as the issue of mining in Goa is concerned, the Centre, State Government and BJP MPs from the state are looking at all possible ways to solve the matter.\n\nBJP will always safeguard the rights and wellbeing of the poor.", "The NDA government in unwavering in our commitment to social justice. \n\nThose who ruled the nation for years had no vision or roadmap to ensure empowerment for all.", "NDA governments at the Centre and Maharashtra have undertaken record number of initiatives for the farmers. \n\nOn the contrary, Congress and NCP’s notable contribution was irrigation scam and total apathy towards farmers.", "उनके पास धन शक्ति है, हमारे पास जन शक्ति है।\n\nउनको अपना परिवार बचाना है, हमें देश बनाना है।", "This question by a @BJP4Maharashtra Karyakarta reminded me of the days when I worked in the party organisation. \n\nI also spoke about why BJP is different from other parties.", "Interacting with BJP Karyakartas from Maharashtra and Goa. Watch.", "Asha Ji, thank you for gracing the programme with your presence. The entire nation looks up to you for your stupendous contribution to the film world. @ashabhosle", "Yes, I agree with you. @itsBhushanKumar", "Looking happy as always, Manoj Bhai!", "In addition to preservation, I hope this museum emerges as a centre of inspiration, where people get to see the more minute aspects of acting, production, film making and more. \n\nIt will further endear the film world to the people.", "I enjoyed interacting with you and other members of the film fraternity. This community has been at the forefront of showcasing India's culture internationally. @kunalkohli", "When @KapilSharmaK9 appreciates somebody's humour, it sure makes that person happy and I am no exception. :)\n\nThank you for the kind words Kapil.", "Happy to have met you, @arrahman.", "We have several talented youngsters and we also have so many talented film personalities who can mentor these youth. \n\nChannelising this talent through such universities can be extremely beneficial.", "The wonderful city of Mumbai is now home to the excellent National Museum of Indian Cinema. \n\nHere are some pictures.", "They got together in Kolkata with no agenda but to stop BJP.\n\nThey talk of democracy in a state where the ruling party does not even allow local elections democratically. \n\n130 crore Indians are watching their games with great amusement. \n\nIndia will give them a befitting reply!", "Their day begins with Modi, ends with Modi.\n\nAll they want to do is further their own dynasties. \n\nThey have zero vision for India. \n\nOur approach is different. \n\nFor us, India is everything, 130 crore Indians are everything.", "Entire Opposition hates me because my ‘crimes’ are:\n\nWaging the toughest war against corruption.\n\nStopping the reign of middlemen from the corridors of power.\n\nGiving the poor what belongs to them in the first place but was denied for years.", "The progress made by the Union Territories of Dadra and Nagar Haveli, as well as Daman and Diu in the last four years will make you very happy!", "Celebrating cinema. Inaugurating National Museum of Indian Cinema in Mumbai.", "Our only aim is development. We want to work for 130 crore Indians. Speaking in Silvassa. Watch.", "Had the privilege of inaugurating the Larsen and Toubro Armoured Systems Complex in Hazira, Gujarat. \n\nBoosting ‘Make in India’ in the defence sector is our endeavour. I am glad that the private sector too is supporting this pursuit and making a valuable contribution.", "I congratulate the entire team of Larsen & Toubro for building the state-of-the-art K-9 Vajra Self Propelled Howitzer. \n\nThis is a significant contribution towards India’s defence sector and protecting the country.", "Checking out the tanks at L&T’s Armoured Systems Complex in Hazira.", "The first #MannKiBaat of 2019 will take place on the 27th of this month. Share your ideas and suggestions for it. \n\nDial 1800-11-7800 and record your message. You can also share inputs on the MyGov Open Forum or the NaMo App.", "Tomorrow evening, I will be in Mumbai to inaugurate the National Museum of Indian Cinema. \n\nThis museum will showcase the rich history of Indian cinema and highlight the contribution of cinema in our country's progress.", "The laser show at Dandi Kutir is wonderful! \n\nTechnology has merged with history and the show takes the viewers through the life of the great Bapu. \n\nHappy to have inaugurated the show today.", "The m-Arogya App will be launched tomorrow along with door to door waste collection, segregation and processing of solid waste facilities in Dadra and Nagar Haveli.\n\nI would also be addressing a public meeting at Silvassa.", "An IT policy for Dadra and Nagar Haveli will be released tomorrow. I congratulate the local administration for emphasising on the power of technology. \n\nThrough technology, effective service delivery is possible and transparency is furthered.", "Several development projects for Daman and Diu, and Dadra and Nagar Haveli will be launched tomorrow. PM Jan Arogya Yojana certificates and Forest Rights certificates will be distributed to beneficiaries as well. Glad that the Centre's schemes are touching the lives of the poor.", "I am happy to be visiting the Union Territory of Dadra and Nagar Haveli tomorrow. The foundation stone for a medical college in Sayli will be laid. This institution is going to open many opportunities in the healthcare sector. Youngsters from nearby areas will benefit greatly.", "I shall be visiting Hazira tomorrow. I would be dedicating L&T’s Armoured Systems Complex to the nation and also be laying the foundation stone for the Nirali Cancer hospital at Navsari.", "Mr. Andrej Babiš, the Prime Minister of the Czech Republic and I held wide-ranging talks in Gandhinagar. His presence at the Vibrant Gujarat Summit is a great gesture. We discussed bilateral cooperation in defence, transportation and manufacturing.", "Had an excellent meeting with PM @larsloekke of Denmark.\n\nDenmark is a valued friend and we discussed deepening cooperation in energy, trade, agriculture and other areas.", "The champion of chess! \n\nYoung D Gukesh has made the country proud by his accomplishment. His diligence and perseverance are noteworthy!  \n\nCongratulations to him and best wishes for his future endeavours.", "Here is a unique contest that strengthens the Swachh Bharat Mission! \n\nIn two weeks ten lakh rural toilets have already been painted.\n\nShare your Swachh Sundar Shauchalaya using #MyIzzatGhar.", "The Government of India is making every effort to ensure the fruits of development reach every citizen with ease and efficiency.", "New infrastructure for New India.\n\nTransformative measures that are leading to transformative outcomes.", "Doing business in India is easier, cheaper, faster and smarter.", "Those who have been visiting India in the last four years have seen first hand the series of transformations taking place. \n\nWe are reducing government and enhancing governance.", "The Vibrant Gujarat Summit has:\n\nDignity of the presence of top political leaders.\n\nEnergy of CEOs and corporate leaders.\n\nGravitas of institutions and opinion makers.\n\nVitality of young enterprises and start-ups.", "India is honoured to host the President of the Republic of Uzbekistan, Mr. Shavkat Mirziyoyev. \n\nWe had fruitful talks on the sidelines of the Vibrant Gujarat Summit in Gandhinagar. We discussed various aspects relating to India-Uzbekistan ties. @president_uz", "Great meeting with PM @JosephMuscat_JM of Malta. Our talks will add tremendous strength to bilateral ties between our nations and benefit the people of our countries.", "Vibrant Gujarat has emerged as a global forum. Addressing the Summit now. Watch.", "His Holiness Dr. Sree Sree Sree Sivakumara Swamigalu is a remarkable personality and has positively impacted crores of lives through his outstanding service. \n\nThe entire nation is praying for his speedy recovery and good health.", "ಪರಮಪೂಜ್ಯ ಡಾಕ್ಟರ್ ಶ್ರೀ ಶ್ರೀ ಶ್ರೀ ಶಿವಕುಮಾರ ಸ್ವಾಮಿಗಳವರದು ಅಮೋಘ ವ್ಯಕ್ತಿತ್ವ . ಅವರ ಮಹೋನ್ನತ ಸೇವೆ ಕೋಟ್ಯಾಂತರ ಜನರ  ಜೀವನದ ಮೇಲೆ ಸಕಾರಾತ್ಮಕ ಪ್ರಭಾವ ಬೀರಿದೆ. ಶ್ರೀಗಳು ಬೇಗ ಗುಣ ಮುಖರಾಗಲಿ ಎಂದು ಹಾಗೂ ದೇವರು ಅವರಿಗೆ ಉತ್ತಮ ಆರೋಗ್ಯ ಕರುಣಿಸಲೆಂದು ಇಡೀ ರಾಷ್ಟ್ರ ಪ್ರಾರ್ಥಿಸುತ್ತಿದೆ.", "At the Ahmedabad Shopping Festival I too could not resist from shopping! Purchased some Khadi products using the RuPay card.\n\nI urge you all- keep buying Khadi and contribute to the empowerment of lakhs of weavers associated with the industry. It is also a great tribute to Bapu!", "At the inauguration of the Ahmedabad Shopping Festival, I talked at length about the numerous steps taken by the Central Government for the MSME sector. Our small entrepreneurs are exceptionally talented and we are committed to ensuring the right platform for them to prosper.", "Today is a big day for Ahmedabad! \n\nThe city is hosting a first of its kind shopping festival. \n\nThis festival is a great opportunity for entrepreneurs and consumers. It has a wide range of products, a good mix of the traditional and the modern.", "For a long time, access to proper healthcare was considered out of reach for the poor. Ayushman Bharat changed that. \n\nOurs is a Government that cares for the downtrodden and we want to ensure that they lead healthy lives.", "The Sardar Vallabhbhai Patel Institute of Medical Sciences and Research is an excellent public hospital, which will strengthen the efforts to provide quality healthcare to the poor.\n\nAm glad to have inaugurated the hospital and seen parts of it.", "Dr. Vikram Sarabhai was an outstanding scientist, whose contribution to the nation has been extremely rich.\n\nToday in Ahmedabad, a statue of Dr. Sarabhai was inaugurated in the presence of his family.", "Thank you Mr. Bill Gates for your appreciation. \n\nAyushman Bharat stems out of our commitment to provide top quality and affordable healthcare to the poor. \n\nThe first 100 days have been remarkable! Large number of people benefited and lot more will in the coming days. @BillGates", "The Ahmedabad Shopping Festival is amazing! Come visit.", "Inaugurating the Sardar Patel hospital in Ahmedabad. Watch my speech.", "I commend the energetic @BJYM team for their #VijayLaksh2019 movement that will mobilise Yuva Shakti from all over India on a large scale for a strong mandate for the BJP. \nOur Party is fully committed to fulfilling the dreams and aspirations of our talented youngsters. #NaMoYuva", "Individuals like Mr. Yohei Sasakawa motivate millions of people. He is at the forefront of many philanthropic initiatives. \n\nHis compassionate nature can be seen in the manner in which he’s worked to eliminate leprosy. \n\nCongratulations to him for the Gandhi Peace Prize, 2018.", "Education is a strong means to empowerment and Ekal Abhiyan Trust is working in remote areas, so that children from tribal families get the opportunity to study. \n\nTheir role in furthering women empowerment is laudatory. \n\nCongratulations to them for the Gandhi Peace Prize, 2017.", "The Sulabh International family has added immense strength to the Swachh Bharat movement. \n\nThis is a team that is working constantly at the grassroots level to realise Bapu’s dream of a clean India. \n\nI congratulate Sulabh International for the Gandhi Peace Prize, 2016.", "The Akshaya Patra Foundation’s determined efforts ensure nutritious meals for many. \n\nTheir outstanding work has also ensured more children go to school. \n\nI congratulate them for the Gandhi Peace Prize, 2016. @AkshayaPatra", "The Vivekananda Kendra is doing commendable work towards the development of our villages. \n\nTheir initiatives to improve education and community service have touched several lives, particularly youngsters. \n\nI congratulate @vkendra for the Gandhi Peace Prize, 2015.", "The Ahmedabad Shopping Festival will also be inaugurated tomorrow. The Festival offers an exceptional opportunity for local entrepreneurs to showcase their products.", "Tomorrow in Ahmedabad, I will inaugurate the Sardar Vallabhbhai Patel Institute of Medical Sciences and Research. \n\nThis is state-of-the-art public hospital will provide top quality healthcare to the people of Gujarat.", "Over the next two days, I would be attending various programmes in Gujarat, including the Vibrant Gujarat Summit 2019. \n\nSince its inception in 2003, the Summit has played a key role in bringing more investment to Gujarat and enhancing the state’s progress.", "Adorable picture! Such support is my biggest source of strength.", "Happy to know. There is always so much to learn from Karyakartas and volunteers. \n\nTheir strong support is cherished by our Party.", "It is a wonderful family! :)", "These interactions via the NM Mobile App are healthy and extensive discussions between the family of BJP Karyakartas. There is no formality. \n\nBJP is proud of each and every Karyakarta, who makes the party strong.", "India's progress is not complete till the eastern part of our nation grows. \n\nIt is a privilege to work for the people of the region. \n\nTremendous work is underway in all sectors that will further 'Ease of Living.'", "Political stability, Decisive Leadership and a Clear Mandate – Their Relationship with Growth   https://bit.ly/2TLcxYg ", "Prayed for the development of India and the peace and happiness of 130 crore Indians at the Sree Padmanabhaswamy Temple.", "To the UDF and LDF I say: \n\nDo not under estimate the BJP Karyakarta.\n\nYour taunts & your violence cannot break the morale of the BJP Karyakarta.\n\nYou should see what happened in Tripura.\n\nWhat happened in Tripura, will happen in Kerala!", "The UDF and the LDF are two sides of the same old coin.", "If there is one party that has been at the forefront of standing with Kerala and its culture, it is the BJP.\n\nFor us, the people of Kerala and their aspirations are not a matter of convenience but of conviction.", "Today, India is growing rapidly. This is powered by the hard-work & talent of the people of our nation.\n\nFrom economy to ease of doing business & from start-ups to satellites, we are achieving great progress in each sector.", "The tribal communities of Odisha are the pride of the state. We can learn lots from their culture and traditions. \n\nThe NDA Government has taken numerous steps to improve education and sporting facilities, which will directly benefit tribal communities.", "We are happy that due to the efforts of the Centre, rail and air connectivity has improved across Odisha. \n\nWith better connectivity, comes more opportunity and faster development.", "Making every effort for Odisha’s progress.\n\nInaugurated/laid the foundations for projects worth over Rs. 1500 crore. These projects will have a transformative impact on Odisha’s progress.\n\nThey will also draw more tourists, who can see the exceptional Odia culture.", "Thank you Kollam for the warm welcome and support. Addressing a rally. Watch.", "Addressing a programme to mark the inauguration of Kollam bypass.", "Pariksha Pe Charcha 2.0 will be an interesting conversation with students, parents and teachers on exams, life and more. Participate in this unique contest and get a chance to be there at the event in Delhi!", "Best wishes to all those taking part in #GAvS2019!\n\nMay the Summit witness extensive and insightful discussions relating to the aviation sector.\n\nOur Government is actively working on enhancing aviation infrastructure, improving connectivity and making flying more affordable.", "Euphoric atmosphere at the rally in Balangir. Watch.", "Furthering ‘Ease of Living’ for Odisha’s citizens. Inaugurating development works in Balangir.", "प्रयागराज में आरंभ हो रहे पवित्र कुम्भ मेले की हार्दिक शुभकामनाएं। \n\nमुझे आशा है कि इस अवसर पर देश-विदेश के श्रद्धालुओं को भारत की आध्यात्मिक, सांस्कृतिक एवं सामाजिक विविधताओं के दर्शन होंगे। \n\nमेरी कामना है कि अधिक से अधिक लोग इस दिव्य और भव्य आयोजन का हिस्सा बनें।", "सेना दिवस के अवसर पर हमारे जवानों, पूर्व सैनिकों और उनके परिवारों को बहुत-बहुत शुभकामनाएं। हम सभी देशवासियों को अपने सैनिकों के दृढ़ संकल्प एवं समर्पण पर गर्व है। मैं उनके अदम्य साहस एवं वीरता को प्रणाम करता हूं।", "In Thiruvananthapuram I would visit the  Sree Padmanabhaswamy Temple. A series of welfare measures for pilgrims would be inaugurated as well.", "I look forward to visiting Kerala tomorrow. I would be in Kollam and Thiruvananthapuram for various programmes.\n\nThe Kollam bypass on NH-66 would be inaugurated. This project improve the traffic situation and enhance connectivity.", "More development works that will be inaugurated are:\n\nBridge no. 588 between Therubali-Singapur road station.\n\nPassport Sewa Kendras at Jagatsinghpur, Kendrapara, Puri, Kandhamal, Bargarh and Balangir.\n\nRenovation and restoration works at Asurgarh Fort in Kalahandi.", "Projects that would be inaugurated include:\n\n28.3 acre Multi Modal Logistics (MMLP) Jharsuguda.\n\nBalangir-Bicchupalli new rail line. \n\nElectrification of 813 km of Jharsuguda-Vizinagaram and Sambalpur-Angul lines.\n\nDoubling of Barpali-Dungaripali and Balangir-Deogaon road line.", "There is something special about Odisha, that draws me to the state so often! \n\nTomorrow I will be in Balangir to inaugurate and lay the foundation stones for several development works, which will have a transformative impact on Odisha’s progress.", "Happy #Uttarayan. \n\nMay you all scale new heights of progress in the times to come.", "Greetings on the special occasion of Magh Bihu.", "Best wishes on Pongal!", "#HappyMakarSankranti to everyone!", "I have often been a part of the anniversary celebrations of Thuglak but unfortunately, this time I have not been able to. However, I request the readers to send me their questions, which I would be glad to answer in the next issue. @sgurumurthy", "Greetings to the readers of Thuglak as the magazine marks its 49th anniversary. \n\nI also pay my tributes to the fearless and phenomenal Cho Ramaswamy, who nurtured Thuglak and took it to new heights.", "I want your direct feedback on various issues…take part in the survey on the ‘Narendra Modi Mobile App.'", "Have a great Lohri!", "The BJP is the party that can cater to the aspirations of the first time voter. \n\nSuch a voter wants development and not dynasty. \n\nSuch a voter wants performance and not promises. \n\nHence, we seek their blessings.", "Tamil Nadu has a strong MSME sector and we are proud of the spirit of enterprise the state is blessed with. \n\nA BJP Karyakarta asked me about the NDA government’s efforts for the sector. \n\nHere’s what I said.", "Made a request to BJP Karyakartas from all over India. Know what it is.", "A fruitful interaction with Tamil Nadu BJP Karyakartas. Watch.", "Releasing a commemorative coin in honour of Sri Guru Gobind Singh Ji.", "I bow to Sri Guru Gobind Singh Ji on his Jayanti.\n\nਮੈਂ ਸਾਹਿਬ-ਏ-ਕਮਾਲ ਸਰਬੰਸ ਦਾਨੀ ਸਾਹਿਬ ਸ੍ਰੀ ਗੁਰੂ ਗੋਬਿੰਦ ਸਿੰਘ ਮਹਾਰਾਜ ਜੀ ਦੇ ਪ੍ਰਕਾਸ਼ ਪੁਰਬ ਦੀ ਸਮੂਹ ਸੰਗਤਾਂ ਨੂੰ ਵਧਾਈ ਦਿੰਦਾ ਹਾਂ ਤੇ ਗੁਰੂ ਸਾਹਿਬ ਅੱਗੇ ਸੀਸ ਝੁਕਾਉਂਦਾ ਹਾਂ।", "यह लड़ाई सल्तनत और संविधान में आस्था रखने वाले लोगों के बीच है। एक तरफ वे लोग हैं जिन्हें हर हाल में केवल अपनी सल्तनत बचाए रखनी है और दूसरी तरफ हम लोग हैं, जो बाबासाहेब अंबेडकर के संविधान को मानते हैं, उसके अनुसार चलते है।", "देश मजबूत सरकार चाहता है, वो मजबूर सरकार चाहते हैं…", "We have come a long way.\n\nBack in the day, aeroplanes would wait to escort middlemen who were close to one party and one family.\n\nNow, middlemen are being forced to return to India.\n\nWhat they looted will have to be returned and those for whom they looted will be punished.", "There is a Common Process, and there is a Congress Process.\n\nThe Congress Process encouraged favouritism, corruption, nepotism and compromised India’s welfare.\n\nAfter coming to power, we transformed the processes and the results are for everyone to see.", "हमें काम से मतलब है, विपक्ष को नाम से मतलब है। फर्क साफ है।", "भाजपा किसानों के साथ कंधे से कंधा मिलाकर खड़ी है। \n\nअपने अन्नदाता को हम नए भारत की नई ऊर्जा का वाहक बनाना चाहते हैं।", "We want India’s youth to express and excel. \n\nThe Government is creating an environment that gives our Yuva Shakti the platform to showcase their skills as well as talents.", "भारतीय जनता पार्टी का एक ही मकसद है विकास। \n\nविकास के हमारे मंत्र का मूल है, सबका साथ, सबका विकास और एक भारत, श्रेष्ठ भारत।", "बीते चार-साढ़े चार वर्षों में जिस तरह भाजपा ने केंद्र और राज्यों में सरकारें चलाई हैं, उसने जनमानस में यह स्थापित कर दिया है कि देश को अगर नई ऊँचाई पर कोई राजनीतिक दल ले जा सकता है, तो वो भारतीय जनता पार्टी ही है।", "Addressing the @BJP4India meeting in Delhi. Watch.", "The thoughts and ideals of #SwamiVivekananda inspire and energise crores of Indians, particularly our youth. \n\nIt is from him that we draw the motivation of building an India that is strong, vibrant, inclusive and an India that takes global leadership in several areas.", "“Arise, awake and stop not till the goal is reached.”\n\nRemembering these powerful words, and the rich thoughts of the venerable #SwamiVivekananda on his Jayanti.\n\nHe emphasised on the ideals of service and renunciation. \n\nHis belief in Yuva Shakti was unwavering.", "Attended the @BJP4India National Convention in Delhi today.", "A TN BJP Karyakarta asked me about the record corruption in the Congress years, which was implicitly admitted by a former PM of their party and the honest, pro-people governance under NDA.\n\nThis is what I said to him.", "UPA did not bother about our defence sector. \n\nThey were always looking for deals, and so, naturally the nation suffered.", "I consider it my privilege that I got the opportunity to work for my sisters and brothers of Tamil Nadu.\n\nHere are some of the efforts undertaken by the Central Government.", "Collect, verify and correct.\n\nKnow what I said about how more technology has made access to information easier but also places a great responsibility on us.", "A BJP Karyakarta asked me about possible alliances in Tamil Nadu.\n\nHere is what I said.", "Commendable decisions taken by the GST council, which will greatly help MSMEs, traders and the services sector.\n\nWe remain committed to a simple and people-friendly GST.", "Talking to BJP Karyakartas from Tamil Nadu. Watch the interaction.", "It is in the Himalayas that I learnt about oneness with nature. The mighty mountains also taught me the importance of humility.\n\nHere is the second part of my chat with @HumansOfBombay, where I talk about an interesting phase of my life.\n\nhttps://www.facebook.com/188056068070045/posts/1023812607827716/ …", "By passing The Constitution (One Hundred And Twenty-Fourth Amendment) Bill, 2019, we pay tributes to the makers of our Constitution and the great freedom fighters, who envisioned an India that is strong and inclusive.", "Passage of The Constitution (One Hundred And Twenty-Fourth Amendment) Bill, 2019 in both Houses of Parliament is a victory for social justice.\n\nIt ensures a wider canvas for our Yuva Shakti to showcase their prowess and contribute towards India’s transformation.", "Delighted the Rajya Sabha has passed The Constitution (One Hundred And Twenty-Fourth Amendment) Bill, 2019. \n\nGlad to see such widespread support for the Bill. \n\nThe House also witnessed a vibrant debate, where several members expressed their insightful opinions.", "These pictures from Agra indicate the affection towards BJP.\n\nThe working of the Central Government and UP Government have endeared our Party to the people. \n\nOpportunist alliances will never be accepted by people.", "भ्रष्टाचार के खिलाफ साढ़े चार साल पहले आपने मुझे जो जनादेश दिया था, उस पर मैं पूरी क्षमता से खरा उतरने का प्रयास कर रहा हूं। \n\nइस कारण कैसे इस चौकीदार के खिलाफ कुछ लोग इकट्ठा होना शुरू हो गए हैं।", "वर्षों से आगरा के लोगों की एक मांग थी, जिसे हमारी सरकार को पूरा करने का सौभाग्य मिला है। \n\nजानिए, मैं किस मांग की बात कर रहा हूं।", "We are not only cleaning our villages and cities but also the corridors of power from the dirt of corruption and middlemen. No wonder, those who think it’s their divine right to rule dislike me vehemently. \n\nI will continue to clean the system and ensure transparency.", "Those who remained in power for several decades never accorded priority to ensuring housing for all. \n\nOn the contrary, their lack of concern forced people to be homeless. \n\nThe last 4 years witnessed record construction of houses, guided by a people-centric approach.", "Sharing some pictures from the massive gathering in Solapur.", "More sports, better health and a fitter nation! \n\n#5MinuteAur is a great effort that will further fitness levels across India. \n\nIt’s also wonderful to see noted athletes talk about their own experiences vis-à-vis spending more time on the field. @kheloindia", "My best wishes to all young friends taking part in the Khelo India Youth Games, which are beginning in Pune today. \n\nMay this tournament showcase the best sporting talent and give our youth a platform to fulfil their sporting dreams. @kheloindia", "Furthering ‘Ease of Living’ for people of Agra through development works.   Watch my speech.", "Hello Solapur!   Glad to be in this wonderful city. Addressing a public meeting. Watch.", "We are resolutely committed to the principle of ‘Sabka Saath, Sabka Vikas.’ \n\nIt is our endeavour to ensure that every poor person, irrespective of caste or creed gets to lead a life of dignity, and gets access to all possible opportunities.", "I thank MPs from all the parties who supported The Constitution (One Hundred And Twenty-Fourth Amendment) Bill, 2019 in the Lok Sabha. \n\nI also appreciate those MP colleagues who enriched today’s debate with their views.", "The passage of The Constitution (One Hundred And Twenty-Fourth Amendment) Bill, 2019 in the Lok Sabha is a landmark moment in our nation’s history. \n\nIt sets into motion the process to achieve an effective measure that ensures justice for all sections of society.", "Attended the Inaugural Session of #Raisina2019, addressed by PM @erna_solberg. \n\nShe shared insightful views on several subjects. @raisinadialogue", "In Agra, the foundation stones for the following projects will be laid:\n\nIntegrated Command and Control Centre for Agra Smart City. \n\nUpgradation of SN Medical College, Agra. \n\nVarious other development projects.", "Tomorrow, I look forward to being among the people of Agra. The Gangajal Project pertaining to water supply will be inaugurated. It will improve the water supply, benefiting Agra residents and tourists. Projects relating to health, sanitation, education will also be inaugurated.", "My discussions with PM @erna_solberg revolved around fulfilling Sustainable Development Goals, boost economic times, aspects of the ocean economy and deepening cultural ties. India and Norway look forward to cooperating on a wide range of issues, for the benefit of our citizens.", "During my recent visit to Mumbai, I sat down with the team of @HumansOfBombay and interacted with them about aspects of my life. \n\nHere is the first of the five part series. \n\nhttps://www.facebook.com/humansofbombay/photos/a.188058468069805/1021312724744371/?type=3&theater …", "The development projects will improve connectivity in Solapur and surrounding areas. The housing project will particularly help Beedi and textile workers. Sanitation and sewerage facilities will also improve. We are committed to furthering ‘Ease of Living’ for our citizens.", "The foundation stones of the following works will also be laid in Solapur:\n\nUnderground Sewerage System under AMRUT Mission.\nImprovement in Water Supply and Sewerage System.\nAugmentation of Drinking Water Supply from Ujani Dam to Solapur City.\nThese will greatly benefit citizens.", "I look forward to visiting Solapur tomorrow in connection with following development works:\nDedication of four-laning of Solapur-Osmanabad section of NH-211. \nFoundation Stone of 30,000 houses under PMAY. \n Launch of underground Sewerage System, and three Sewage Treatment Plants.", "Looking good, @ianuragthakur!", "Dear Hrithik, praying for the good health of Shri Rakesh Roshan Ji. He is a fighter and I am sure he will face this challenge with utmost courage. @RakeshRoshan_N", "Addressing the press with PM @erna_solberg. We had fruitful talks on strengthening India-Norway ties.", "A historic cricketing accomplishment in Australia! \n\nCongratulations to the Indian Cricket Team for the hard-fought and richly deserved series victory. \n\nThe series witnessed some memorable performances and solid teamwork. \n\nBest wishes for the various games ahead.", "Never underestimate a BJP Karyakarta. \n\nOur party is guided by the motive of serving Bharat Mata. \n\nWe are not here for power. We aren’t here to perpetuate family rule or build a fortune. \n\nOur Karyakartas are our family. They are our fortune.", "BJP Karyakartas across AP were asking me about the interface between political parties and the media. \n\nHere’s what I said. I urge friends in the media hear it as well. \n\nI also recalled a memory from 2001 when I was working in the Party organisation.", "People across AP are realising the lies of TDP and the state government. \n\nThe CM has betrayed the great NTR twice. \n\nTelugu pride is about working for the people diligently, not focusing on son-rise and corruption.", "Best wishes to Himachal Pradesh CM Shri Jairam Thakur. He has been working hard to develop Himachal Pradesh and empower the poor. I pray for his long and healthy life. @jairamthakurbjp", "Addressing the hardworking Andhra Pradesh BJP Karyakartas. Watch.", "Thank you Baripada for the great welcome. \n\nHere are pictures from the rally.", "Ayushman Bharat has revolutionised our health sector and is being widely praised all over. It has enabled a healthier life for the poor and downtrodden. I once again appeal to the Odisha Government to be a part of this scheme. They should forget politics and think of the poor.", "Quickening Odisha’s growth.", "Talked at length about Mission Indradhanush and how it manifests a new approach towards women and child welfare.", "The great Odia culture always gives topmost importance to women empowerment. \n\nHowever, the current Government in Odisha has not worked hard for the welfare of the state’s Nari Shakti.", "From Baripada in Odisha, here is how we paid tributes to the phenomenal men and women who fought valiantly for India’s freedom.", "हमारे लिए किसान अन्नदाता हैं, उनके लिए वोटबैंक।\n\nजब किसानों को कोई सिर्फ वोटबैंक समझता है तब वो आधी-अधूरी कर्जमाफी से आगे नहीं सोच पाता।\n\nहम यह सुनिश्चित करना चाहते हैं कि किसानों के ऊपर आर्थिक बोझ न रहे। उन्हें सिंचाई और तकनीक की बेहतर सुविधा मिले, जिससे उनकी आय दोगुनी हो।", "जब सरकार बिना भ्रष्टाचार के साफ नीयत से काम करती है तो परिणाम दिखता है।\n\nएक सिंचाई परियोजना जिसे दशकों पहले पूरा हो जाना चाहिए था, उसे कांग्रेस की सरकारों ने लगातार लटकाए रखा। \n\nहमने किसानों के कल्याण के लिए बड़ी सिंचाई परियोजनाओं को पुनर्जीवित किया है।", "We have transformed the housing sector. More houses are being built with better facilities, allocated without favouritism and aimed at women empowerment. \n\nCongress built few houses, allowed middlemen to make merry and named schemes after members of one family!", "Odisha supports BJP’s development agenda. Speaking at a huge rally in Baripada. Watch.", "Enhancing Jharkhand’s progress, reviving key projects. Addressing a public meeting in Palamu, Jharkhand.", "हमारे वरिष्ठ नेता, प्रखर विद्वान और पार्टी संगठन की मजबूती में अहम भूमिका निभाने वाले आदरणीय मुरली मनोहर जोशी जी को उनके जन्मदिन की बहुत-बहुत शुभकामनाएं। मैं उनके अच्छे स्वास्थ्य और लंबी आयु की कामना करता हूं।", "অবিস্মৰণীয় আদৰণিৰ বাবে মই সমগ্ৰ অসমবাসী ভাই-ভনীলৈ ধন্যবাদ জনাইছো । শিলচৰৰ এই আলোকচিত্ৰ সমূহে উৎসাহ-উদ্দীপনাৰ গভীৰতাক প্ৰতিফলিত কৰিছে। \n\nI thank my sisters and brothers of Assam for the memorable welcome. \n\nThese pictures from Silchar indicate the level of enthusiasm.", "A few days ago, we took a historic decision for the people of Assam. \n\nThis will go a long way in preserving the unique culture of Assam.", "The Citizenship Amendment Bill of 2016 is a sincere attempt to remove the injustices done in the past.", "My categorical assurance to my sisters and brothers of Assam regarding the NRC.", "In Imphal, paid tributes to the rich history and culture of Manipur including the bravery of people from this land in the freedom struggle. \n\nAlso talked about efforts to create better sporting infrastructure for the state’s youth. https://nm4.in/2VrY8lK ", "A paradigm shift in the way projects are initiated and completed. \n\nHappy to share that work on several projects, including the FCI Food Storage Godown at Sawombung started after 2014 and they have been completed.\n\n This ensures fast paced development.", "The Integrated Check Post at Moreh, which has been inaugurated today will offer a wide range of facilities to the people.\n\nThe Dolaithabi Barrage project was conceived in 1987 but work began at full pace only after 2014 and it was inaugurated today.", "When it comes to the development of the Northeast, our Government has left no stone unturned. \n\nThe contrast with previous Congress Governments, and the result of our efforts are for everyone to see.", "Defence Minister @nsitharaman's speech in the Parliament demolishes the campaign of calumny on Rafale. Must watch!\n\nhttps://youtu.be/yCoXwGJCV0o ", "Shri @arunjaitley's intervention on Jammu & Kashmir is incisive and informative. Do watch!", "Happy to be among the people of Assam. Watch my speech at Silchar.", "A boost to Manipur's growth.   Inaugurating key development projects in Imphal. Watch.", "Excellent! \n\nCongratulations to @sinha_arunima for scaling new heights of success. \n\nShe is the pride of India, who has distinguished herself through her hardwork and perseverance. \n\nWishing her the very best for her future endeavours.", "During the Cabinet meeting yesterday, a landmark decision was taken that benefits the MSME sector. \n\nKnow more...", "Our approach to GST has always been people friendly. \n\nWe have always sought feedback from various stakeholders and have acted on that feedback too.\n\nIn the coming times too, this approach will remain the same. \n\nWe are making GST as simple as possible.", "ਐਨਡੀਏ ਸਰਕਾਰ ਨੇ ਹਮੇਸ਼ਾ ਕਿਸਾਨਾਂ ਦੇ ਹੱਕਾਂ ਬਾਰੇ ਸੋਚਿਆ ਹੈ ਤੇ ਉਹਨਾਂ ਦੇ ਵਿਕਾਸ ਲਈ ਕਈ ਠੋਸ ਕਦਮ ਚੁੱਕੇ ਹਨ ਜਦਕਿ ਕਾਂਗਰਸ ਦਹਾਕਿਆਂ ਤੋਂ ਕਿਸਾਨਾਂ ਨੂੰ ਬਰਬਾਦ ਕਰਦੀ ਆਈ ਹੈ ਤੇ ਹਮੇੇਸ਼ਾ ਕਿਸਾਨਾਂ ਨੂੰ ਕਰਜ਼ੇ ਤੇ ਗਰੀਬੀ ਵੱਲ ਹੀ ਧੱਕਿਆ ਹੈ। ਐਨਡੀਏ ਸਰਕਾਰ ਕਿਸਾਨਾਂ ਲਈ ਸੀ, ਹੈ ਤੇ ਹਮੇਸ਼ਾ ਰਹੇਗੀ।", "Rewards, Congres style!\n\nIf one is associated with the 1984 anti-Sikh massacre, one gets to become MP, CM thanks to Congress.\n\nInstead of focussing on public welfare, their interest lies more in ensuring people do not sing Vande Mataram.\n\nVery sad...", "With the blessings of the people and the earnest desire to ensure more pilgrims can pray to Sri Guru Nanak Dev Ji, the NDA government has worked on the Kartarpur corridor. \n\nWe want to build an India that is inspired by the values of Sri Guru Nanak Dev Ji.", "ਗੁਰਦਾਸਪੁਰ ਤੇ ਸਮੂਹ ਪੰਜਾਬ ਵਾਸੀਆਂ ਦਾ ਇੰਨੇ ਪਿਆਰ ਤੇ ਸਤਿਕਾਰ ਦਾ ਬਹੁਤ-ਬਹੁਤ ਧੰਨਵਾਦ। ਅੱਜ ਗੁਰਦਾਸਪੁਰ ਰੈਲੀ ਦੀਆਂ ਕੁੱਝ ਤਸਵੀਰਾਂ ਸਾਂਝੀਆਂ ਕਰ ਰਿਹਾ। ਇੰਨੀ ਠੰਡ ਦੇ ਬਾਵਜੂਦ ਗੁਰਦਾਸਪੁਰ ਪਹੁੰਚੇ ਹਰ ਇੱਕ ਪੰਜਾਬੀ ਦਾ ਮੈਂ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹਾਂ।\n\n@BJP4Punjab @Akali_Dal_", "2018 was a great year for Indian science. \n\nOur nation achieved a lot and we must do a lot more in the years to come so that science continues to enhance India’s progress.", "Beloved Shastri Ji gave us the slogan- Jai Jawan, Jai Kisan.\n\n20 years ago, the great Atal Ji added Jai Vigyan.\n\nToday, the need of the our is to add Anusandhan (research) to it.\n\nJai Jawan, Jai Kisan, Jai Vigyan, Jai Anusandhan.", "India’s history in science, technology and innovation will make every Indian proud.\n\nA century ago, with minimum resources and maximum struggles our scientists did extraordinary things.", "Here are some pictures from the 106th Indian Science Congress.", "Great euphoria at the huge rally in Gurdaspur. Here is my speech.", "Speaking on ‘Future India: Science and Technology’ at the 106th Indian Science Congress. Watch.", "Our party is blessed to have the support of such hard-working volunteers.\nMy best wishes to everyone. Happy volunteering :)", "The Ujjwala Yojana continues to transform lives, emerging as an agent of change for the poor. Delighted that the number of beneficiaries has crossed 6 crore. \n\nCongratulations to the beneficiaries. The Yojana is ensuring women empowerment and better health in our society.", "A very emotional moment from today’s interaction with @BJP4Andhra Karyakartas…\n\nWe were honoured that Shri P V Chalapathi Rao Garu joined the interaction. \n\nThe wisdom and hardwork of Karyakartas like him have no parallel. They are the strength of the BJP!", "Karyakartas told me how NTR Garu referred to Congress as 'Dushta Congress' but for TDP today, it is 'Dost Congress.’\n\nPeople know the reality of TDP and Congress. \n\nBased on our work in the last 4.5 years, I can confidently say that it is BJP that will fulfil AP’s aspirations.", "To hide their own failures, the TDP Government in AP is spreading so many lies.\n\nBJP’s truth will defeat the Tsunami of TDP’s lies.\n\nIt is high time the AP Government answer the people of the state on their own misdoings.", "Several members of the Telugu community have prospered overseas.\n\nThus, it was natural for a Karyakarta from Andhra Pradesh to ask about the foreign policy of India and express joy about India’s rising stature at the world stage.", "Caring for every Indian, providing national, financial and healthcare security to our citizens.\n\nKnow what I told a Karyakarta from Machilipatnam on the unique work culture of the NDA Government.", "The 2019 polls are special because those born in the 21st century will also vote.\n\nRequested first time voters to bless @BJP4India and talked about why the BJP’s development agenda strikes a chord with people from all sections of society.", "Having a wonderful interaction with the hardworking @BJP4Andhra Karyakartas. Watch.", "Looking forward to interacting with @BJP4Andhra Karyakartas at 4 PM. \n\nDo watch.", "In case you missed it, here is my interview with @ANI. Have spoken about a wide range of issues. Watch!", "Kader Khan Ji brightened the screen with his stupendous acting skills and lightened it thanks to his unique sense of humour. \n\nHe was also a prolific screenwriter, associated with many memorable films. \n\nSaddened by his demise. Condolences to his family and admirers.", "Best wishes to Manipur’s dynamic CM Shri @NBirenSingh Ji on his birthday. He is working tirelessly for the development of the state. I pray for his long and healthy life.", "Wishing everyone a joyous 2019!\n\nMay everyone be happy and healthy. I pray that all your wishes are fulfilled in 2019.", "Had a good interaction with the newly elected Mayors from Haryana.\n\nCongratulated them and conveyed my best wishes as they begin their work in fulfilling the aspirations of the people of their respective cities. @BJP4Haryana", "Excellent effort! \n\nProud of our Party Karyakartas who are working tirelessly.", "Happy to know! My best wishes to you.", "Yes I agree. \n\nI urge more people to visit Prayagraj and take part in the Kumbh.", "When Jabalpur has passionate citizens like you, no force can prevent this city from being Swachh.", "Thank you. \n\nThis is a mark of respect for the brave Netaji Subhas Chandra Bose and all that he did for our nation.", "Met Gujarat Cabinet Minister Shri Kunvarjibhai Bavaliya. \n\nCongratulated him on his win in the Jasdan by-poll and conveyed my best wishes in his endeavours towards serving the people of Gujarat and further strengthening @BJP4Gujarat.", "Reiterated India's continued commitment to work together for the development of Bangladesh and further strengthening of our bilateral relations.", "Spoke to Sheikh Hasina Ji and congratulated her on the resounding victory in the Bangladesh elections. \n\nWished her the very best for the tenure ahead.", "Thank you 2018 for making us happy and proud.", "These pictures show the high level of enthusiasm at the public meeting in Port Blair.", "An initiative that will boost industrial growth in Andaman and Nicobar islands, as well as Lakshadweep.", "It is important for us as a nation to be proud of our rich history and those who toiled for our freedom.\n\nThe response of the people of Andaman and Nicobar islands to a decision taken by the Government must be seen to be believed!", "Today, the people of Andaman and Nicobar islands got many development projects. The progress of these islands is our priority. \n\nI do not agree with any differentiation between mainland and island…Andaman and Nicobar is as mainland as any other part of India.", "75 years ago, on this day, in the city of Port Blair, Netaji Subhas Chandra Bose addressed a large gathering.\n\nToday, we paid tributes to Netaji in a unique way. Watch.", "In 1943 Netaji Bose unfurled the Tricolour in Andaman and Nicobar islands.\n\nToday in Port Blair, I had the honour of unfurling the Tricolour to mark the 75th anniversary of Subhas Babu's brave feat. We also reiterate our commitment to creating an India Subhas Babu dreamt of.", "Among those imprisoned at Cellular Jail was the great Veer Savarkar. I visited the cell where the indomitable Veer Savarkar was lodged. Rigorous imprisonment did not dampen Veer Savarkar’s spirits and he continued to speak and write about a free India from jail too.", "Cellular Jail...this is where colonial rulers sent several nationalists and freedom fighters who fiercely resisted imperialism. \n\nToday, I had the privilege of visiting the Cellular Jail and paying homage to those greats who toiled for us and our freedom.", "There is immense fervour at the public meeting in Port Blair. Watch my speech live.", "Paid homage to those who lost their lives in the unfortunate 2004 Tsunami at the Tsunami Memorial in Car Nicobar.", "Have a look at the vibrancy in Car Nicobar. These are some pictures from the public meeting, where I got the opportunity to interact with citizens from all walks of life.", "Central Government’s efforts such as Sagarmala will have an extremely positive impact on the Andaman and Nicobar Islands. At the same time, we are working towards a Trans-shipment Port that will boost economic prospects. Connectivity will also be enhanced.", "Happy to announce important decisions relating to agriculture and fisheries. These will help protect local culture of the Andaman and Nicobar islands as well as increase livelihood opportunities.", "Giving wings to the aspirations of our Yuva Shakti. \n \nThe upcoming ITI will greatly benefit youngsters.\n \nThe Government is building vital sporting infrastructure, which will further popularize sports in the UT and boost fitness levels.", "Today in Car Nicobar, we inaugurated and laid the foundation stones for several development works.\n \nThese are projects relating to education, healthcare, skill development, transportation, energy and sports. \n \nCongratulations to the citizens!", "Our country is grateful to Shri Mrinal Sen for giving us some of the most memorable films. \n\nThe dexterity and sensitivity with which he made films is noteworthy. His rich work is admired across generations. \n\nSaddened by his demise. My thoughts are with his family and admirers.", "Appreciated the role of websites like http://thebetterindia.com , http://yourstory.com , http://thepositiveindia.com  in inspiring positivity in society. I urge you to share such efforts that you know of, and further positivity.", "Remembering Mahatma Gandhi and Madiba!\n\nAs we mark the 150th Jayanti of Bapu and the birth centenary of Madiba, we recall their ideals and reiterate our commitment to create a just and compassionate society.", "Spoke about a unique award named after Sardar Patel, that will further the spirit of unity and integration. #MannKiBaat", "In January 2019, the holy city of Prayagraj will host the Kumbh Mela. This is an important event, one with deep historical roots and an occasion for self-discovery. \n\nDo visit Prayagraj for the Kumbh and do share your photos on social media. #MannKiBaat", "Our festivals are occasions of celebrating togetherness. They also illustrate a deep connect with Mother Nature.", "Happy to be connecting once again, thanks to #MannKiBaat. Tune in.", "I thank the people of Tripura for their massive support to BJP in the civic polls. Gladdening to see the hard-work and efforts of karyakartas of @BJP4Tripura. This will give a further boost to the development of Tripura.", "बाबा विश्वनाथ की असीम कृपा हम सभी पर रही है।\n\nहमारा प्रयास है कि काशी की आत्मा से छेड़छाड़ किए बिना, हमारा ये चिर-पुरातन शहर नई काया के साथ दुनिया के सामने आए।", "Our Digital India initiative has brought convenience in the lives of crores of Indians and has also helped eliminate corruption.", "‘One District, One Product’ is a commendable initiative of the Uttar Pradesh Government, which will safeguard the well-being of all those associated with MSMEs, especially weaving and handicrafts.", "काशी में होना ही अपने आप में विशेष अनुभूति देता है। यहां के लोगों से मिले प्यार से मैं अभिभूत हूं। \n\nयहां विकास के कई कार्यों का लोकार्पण किया, जो काशी के लोगों के जीवन को और आसान बनाएगा।", "It is a matter of pride for Kashi that this great city is now home to the International Rice Research Institute South Asia Regional Centre. This Centre harnesses the power of technology and innovation for the benefit of our farmers.\n\nGlimpses from the inauguration today.", "Boosting the development of Kashi and UP. Addressing a programme in Varanasi.", "The moment Governments changed in MP and Rajasthan, urea shortages began and so have Lathis on farmers. \n\nIn Karnataka, farmers are suffering.\n\nOn what basis is Congress talking about farmer welfare? \n\nThe NDA govt. is taking many steps for a robust agriculture sector.", "गाजीपुर में बन रहा मेडिकल कॉलेज, पूर्वांचल को हेल्थकेयर हब बनाने की दिशा में एक बड़ा प्रयास है।\n\nहमारी कोशिश है कि पूर्वांचल के हमारे भाई-बहनों को उसी क्षेत्र में गुणवत्तापूर्ण और सस्ते से सस्ता उपचार मिले।"]}